/* automatically generated by rust-bindgen 0.70.1 */

pub const XR_VERSION_1_0: u32 = 1;
pub const XR_PTR_SIZE: u32 = 8;
pub const XR_CPP_NULLPTR_SUPPORTED: u32 = 0;
pub const XR_MIN_COMPOSITION_LAYERS_SUPPORTED: u32 = 16;
pub const XR_NULL_HANDLE: u32 = 0;
pub const XR_NULL_SYSTEM_ID: u32 = 0;
pub const XR_NULL_PATH: u32 = 0;
pub const XR_NO_DURATION: u32 = 0;
pub const XR_INFINITE_DURATION: u64 = 9223372036854775807;
pub const XR_MIN_HAPTIC_DURATION: i32 = -1;
pub const XR_FREQUENCY_UNSPECIFIED: u32 = 0;
pub const XR_EXTENSION_ENUM_BASE: u32 = 1000000000;
pub const XR_EXTENSION_ENUM_STRIDE: u32 = 1000;
pub const XR_TRUE: u32 = 1;
pub const XR_FALSE: u32 = 0;
pub const XR_MAX_EXTENSION_NAME_SIZE: u32 = 128;
pub const XR_MAX_API_LAYER_NAME_SIZE: u32 = 256;
pub const XR_MAX_API_LAYER_DESCRIPTION_SIZE: u32 = 256;
pub const XR_MAX_SYSTEM_NAME_SIZE: u32 = 256;
pub const XR_MAX_APPLICATION_NAME_SIZE: u32 = 128;
pub const XR_MAX_ENGINE_NAME_SIZE: u32 = 128;
pub const XR_MAX_RUNTIME_NAME_SIZE: u32 = 128;
pub const XR_MAX_PATH_LENGTH: u32 = 256;
pub const XR_MAX_STRUCTURE_NAME_SIZE: u32 = 64;
pub const XR_MAX_RESULT_STRING_SIZE: u32 = 64;
pub const XR_MAX_ACTION_SET_NAME_SIZE: u32 = 64;
pub const XR_MAX_LOCALIZED_ACTION_SET_NAME_SIZE: u32 = 128;
pub const XR_MAX_ACTION_NAME_SIZE: u32 = 64;
pub const XR_MAX_LOCALIZED_ACTION_NAME_SIZE: u32 = 128;
pub const XR_VERSION_1_1: u32 = 1;
pub const XR_UUID_SIZE: u32 = 16;
pub const XR_KHR_composition_layer_cube: u32 = 1;

pub type XrSpaceVelocityFlags = XrFlags64;
pub const XR_SPACE_VELOCITY_LINEAR_VALID_BIT: XrSpaceVelocityFlags = 1;
pub const XR_SPACE_VELOCITY_ANGULAR_VALID_BIT: XrSpaceVelocityFlags = 2;
pub type XrSpaceLocationFlags = XrFlags64;
pub const XR_SPACE_LOCATION_ORIENTATION_VALID_BIT: XrSpaceLocationFlags = 1;
pub const XR_SPACE_LOCATION_POSITION_VALID_BIT: XrSpaceLocationFlags = 2;
pub const XR_SPACE_LOCATION_ORIENTATION_TRACKED_BIT: XrSpaceLocationFlags = 4;
pub const XR_SPACE_LOCATION_POSITION_TRACKED_BIT: XrSpaceLocationFlags = 8;
pub type XrSwapchainCreateFlags = XrFlags64;
pub const XR_SWAPCHAIN_CREATE_PROTECTED_CONTENT_BIT: XrSwapchainCreateFlags = 1;
pub const XR_SWAPCHAIN_CREATE_STATIC_IMAGE_BIT: XrSwapchainCreateFlags = 2;
pub type XrSwapchainUsageFlags = XrFlags64;
pub const XR_SWAPCHAIN_USAGE_COLOR_ATTACHMENT_BIT: XrSwapchainUsageFlags = 1;
pub const XR_SWAPCHAIN_USAGE_DEPTH_STENCIL_ATTACHMENT_BIT: XrSwapchainUsageFlags = 2;
pub const XR_SWAPCHAIN_USAGE_UNORDERED_ACCESS_BIT: XrSwapchainUsageFlags = 4;
pub const XR_SWAPCHAIN_USAGE_TRANSFER_SRC_BIT: XrSwapchainUsageFlags = 8;
pub const XR_SWAPCHAIN_USAGE_TRANSFER_DST_BIT: XrSwapchainUsageFlags = 16;
pub const XR_SWAPCHAIN_USAGE_SAMPLED_BIT: XrSwapchainUsageFlags = 32;
pub const XR_SWAPCHAIN_USAGE_MUTABLE_FORMAT_BIT: XrSwapchainUsageFlags = 64;
pub const XR_SWAPCHAIN_USAGE_INPUT_ATTACHMENT_BIT_MND: XrSwapchainUsageFlags = 128;
pub const XR_SWAPCHAIN_USAGE_INPUT_ATTACHMENT_BIT_KHR: XrSwapchainUsageFlags = 128;
pub type XrCompositionLayerFlags = XrFlags64;
pub const XR_COMPOSITION_LAYER_CORRECT_CHROMATIC_ABERRATION_BIT: XrCompositionLayerFlags = 1;
pub const XR_COMPOSITION_LAYER_BLEND_TEXTURE_SOURCE_ALPHA_BIT: XrCompositionLayerFlags = 2;
pub const XR_COMPOSITION_LAYER_UNPREMULTIPLIED_ALPHA_BIT: XrCompositionLayerFlags = 4;
pub const XR_COMPOSITION_LAYER_INVERTED_ALPHA_BIT_EXT: XrCompositionLayerFlags = 8;
pub type XrViewStateFlags = XrFlags64;
pub const XR_VIEW_STATE_ORIENTATION_VALID_BIT: XrViewStateFlags = 1;
pub const XR_VIEW_STATE_POSITION_VALID_BIT: XrViewStateFlags = 2;
pub const XR_VIEW_STATE_ORIENTATION_TRACKED_BIT: XrViewStateFlags = 4;
pub const XR_VIEW_STATE_POSITION_TRACKED_BIT: XrViewStateFlags = 8;
pub type XrInputSourceLocalizedNameFlags = XrFlags64;
pub const XR_INPUT_SOURCE_LOCALIZED_NAME_USER_PATH_BIT: XrInputSourceLocalizedNameFlags = 1;
pub const XR_INPUT_SOURCE_LOCALIZED_NAME_INTERACTION_PROFILE_BIT: XrInputSourceLocalizedNameFlags =
    2;
pub const XR_INPUT_SOURCE_LOCALIZED_NAME_COMPONENT_BIT: XrInputSourceLocalizedNameFlags = 4;
pub type PFN_xrVoidFunction = ::std::option::Option<unsafe extern "C" fn()>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrApiLayerProperties {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub layerName: [::std::os::raw::c_char; 256usize],
    pub specVersion: XrVersion,
    pub layerVersion: u32,
    pub description: [::std::os::raw::c_char; 256usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrApiLayerProperties"][::std::mem::size_of::<XrApiLayerProperties>() - 544usize];
    ["Alignment of XrApiLayerProperties"][::std::mem::align_of::<XrApiLayerProperties>() - 8usize];
    ["Offset of field: XrApiLayerProperties::type_"]
        [::std::mem::offset_of!(XrApiLayerProperties, type_) - 0usize];
    ["Offset of field: XrApiLayerProperties::next"]
        [::std::mem::offset_of!(XrApiLayerProperties, next) - 8usize];
    ["Offset of field: XrApiLayerProperties::layerName"]
        [::std::mem::offset_of!(XrApiLayerProperties, layerName) - 16usize];
    ["Offset of field: XrApiLayerProperties::specVersion"]
        [::std::mem::offset_of!(XrApiLayerProperties, specVersion) - 272usize];
    ["Offset of field: XrApiLayerProperties::layerVersion"]
        [::std::mem::offset_of!(XrApiLayerProperties, layerVersion) - 280usize];
    ["Offset of field: XrApiLayerProperties::description"]
        [::std::mem::offset_of!(XrApiLayerProperties, description) - 284usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrExtensionProperties {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub extensionName: [::std::os::raw::c_char; 128usize],
    pub extensionVersion: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrExtensionProperties"][::std::mem::size_of::<XrExtensionProperties>() - 152usize];
    ["Alignment of XrExtensionProperties"]
        [::std::mem::align_of::<XrExtensionProperties>() - 8usize];
    ["Offset of field: XrExtensionProperties::type_"]
        [::std::mem::offset_of!(XrExtensionProperties, type_) - 0usize];
    ["Offset of field: XrExtensionProperties::next"]
        [::std::mem::offset_of!(XrExtensionProperties, next) - 8usize];
    ["Offset of field: XrExtensionProperties::extensionName"]
        [::std::mem::offset_of!(XrExtensionProperties, extensionName) - 16usize];
    ["Offset of field: XrExtensionProperties::extensionVersion"]
        [::std::mem::offset_of!(XrExtensionProperties, extensionVersion) - 144usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrApplicationInfo {
    pub applicationName: [::std::os::raw::c_char; 128usize],
    pub applicationVersion: u32,
    pub engineName: [::std::os::raw::c_char; 128usize],
    pub engineVersion: u32,
    pub apiVersion: XrVersion,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrApplicationInfo"][::std::mem::size_of::<XrApplicationInfo>() - 272usize];
    ["Alignment of XrApplicationInfo"][::std::mem::align_of::<XrApplicationInfo>() - 8usize];
    ["Offset of field: XrApplicationInfo::applicationName"]
        [::std::mem::offset_of!(XrApplicationInfo, applicationName) - 0usize];
    ["Offset of field: XrApplicationInfo::applicationVersion"]
        [::std::mem::offset_of!(XrApplicationInfo, applicationVersion) - 128usize];
    ["Offset of field: XrApplicationInfo::engineName"]
        [::std::mem::offset_of!(XrApplicationInfo, engineName) - 132usize];
    ["Offset of field: XrApplicationInfo::engineVersion"]
        [::std::mem::offset_of!(XrApplicationInfo, engineVersion) - 260usize];
    ["Offset of field: XrApplicationInfo::apiVersion"]
        [::std::mem::offset_of!(XrApplicationInfo, apiVersion) - 264usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrInstanceCreateInfo {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub createFlags: XrInstanceCreateFlags,
    pub applicationInfo: XrApplicationInfo,
    pub enabledApiLayerCount: u32,
    pub enabledApiLayerNames: *const *const ::std::os::raw::c_char,
    pub enabledExtensionCount: u32,
    pub enabledExtensionNames: *const *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrInstanceCreateInfo"][::std::mem::size_of::<XrInstanceCreateInfo>() - 328usize];
    ["Alignment of XrInstanceCreateInfo"][::std::mem::align_of::<XrInstanceCreateInfo>() - 8usize];
    ["Offset of field: XrInstanceCreateInfo::type_"]
        [::std::mem::offset_of!(XrInstanceCreateInfo, type_) - 0usize];
    ["Offset of field: XrInstanceCreateInfo::next"]
        [::std::mem::offset_of!(XrInstanceCreateInfo, next) - 8usize];
    ["Offset of field: XrInstanceCreateInfo::createFlags"]
        [::std::mem::offset_of!(XrInstanceCreateInfo, createFlags) - 16usize];
    ["Offset of field: XrInstanceCreateInfo::applicationInfo"]
        [::std::mem::offset_of!(XrInstanceCreateInfo, applicationInfo) - 24usize];
    ["Offset of field: XrInstanceCreateInfo::enabledApiLayerCount"]
        [::std::mem::offset_of!(XrInstanceCreateInfo, enabledApiLayerCount) - 296usize];
    ["Offset of field: XrInstanceCreateInfo::enabledApiLayerNames"]
        [::std::mem::offset_of!(XrInstanceCreateInfo, enabledApiLayerNames) - 304usize];
    ["Offset of field: XrInstanceCreateInfo::enabledExtensionCount"]
        [::std::mem::offset_of!(XrInstanceCreateInfo, enabledExtensionCount) - 312usize];
    ["Offset of field: XrInstanceCreateInfo::enabledExtensionNames"]
        [::std::mem::offset_of!(XrInstanceCreateInfo, enabledExtensionNames) - 320usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrInstanceProperties {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub runtimeVersion: XrVersion,
    pub runtimeName: [::std::os::raw::c_char; 128usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrInstanceProperties"][::std::mem::size_of::<XrInstanceProperties>() - 152usize];
    ["Alignment of XrInstanceProperties"][::std::mem::align_of::<XrInstanceProperties>() - 8usize];
    ["Offset of field: XrInstanceProperties::type_"]
        [::std::mem::offset_of!(XrInstanceProperties, type_) - 0usize];
    ["Offset of field: XrInstanceProperties::next"]
        [::std::mem::offset_of!(XrInstanceProperties, next) - 8usize];
    ["Offset of field: XrInstanceProperties::runtimeVersion"]
        [::std::mem::offset_of!(XrInstanceProperties, runtimeVersion) - 16usize];
    ["Offset of field: XrInstanceProperties::runtimeName"]
        [::std::mem::offset_of!(XrInstanceProperties, runtimeName) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrEventDataBuffer {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub varying: [u8; 4000usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrEventDataBuffer"][::std::mem::size_of::<XrEventDataBuffer>() - 4016usize];
    ["Alignment of XrEventDataBuffer"][::std::mem::align_of::<XrEventDataBuffer>() - 8usize];
    ["Offset of field: XrEventDataBuffer::type_"]
        [::std::mem::offset_of!(XrEventDataBuffer, type_) - 0usize];
    ["Offset of field: XrEventDataBuffer::next"]
        [::std::mem::offset_of!(XrEventDataBuffer, next) - 8usize];
    ["Offset of field: XrEventDataBuffer::varying"]
        [::std::mem::offset_of!(XrEventDataBuffer, varying) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSystemGetInfo {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub formFactor: XrFormFactor,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSystemGetInfo"][::std::mem::size_of::<XrSystemGetInfo>() - 24usize];
    ["Alignment of XrSystemGetInfo"][::std::mem::align_of::<XrSystemGetInfo>() - 8usize];
    ["Offset of field: XrSystemGetInfo::type_"]
        [::std::mem::offset_of!(XrSystemGetInfo, type_) - 0usize];
    ["Offset of field: XrSystemGetInfo::next"]
        [::std::mem::offset_of!(XrSystemGetInfo, next) - 8usize];
    ["Offset of field: XrSystemGetInfo::formFactor"]
        [::std::mem::offset_of!(XrSystemGetInfo, formFactor) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSystemGraphicsProperties {
    pub maxSwapchainImageHeight: u32,
    pub maxSwapchainImageWidth: u32,
    pub maxLayerCount: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSystemGraphicsProperties"]
        [::std::mem::size_of::<XrSystemGraphicsProperties>() - 12usize];
    ["Alignment of XrSystemGraphicsProperties"]
        [::std::mem::align_of::<XrSystemGraphicsProperties>() - 4usize];
    ["Offset of field: XrSystemGraphicsProperties::maxSwapchainImageHeight"]
        [::std::mem::offset_of!(XrSystemGraphicsProperties, maxSwapchainImageHeight) - 0usize];
    ["Offset of field: XrSystemGraphicsProperties::maxSwapchainImageWidth"]
        [::std::mem::offset_of!(XrSystemGraphicsProperties, maxSwapchainImageWidth) - 4usize];
    ["Offset of field: XrSystemGraphicsProperties::maxLayerCount"]
        [::std::mem::offset_of!(XrSystemGraphicsProperties, maxLayerCount) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSystemTrackingProperties {
    pub orientationTracking: XrBool32,
    pub positionTracking: XrBool32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSystemTrackingProperties"]
        [::std::mem::size_of::<XrSystemTrackingProperties>() - 8usize];
    ["Alignment of XrSystemTrackingProperties"]
        [::std::mem::align_of::<XrSystemTrackingProperties>() - 4usize];
    ["Offset of field: XrSystemTrackingProperties::orientationTracking"]
        [::std::mem::offset_of!(XrSystemTrackingProperties, orientationTracking) - 0usize];
    ["Offset of field: XrSystemTrackingProperties::positionTracking"]
        [::std::mem::offset_of!(XrSystemTrackingProperties, positionTracking) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSystemProperties {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub systemId: XrSystemId,
    pub vendorId: u32,
    pub systemName: [::std::os::raw::c_char; 256usize],
    pub graphicsProperties: XrSystemGraphicsProperties,
    pub trackingProperties: XrSystemTrackingProperties,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSystemProperties"][::std::mem::size_of::<XrSystemProperties>() - 304usize];
    ["Alignment of XrSystemProperties"][::std::mem::align_of::<XrSystemProperties>() - 8usize];
    ["Offset of field: XrSystemProperties::type_"]
        [::std::mem::offset_of!(XrSystemProperties, type_) - 0usize];
    ["Offset of field: XrSystemProperties::next"]
        [::std::mem::offset_of!(XrSystemProperties, next) - 8usize];
    ["Offset of field: XrSystemProperties::systemId"]
        [::std::mem::offset_of!(XrSystemProperties, systemId) - 16usize];
    ["Offset of field: XrSystemProperties::vendorId"]
        [::std::mem::offset_of!(XrSystemProperties, vendorId) - 24usize];
    ["Offset of field: XrSystemProperties::systemName"]
        [::std::mem::offset_of!(XrSystemProperties, systemName) - 28usize];
    ["Offset of field: XrSystemProperties::graphicsProperties"]
        [::std::mem::offset_of!(XrSystemProperties, graphicsProperties) - 284usize];
    ["Offset of field: XrSystemProperties::trackingProperties"]
        [::std::mem::offset_of!(XrSystemProperties, trackingProperties) - 296usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSessionCreateInfo {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub createFlags: XrSessionCreateFlags,
    pub systemId: XrSystemId,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSessionCreateInfo"][::std::mem::size_of::<XrSessionCreateInfo>() - 32usize];
    ["Alignment of XrSessionCreateInfo"][::std::mem::align_of::<XrSessionCreateInfo>() - 8usize];
    ["Offset of field: XrSessionCreateInfo::type_"]
        [::std::mem::offset_of!(XrSessionCreateInfo, type_) - 0usize];
    ["Offset of field: XrSessionCreateInfo::next"]
        [::std::mem::offset_of!(XrSessionCreateInfo, next) - 8usize];
    ["Offset of field: XrSessionCreateInfo::createFlags"]
        [::std::mem::offset_of!(XrSessionCreateInfo, createFlags) - 16usize];
    ["Offset of field: XrSessionCreateInfo::systemId"]
        [::std::mem::offset_of!(XrSessionCreateInfo, systemId) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrVector3f {
    pub x: f32,
    pub y: f32,
    pub z: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrVector3f"][::std::mem::size_of::<XrVector3f>() - 12usize];
    ["Alignment of XrVector3f"][::std::mem::align_of::<XrVector3f>() - 4usize];
    ["Offset of field: XrVector3f::x"][::std::mem::offset_of!(XrVector3f, x) - 0usize];
    ["Offset of field: XrVector3f::y"][::std::mem::offset_of!(XrVector3f, y) - 4usize];
    ["Offset of field: XrVector3f::z"][::std::mem::offset_of!(XrVector3f, z) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSpaceVelocity {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub velocityFlags: XrSpaceVelocityFlags,
    pub linearVelocity: XrVector3f,
    pub angularVelocity: XrVector3f,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSpaceVelocity"][::std::mem::size_of::<XrSpaceVelocity>() - 48usize];
    ["Alignment of XrSpaceVelocity"][::std::mem::align_of::<XrSpaceVelocity>() - 8usize];
    ["Offset of field: XrSpaceVelocity::type_"]
        [::std::mem::offset_of!(XrSpaceVelocity, type_) - 0usize];
    ["Offset of field: XrSpaceVelocity::next"]
        [::std::mem::offset_of!(XrSpaceVelocity, next) - 8usize];
    ["Offset of field: XrSpaceVelocity::velocityFlags"]
        [::std::mem::offset_of!(XrSpaceVelocity, velocityFlags) - 16usize];
    ["Offset of field: XrSpaceVelocity::linearVelocity"]
        [::std::mem::offset_of!(XrSpaceVelocity, linearVelocity) - 24usize];
    ["Offset of field: XrSpaceVelocity::angularVelocity"]
        [::std::mem::offset_of!(XrSpaceVelocity, angularVelocity) - 36usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrQuaternionf {
    pub x: f32,
    pub y: f32,
    pub z: f32,
    pub w: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrQuaternionf"][::std::mem::size_of::<XrQuaternionf>() - 16usize];
    ["Alignment of XrQuaternionf"][::std::mem::align_of::<XrQuaternionf>() - 4usize];
    ["Offset of field: XrQuaternionf::x"][::std::mem::offset_of!(XrQuaternionf, x) - 0usize];
    ["Offset of field: XrQuaternionf::y"][::std::mem::offset_of!(XrQuaternionf, y) - 4usize];
    ["Offset of field: XrQuaternionf::z"][::std::mem::offset_of!(XrQuaternionf, z) - 8usize];
    ["Offset of field: XrQuaternionf::w"][::std::mem::offset_of!(XrQuaternionf, w) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrPosef {
    pub orientation: XrQuaternionf,
    pub position: XrVector3f,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrPosef"][::std::mem::size_of::<XrPosef>() - 28usize];
    ["Alignment of XrPosef"][::std::mem::align_of::<XrPosef>() - 4usize];
    ["Offset of field: XrPosef::orientation"]
        [::std::mem::offset_of!(XrPosef, orientation) - 0usize];
    ["Offset of field: XrPosef::position"][::std::mem::offset_of!(XrPosef, position) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrReferenceSpaceCreateInfo {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub referenceSpaceType: XrReferenceSpaceType,
    pub poseInReferenceSpace: XrPosef,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrReferenceSpaceCreateInfo"]
        [::std::mem::size_of::<XrReferenceSpaceCreateInfo>() - 48usize];
    ["Alignment of XrReferenceSpaceCreateInfo"]
        [::std::mem::align_of::<XrReferenceSpaceCreateInfo>() - 8usize];
    ["Offset of field: XrReferenceSpaceCreateInfo::type_"]
        [::std::mem::offset_of!(XrReferenceSpaceCreateInfo, type_) - 0usize];
    ["Offset of field: XrReferenceSpaceCreateInfo::next"]
        [::std::mem::offset_of!(XrReferenceSpaceCreateInfo, next) - 8usize];
    ["Offset of field: XrReferenceSpaceCreateInfo::referenceSpaceType"]
        [::std::mem::offset_of!(XrReferenceSpaceCreateInfo, referenceSpaceType) - 16usize];
    ["Offset of field: XrReferenceSpaceCreateInfo::poseInReferenceSpace"]
        [::std::mem::offset_of!(XrReferenceSpaceCreateInfo, poseInReferenceSpace) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrExtent2Df {
    pub width: f32,
    pub height: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrExtent2Df"][::std::mem::size_of::<XrExtent2Df>() - 8usize];
    ["Alignment of XrExtent2Df"][::std::mem::align_of::<XrExtent2Df>() - 4usize];
    ["Offset of field: XrExtent2Df::width"][::std::mem::offset_of!(XrExtent2Df, width) - 0usize];
    ["Offset of field: XrExtent2Df::height"][::std::mem::offset_of!(XrExtent2Df, height) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrActionSpaceCreateInfo {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub action: XrAction,
    pub subactionPath: XrPath,
    pub poseInActionSpace: XrPosef,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrActionSpaceCreateInfo"][::std::mem::size_of::<XrActionSpaceCreateInfo>() - 64usize];
    ["Alignment of XrActionSpaceCreateInfo"]
        [::std::mem::align_of::<XrActionSpaceCreateInfo>() - 8usize];
    ["Offset of field: XrActionSpaceCreateInfo::type_"]
        [::std::mem::offset_of!(XrActionSpaceCreateInfo, type_) - 0usize];
    ["Offset of field: XrActionSpaceCreateInfo::next"]
        [::std::mem::offset_of!(XrActionSpaceCreateInfo, next) - 8usize];
    ["Offset of field: XrActionSpaceCreateInfo::action"]
        [::std::mem::offset_of!(XrActionSpaceCreateInfo, action) - 16usize];
    ["Offset of field: XrActionSpaceCreateInfo::subactionPath"]
        [::std::mem::offset_of!(XrActionSpaceCreateInfo, subactionPath) - 24usize];
    ["Offset of field: XrActionSpaceCreateInfo::poseInActionSpace"]
        [::std::mem::offset_of!(XrActionSpaceCreateInfo, poseInActionSpace) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSpaceLocation {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub locationFlags: XrSpaceLocationFlags,
    pub pose: XrPosef,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSpaceLocation"][::std::mem::size_of::<XrSpaceLocation>() - 56usize];
    ["Alignment of XrSpaceLocation"][::std::mem::align_of::<XrSpaceLocation>() - 8usize];
    ["Offset of field: XrSpaceLocation::type_"]
        [::std::mem::offset_of!(XrSpaceLocation, type_) - 0usize];
    ["Offset of field: XrSpaceLocation::next"]
        [::std::mem::offset_of!(XrSpaceLocation, next) - 8usize];
    ["Offset of field: XrSpaceLocation::locationFlags"]
        [::std::mem::offset_of!(XrSpaceLocation, locationFlags) - 16usize];
    ["Offset of field: XrSpaceLocation::pose"]
        [::std::mem::offset_of!(XrSpaceLocation, pose) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrViewConfigurationProperties {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub viewConfigurationType: XrViewConfigurationType,
    pub fovMutable: XrBool32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrViewConfigurationProperties"]
        [::std::mem::size_of::<XrViewConfigurationProperties>() - 24usize];
    ["Alignment of XrViewConfigurationProperties"]
        [::std::mem::align_of::<XrViewConfigurationProperties>() - 8usize];
    ["Offset of field: XrViewConfigurationProperties::type_"]
        [::std::mem::offset_of!(XrViewConfigurationProperties, type_) - 0usize];
    ["Offset of field: XrViewConfigurationProperties::next"]
        [::std::mem::offset_of!(XrViewConfigurationProperties, next) - 8usize];
    ["Offset of field: XrViewConfigurationProperties::viewConfigurationType"]
        [::std::mem::offset_of!(XrViewConfigurationProperties, viewConfigurationType) - 16usize];
    ["Offset of field: XrViewConfigurationProperties::fovMutable"]
        [::std::mem::offset_of!(XrViewConfigurationProperties, fovMutable) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrViewConfigurationView {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub recommendedImageRectWidth: u32,
    pub maxImageRectWidth: u32,
    pub recommendedImageRectHeight: u32,
    pub maxImageRectHeight: u32,
    pub recommendedSwapchainSampleCount: u32,
    pub maxSwapchainSampleCount: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrViewConfigurationView"][::std::mem::size_of::<XrViewConfigurationView>() - 40usize];
    ["Alignment of XrViewConfigurationView"]
        [::std::mem::align_of::<XrViewConfigurationView>() - 8usize];
    ["Offset of field: XrViewConfigurationView::type_"]
        [::std::mem::offset_of!(XrViewConfigurationView, type_) - 0usize];
    ["Offset of field: XrViewConfigurationView::next"]
        [::std::mem::offset_of!(XrViewConfigurationView, next) - 8usize];
    ["Offset of field: XrViewConfigurationView::recommendedImageRectWidth"]
        [::std::mem::offset_of!(XrViewConfigurationView, recommendedImageRectWidth) - 16usize];
    ["Offset of field: XrViewConfigurationView::maxImageRectWidth"]
        [::std::mem::offset_of!(XrViewConfigurationView, maxImageRectWidth) - 20usize];
    ["Offset of field: XrViewConfigurationView::recommendedImageRectHeight"]
        [::std::mem::offset_of!(XrViewConfigurationView, recommendedImageRectHeight) - 24usize];
    ["Offset of field: XrViewConfigurationView::maxImageRectHeight"]
        [::std::mem::offset_of!(XrViewConfigurationView, maxImageRectHeight) - 28usize];
    ["Offset of field: XrViewConfigurationView::recommendedSwapchainSampleCount"][::std::mem::offset_of!(
        XrViewConfigurationView,
        recommendedSwapchainSampleCount
    ) - 32usize];
    ["Offset of field: XrViewConfigurationView::maxSwapchainSampleCount"]
        [::std::mem::offset_of!(XrViewConfigurationView, maxSwapchainSampleCount) - 36usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSwapchainCreateInfo {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub createFlags: XrSwapchainCreateFlags,
    pub usageFlags: XrSwapchainUsageFlags,
    pub format: i64,
    pub sampleCount: u32,
    pub width: u32,
    pub height: u32,
    pub faceCount: u32,
    pub arraySize: u32,
    pub mipCount: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSwapchainCreateInfo"][::std::mem::size_of::<XrSwapchainCreateInfo>() - 64usize];
    ["Alignment of XrSwapchainCreateInfo"]
        [::std::mem::align_of::<XrSwapchainCreateInfo>() - 8usize];
    ["Offset of field: XrSwapchainCreateInfo::type_"]
        [::std::mem::offset_of!(XrSwapchainCreateInfo, type_) - 0usize];
    ["Offset of field: XrSwapchainCreateInfo::next"]
        [::std::mem::offset_of!(XrSwapchainCreateInfo, next) - 8usize];
    ["Offset of field: XrSwapchainCreateInfo::createFlags"]
        [::std::mem::offset_of!(XrSwapchainCreateInfo, createFlags) - 16usize];
    ["Offset of field: XrSwapchainCreateInfo::usageFlags"]
        [::std::mem::offset_of!(XrSwapchainCreateInfo, usageFlags) - 24usize];
    ["Offset of field: XrSwapchainCreateInfo::format"]
        [::std::mem::offset_of!(XrSwapchainCreateInfo, format) - 32usize];
    ["Offset of field: XrSwapchainCreateInfo::sampleCount"]
        [::std::mem::offset_of!(XrSwapchainCreateInfo, sampleCount) - 40usize];
    ["Offset of field: XrSwapchainCreateInfo::width"]
        [::std::mem::offset_of!(XrSwapchainCreateInfo, width) - 44usize];
    ["Offset of field: XrSwapchainCreateInfo::height"]
        [::std::mem::offset_of!(XrSwapchainCreateInfo, height) - 48usize];
    ["Offset of field: XrSwapchainCreateInfo::faceCount"]
        [::std::mem::offset_of!(XrSwapchainCreateInfo, faceCount) - 52usize];
    ["Offset of field: XrSwapchainCreateInfo::arraySize"]
        [::std::mem::offset_of!(XrSwapchainCreateInfo, arraySize) - 56usize];
    ["Offset of field: XrSwapchainCreateInfo::mipCount"]
        [::std::mem::offset_of!(XrSwapchainCreateInfo, mipCount) - 60usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSwapchainImageBaseHeader {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSwapchainImageBaseHeader"]
        [::std::mem::size_of::<XrSwapchainImageBaseHeader>() - 16usize];
    ["Alignment of XrSwapchainImageBaseHeader"]
        [::std::mem::align_of::<XrSwapchainImageBaseHeader>() - 8usize];
    ["Offset of field: XrSwapchainImageBaseHeader::type_"]
        [::std::mem::offset_of!(XrSwapchainImageBaseHeader, type_) - 0usize];
    ["Offset of field: XrSwapchainImageBaseHeader::next"]
        [::std::mem::offset_of!(XrSwapchainImageBaseHeader, next) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSwapchainImageAcquireInfo {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSwapchainImageAcquireInfo"]
        [::std::mem::size_of::<XrSwapchainImageAcquireInfo>() - 16usize];
    ["Alignment of XrSwapchainImageAcquireInfo"]
        [::std::mem::align_of::<XrSwapchainImageAcquireInfo>() - 8usize];
    ["Offset of field: XrSwapchainImageAcquireInfo::type_"]
        [::std::mem::offset_of!(XrSwapchainImageAcquireInfo, type_) - 0usize];
    ["Offset of field: XrSwapchainImageAcquireInfo::next"]
        [::std::mem::offset_of!(XrSwapchainImageAcquireInfo, next) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSwapchainImageWaitInfo {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub timeout: XrDuration,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSwapchainImageWaitInfo"]
        [::std::mem::size_of::<XrSwapchainImageWaitInfo>() - 24usize];
    ["Alignment of XrSwapchainImageWaitInfo"]
        [::std::mem::align_of::<XrSwapchainImageWaitInfo>() - 8usize];
    ["Offset of field: XrSwapchainImageWaitInfo::type_"]
        [::std::mem::offset_of!(XrSwapchainImageWaitInfo, type_) - 0usize];
    ["Offset of field: XrSwapchainImageWaitInfo::next"]
        [::std::mem::offset_of!(XrSwapchainImageWaitInfo, next) - 8usize];
    ["Offset of field: XrSwapchainImageWaitInfo::timeout"]
        [::std::mem::offset_of!(XrSwapchainImageWaitInfo, timeout) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSwapchainImageReleaseInfo {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSwapchainImageReleaseInfo"]
        [::std::mem::size_of::<XrSwapchainImageReleaseInfo>() - 16usize];
    ["Alignment of XrSwapchainImageReleaseInfo"]
        [::std::mem::align_of::<XrSwapchainImageReleaseInfo>() - 8usize];
    ["Offset of field: XrSwapchainImageReleaseInfo::type_"]
        [::std::mem::offset_of!(XrSwapchainImageReleaseInfo, type_) - 0usize];
    ["Offset of field: XrSwapchainImageReleaseInfo::next"]
        [::std::mem::offset_of!(XrSwapchainImageReleaseInfo, next) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSessionBeginInfo {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub primaryViewConfigurationType: XrViewConfigurationType,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSessionBeginInfo"][::std::mem::size_of::<XrSessionBeginInfo>() - 24usize];
    ["Alignment of XrSessionBeginInfo"][::std::mem::align_of::<XrSessionBeginInfo>() - 8usize];
    ["Offset of field: XrSessionBeginInfo::type_"]
        [::std::mem::offset_of!(XrSessionBeginInfo, type_) - 0usize];
    ["Offset of field: XrSessionBeginInfo::next"]
        [::std::mem::offset_of!(XrSessionBeginInfo, next) - 8usize];
    ["Offset of field: XrSessionBeginInfo::primaryViewConfigurationType"]
        [::std::mem::offset_of!(XrSessionBeginInfo, primaryViewConfigurationType) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrFrameWaitInfo {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrFrameWaitInfo"][::std::mem::size_of::<XrFrameWaitInfo>() - 16usize];
    ["Alignment of XrFrameWaitInfo"][::std::mem::align_of::<XrFrameWaitInfo>() - 8usize];
    ["Offset of field: XrFrameWaitInfo::type_"]
        [::std::mem::offset_of!(XrFrameWaitInfo, type_) - 0usize];
    ["Offset of field: XrFrameWaitInfo::next"]
        [::std::mem::offset_of!(XrFrameWaitInfo, next) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrFrameState {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub predictedDisplayTime: XrTime,
    pub predictedDisplayPeriod: XrDuration,
    pub shouldRender: XrBool32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrFrameState"][::std::mem::size_of::<XrFrameState>() - 40usize];
    ["Alignment of XrFrameState"][::std::mem::align_of::<XrFrameState>() - 8usize];
    ["Offset of field: XrFrameState::type_"][::std::mem::offset_of!(XrFrameState, type_) - 0usize];
    ["Offset of field: XrFrameState::next"][::std::mem::offset_of!(XrFrameState, next) - 8usize];
    ["Offset of field: XrFrameState::predictedDisplayTime"]
        [::std::mem::offset_of!(XrFrameState, predictedDisplayTime) - 16usize];
    ["Offset of field: XrFrameState::predictedDisplayPeriod"]
        [::std::mem::offset_of!(XrFrameState, predictedDisplayPeriod) - 24usize];
    ["Offset of field: XrFrameState::shouldRender"]
        [::std::mem::offset_of!(XrFrameState, shouldRender) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrFrameBeginInfo {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrFrameBeginInfo"][::std::mem::size_of::<XrFrameBeginInfo>() - 16usize];
    ["Alignment of XrFrameBeginInfo"][::std::mem::align_of::<XrFrameBeginInfo>() - 8usize];
    ["Offset of field: XrFrameBeginInfo::type_"]
        [::std::mem::offset_of!(XrFrameBeginInfo, type_) - 0usize];
    ["Offset of field: XrFrameBeginInfo::next"]
        [::std::mem::offset_of!(XrFrameBeginInfo, next) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrCompositionLayerBaseHeader {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub layerFlags: XrCompositionLayerFlags,
    pub space: XrSpace,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrCompositionLayerBaseHeader"]
        [::std::mem::size_of::<XrCompositionLayerBaseHeader>() - 32usize];
    ["Alignment of XrCompositionLayerBaseHeader"]
        [::std::mem::align_of::<XrCompositionLayerBaseHeader>() - 8usize];
    ["Offset of field: XrCompositionLayerBaseHeader::type_"]
        [::std::mem::offset_of!(XrCompositionLayerBaseHeader, type_) - 0usize];
    ["Offset of field: XrCompositionLayerBaseHeader::next"]
        [::std::mem::offset_of!(XrCompositionLayerBaseHeader, next) - 8usize];
    ["Offset of field: XrCompositionLayerBaseHeader::layerFlags"]
        [::std::mem::offset_of!(XrCompositionLayerBaseHeader, layerFlags) - 16usize];
    ["Offset of field: XrCompositionLayerBaseHeader::space"]
        [::std::mem::offset_of!(XrCompositionLayerBaseHeader, space) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrFrameEndInfo {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub displayTime: XrTime,
    pub environmentBlendMode: XrEnvironmentBlendMode,
    pub layerCount: u32,
    pub layers: *const *const XrCompositionLayerBaseHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrFrameEndInfo"][::std::mem::size_of::<XrFrameEndInfo>() - 40usize];
    ["Alignment of XrFrameEndInfo"][::std::mem::align_of::<XrFrameEndInfo>() - 8usize];
    ["Offset of field: XrFrameEndInfo::type_"]
        [::std::mem::offset_of!(XrFrameEndInfo, type_) - 0usize];
    ["Offset of field: XrFrameEndInfo::next"]
        [::std::mem::offset_of!(XrFrameEndInfo, next) - 8usize];
    ["Offset of field: XrFrameEndInfo::displayTime"]
        [::std::mem::offset_of!(XrFrameEndInfo, displayTime) - 16usize];
    ["Offset of field: XrFrameEndInfo::environmentBlendMode"]
        [::std::mem::offset_of!(XrFrameEndInfo, environmentBlendMode) - 24usize];
    ["Offset of field: XrFrameEndInfo::layerCount"]
        [::std::mem::offset_of!(XrFrameEndInfo, layerCount) - 28usize];
    ["Offset of field: XrFrameEndInfo::layers"]
        [::std::mem::offset_of!(XrFrameEndInfo, layers) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrViewLocateInfo {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub viewConfigurationType: XrViewConfigurationType,
    pub displayTime: XrTime,
    pub space: XrSpace,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrViewLocateInfo"][::std::mem::size_of::<XrViewLocateInfo>() - 40usize];
    ["Alignment of XrViewLocateInfo"][::std::mem::align_of::<XrViewLocateInfo>() - 8usize];
    ["Offset of field: XrViewLocateInfo::type_"]
        [::std::mem::offset_of!(XrViewLocateInfo, type_) - 0usize];
    ["Offset of field: XrViewLocateInfo::next"]
        [::std::mem::offset_of!(XrViewLocateInfo, next) - 8usize];
    ["Offset of field: XrViewLocateInfo::viewConfigurationType"]
        [::std::mem::offset_of!(XrViewLocateInfo, viewConfigurationType) - 16usize];
    ["Offset of field: XrViewLocateInfo::displayTime"]
        [::std::mem::offset_of!(XrViewLocateInfo, displayTime) - 24usize];
    ["Offset of field: XrViewLocateInfo::space"]
        [::std::mem::offset_of!(XrViewLocateInfo, space) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrViewState {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub viewStateFlags: XrViewStateFlags,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrViewState"][::std::mem::size_of::<XrViewState>() - 24usize];
    ["Alignment of XrViewState"][::std::mem::align_of::<XrViewState>() - 8usize];
    ["Offset of field: XrViewState::type_"][::std::mem::offset_of!(XrViewState, type_) - 0usize];
    ["Offset of field: XrViewState::next"][::std::mem::offset_of!(XrViewState, next) - 8usize];
    ["Offset of field: XrViewState::viewStateFlags"]
        [::std::mem::offset_of!(XrViewState, viewStateFlags) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrFovf {
    pub angleLeft: f32,
    pub angleRight: f32,
    pub angleUp: f32,
    pub angleDown: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrFovf"][::std::mem::size_of::<XrFovf>() - 16usize];
    ["Alignment of XrFovf"][::std::mem::align_of::<XrFovf>() - 4usize];
    ["Offset of field: XrFovf::angleLeft"][::std::mem::offset_of!(XrFovf, angleLeft) - 0usize];
    ["Offset of field: XrFovf::angleRight"][::std::mem::offset_of!(XrFovf, angleRight) - 4usize];
    ["Offset of field: XrFovf::angleUp"][::std::mem::offset_of!(XrFovf, angleUp) - 8usize];
    ["Offset of field: XrFovf::angleDown"][::std::mem::offset_of!(XrFovf, angleDown) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrView {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub pose: XrPosef,
    pub fov: XrFovf,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrView"][::std::mem::size_of::<XrView>() - 64usize];
    ["Alignment of XrView"][::std::mem::align_of::<XrView>() - 8usize];
    ["Offset of field: XrView::type_"][::std::mem::offset_of!(XrView, type_) - 0usize];
    ["Offset of field: XrView::next"][::std::mem::offset_of!(XrView, next) - 8usize];
    ["Offset of field: XrView::pose"][::std::mem::offset_of!(XrView, pose) - 16usize];
    ["Offset of field: XrView::fov"][::std::mem::offset_of!(XrView, fov) - 44usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrActionSetCreateInfo {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub actionSetName: [::std::os::raw::c_char; 64usize],
    pub localizedActionSetName: [::std::os::raw::c_char; 128usize],
    pub priority: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrActionSetCreateInfo"][::std::mem::size_of::<XrActionSetCreateInfo>() - 216usize];
    ["Alignment of XrActionSetCreateInfo"]
        [::std::mem::align_of::<XrActionSetCreateInfo>() - 8usize];
    ["Offset of field: XrActionSetCreateInfo::type_"]
        [::std::mem::offset_of!(XrActionSetCreateInfo, type_) - 0usize];
    ["Offset of field: XrActionSetCreateInfo::next"]
        [::std::mem::offset_of!(XrActionSetCreateInfo, next) - 8usize];
    ["Offset of field: XrActionSetCreateInfo::actionSetName"]
        [::std::mem::offset_of!(XrActionSetCreateInfo, actionSetName) - 16usize];
    ["Offset of field: XrActionSetCreateInfo::localizedActionSetName"]
        [::std::mem::offset_of!(XrActionSetCreateInfo, localizedActionSetName) - 80usize];
    ["Offset of field: XrActionSetCreateInfo::priority"]
        [::std::mem::offset_of!(XrActionSetCreateInfo, priority) - 208usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrActionCreateInfo {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub actionName: [::std::os::raw::c_char; 64usize],
    pub actionType: XrActionType,
    pub countSubactionPaths: u32,
    pub subactionPaths: *const XrPath,
    pub localizedActionName: [::std::os::raw::c_char; 128usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrActionCreateInfo"][::std::mem::size_of::<XrActionCreateInfo>() - 224usize];
    ["Alignment of XrActionCreateInfo"][::std::mem::align_of::<XrActionCreateInfo>() - 8usize];
    ["Offset of field: XrActionCreateInfo::type_"]
        [::std::mem::offset_of!(XrActionCreateInfo, type_) - 0usize];
    ["Offset of field: XrActionCreateInfo::next"]
        [::std::mem::offset_of!(XrActionCreateInfo, next) - 8usize];
    ["Offset of field: XrActionCreateInfo::actionName"]
        [::std::mem::offset_of!(XrActionCreateInfo, actionName) - 16usize];
    ["Offset of field: XrActionCreateInfo::actionType"]
        [::std::mem::offset_of!(XrActionCreateInfo, actionType) - 80usize];
    ["Offset of field: XrActionCreateInfo::countSubactionPaths"]
        [::std::mem::offset_of!(XrActionCreateInfo, countSubactionPaths) - 84usize];
    ["Offset of field: XrActionCreateInfo::subactionPaths"]
        [::std::mem::offset_of!(XrActionCreateInfo, subactionPaths) - 88usize];
    ["Offset of field: XrActionCreateInfo::localizedActionName"]
        [::std::mem::offset_of!(XrActionCreateInfo, localizedActionName) - 96usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrActionSuggestedBinding {
    pub action: XrAction,
    pub binding: XrPath,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrActionSuggestedBinding"]
        [::std::mem::size_of::<XrActionSuggestedBinding>() - 16usize];
    ["Alignment of XrActionSuggestedBinding"]
        [::std::mem::align_of::<XrActionSuggestedBinding>() - 8usize];
    ["Offset of field: XrActionSuggestedBinding::action"]
        [::std::mem::offset_of!(XrActionSuggestedBinding, action) - 0usize];
    ["Offset of field: XrActionSuggestedBinding::binding"]
        [::std::mem::offset_of!(XrActionSuggestedBinding, binding) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrInteractionProfileSuggestedBinding {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub interactionProfile: XrPath,
    pub countSuggestedBindings: u32,
    pub suggestedBindings: *const XrActionSuggestedBinding,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrInteractionProfileSuggestedBinding"]
        [::std::mem::size_of::<XrInteractionProfileSuggestedBinding>() - 40usize];
    ["Alignment of XrInteractionProfileSuggestedBinding"]
        [::std::mem::align_of::<XrInteractionProfileSuggestedBinding>() - 8usize];
    ["Offset of field: XrInteractionProfileSuggestedBinding::type_"]
        [::std::mem::offset_of!(XrInteractionProfileSuggestedBinding, type_) - 0usize];
    ["Offset of field: XrInteractionProfileSuggestedBinding::next"]
        [::std::mem::offset_of!(XrInteractionProfileSuggestedBinding, next) - 8usize];
    ["Offset of field: XrInteractionProfileSuggestedBinding::interactionProfile"][::std::mem::offset_of!(
        XrInteractionProfileSuggestedBinding,
        interactionProfile
    ) - 16usize];
    ["Offset of field: XrInteractionProfileSuggestedBinding::countSuggestedBindings"][::std::mem::offset_of!(
        XrInteractionProfileSuggestedBinding,
        countSuggestedBindings
    ) - 24usize];
    ["Offset of field: XrInteractionProfileSuggestedBinding::suggestedBindings"]
        [::std::mem::offset_of!(XrInteractionProfileSuggestedBinding, suggestedBindings) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSessionActionSetsAttachInfo {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub countActionSets: u32,
    pub actionSets: *const XrActionSet,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSessionActionSetsAttachInfo"]
        [::std::mem::size_of::<XrSessionActionSetsAttachInfo>() - 32usize];
    ["Alignment of XrSessionActionSetsAttachInfo"]
        [::std::mem::align_of::<XrSessionActionSetsAttachInfo>() - 8usize];
    ["Offset of field: XrSessionActionSetsAttachInfo::type_"]
        [::std::mem::offset_of!(XrSessionActionSetsAttachInfo, type_) - 0usize];
    ["Offset of field: XrSessionActionSetsAttachInfo::next"]
        [::std::mem::offset_of!(XrSessionActionSetsAttachInfo, next) - 8usize];
    ["Offset of field: XrSessionActionSetsAttachInfo::countActionSets"]
        [::std::mem::offset_of!(XrSessionActionSetsAttachInfo, countActionSets) - 16usize];
    ["Offset of field: XrSessionActionSetsAttachInfo::actionSets"]
        [::std::mem::offset_of!(XrSessionActionSetsAttachInfo, actionSets) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrInteractionProfileState {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub interactionProfile: XrPath,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrInteractionProfileState"]
        [::std::mem::size_of::<XrInteractionProfileState>() - 24usize];
    ["Alignment of XrInteractionProfileState"]
        [::std::mem::align_of::<XrInteractionProfileState>() - 8usize];
    ["Offset of field: XrInteractionProfileState::type_"]
        [::std::mem::offset_of!(XrInteractionProfileState, type_) - 0usize];
    ["Offset of field: XrInteractionProfileState::next"]
        [::std::mem::offset_of!(XrInteractionProfileState, next) - 8usize];
    ["Offset of field: XrInteractionProfileState::interactionProfile"]
        [::std::mem::offset_of!(XrInteractionProfileState, interactionProfile) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrActionStateGetInfo {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub action: XrAction,
    pub subactionPath: XrPath,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrActionStateGetInfo"][::std::mem::size_of::<XrActionStateGetInfo>() - 32usize];
    ["Alignment of XrActionStateGetInfo"][::std::mem::align_of::<XrActionStateGetInfo>() - 8usize];
    ["Offset of field: XrActionStateGetInfo::type_"]
        [::std::mem::offset_of!(XrActionStateGetInfo, type_) - 0usize];
    ["Offset of field: XrActionStateGetInfo::next"]
        [::std::mem::offset_of!(XrActionStateGetInfo, next) - 8usize];
    ["Offset of field: XrActionStateGetInfo::action"]
        [::std::mem::offset_of!(XrActionStateGetInfo, action) - 16usize];
    ["Offset of field: XrActionStateGetInfo::subactionPath"]
        [::std::mem::offset_of!(XrActionStateGetInfo, subactionPath) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrActionStateBoolean {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub currentState: XrBool32,
    pub changedSinceLastSync: XrBool32,
    pub lastChangeTime: XrTime,
    pub isActive: XrBool32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrActionStateBoolean"][::std::mem::size_of::<XrActionStateBoolean>() - 40usize];
    ["Alignment of XrActionStateBoolean"][::std::mem::align_of::<XrActionStateBoolean>() - 8usize];
    ["Offset of field: XrActionStateBoolean::type_"]
        [::std::mem::offset_of!(XrActionStateBoolean, type_) - 0usize];
    ["Offset of field: XrActionStateBoolean::next"]
        [::std::mem::offset_of!(XrActionStateBoolean, next) - 8usize];
    ["Offset of field: XrActionStateBoolean::currentState"]
        [::std::mem::offset_of!(XrActionStateBoolean, currentState) - 16usize];
    ["Offset of field: XrActionStateBoolean::changedSinceLastSync"]
        [::std::mem::offset_of!(XrActionStateBoolean, changedSinceLastSync) - 20usize];
    ["Offset of field: XrActionStateBoolean::lastChangeTime"]
        [::std::mem::offset_of!(XrActionStateBoolean, lastChangeTime) - 24usize];
    ["Offset of field: XrActionStateBoolean::isActive"]
        [::std::mem::offset_of!(XrActionStateBoolean, isActive) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrActionStateFloat {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub currentState: f32,
    pub changedSinceLastSync: XrBool32,
    pub lastChangeTime: XrTime,
    pub isActive: XrBool32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrActionStateFloat"][::std::mem::size_of::<XrActionStateFloat>() - 40usize];
    ["Alignment of XrActionStateFloat"][::std::mem::align_of::<XrActionStateFloat>() - 8usize];
    ["Offset of field: XrActionStateFloat::type_"]
        [::std::mem::offset_of!(XrActionStateFloat, type_) - 0usize];
    ["Offset of field: XrActionStateFloat::next"]
        [::std::mem::offset_of!(XrActionStateFloat, next) - 8usize];
    ["Offset of field: XrActionStateFloat::currentState"]
        [::std::mem::offset_of!(XrActionStateFloat, currentState) - 16usize];
    ["Offset of field: XrActionStateFloat::changedSinceLastSync"]
        [::std::mem::offset_of!(XrActionStateFloat, changedSinceLastSync) - 20usize];
    ["Offset of field: XrActionStateFloat::lastChangeTime"]
        [::std::mem::offset_of!(XrActionStateFloat, lastChangeTime) - 24usize];
    ["Offset of field: XrActionStateFloat::isActive"]
        [::std::mem::offset_of!(XrActionStateFloat, isActive) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrVector2f {
    pub x: f32,
    pub y: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrVector2f"][::std::mem::size_of::<XrVector2f>() - 8usize];
    ["Alignment of XrVector2f"][::std::mem::align_of::<XrVector2f>() - 4usize];
    ["Offset of field: XrVector2f::x"][::std::mem::offset_of!(XrVector2f, x) - 0usize];
    ["Offset of field: XrVector2f::y"][::std::mem::offset_of!(XrVector2f, y) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrActionStateVector2f {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub currentState: XrVector2f,
    pub changedSinceLastSync: XrBool32,
    pub lastChangeTime: XrTime,
    pub isActive: XrBool32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrActionStateVector2f"][::std::mem::size_of::<XrActionStateVector2f>() - 48usize];
    ["Alignment of XrActionStateVector2f"]
        [::std::mem::align_of::<XrActionStateVector2f>() - 8usize];
    ["Offset of field: XrActionStateVector2f::type_"]
        [::std::mem::offset_of!(XrActionStateVector2f, type_) - 0usize];
    ["Offset of field: XrActionStateVector2f::next"]
        [::std::mem::offset_of!(XrActionStateVector2f, next) - 8usize];
    ["Offset of field: XrActionStateVector2f::currentState"]
        [::std::mem::offset_of!(XrActionStateVector2f, currentState) - 16usize];
    ["Offset of field: XrActionStateVector2f::changedSinceLastSync"]
        [::std::mem::offset_of!(XrActionStateVector2f, changedSinceLastSync) - 24usize];
    ["Offset of field: XrActionStateVector2f::lastChangeTime"]
        [::std::mem::offset_of!(XrActionStateVector2f, lastChangeTime) - 32usize];
    ["Offset of field: XrActionStateVector2f::isActive"]
        [::std::mem::offset_of!(XrActionStateVector2f, isActive) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrActionStatePose {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub isActive: XrBool32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrActionStatePose"][::std::mem::size_of::<XrActionStatePose>() - 24usize];
    ["Alignment of XrActionStatePose"][::std::mem::align_of::<XrActionStatePose>() - 8usize];
    ["Offset of field: XrActionStatePose::type_"]
        [::std::mem::offset_of!(XrActionStatePose, type_) - 0usize];
    ["Offset of field: XrActionStatePose::next"]
        [::std::mem::offset_of!(XrActionStatePose, next) - 8usize];
    ["Offset of field: XrActionStatePose::isActive"]
        [::std::mem::offset_of!(XrActionStatePose, isActive) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrActiveActionSet {
    pub actionSet: XrActionSet,
    pub subactionPath: XrPath,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrActiveActionSet"][::std::mem::size_of::<XrActiveActionSet>() - 16usize];
    ["Alignment of XrActiveActionSet"][::std::mem::align_of::<XrActiveActionSet>() - 8usize];
    ["Offset of field: XrActiveActionSet::actionSet"]
        [::std::mem::offset_of!(XrActiveActionSet, actionSet) - 0usize];
    ["Offset of field: XrActiveActionSet::subactionPath"]
        [::std::mem::offset_of!(XrActiveActionSet, subactionPath) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrActionsSyncInfo {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub countActiveActionSets: u32,
    pub activeActionSets: *const XrActiveActionSet,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrActionsSyncInfo"][::std::mem::size_of::<XrActionsSyncInfo>() - 32usize];
    ["Alignment of XrActionsSyncInfo"][::std::mem::align_of::<XrActionsSyncInfo>() - 8usize];
    ["Offset of field: XrActionsSyncInfo::type_"]
        [::std::mem::offset_of!(XrActionsSyncInfo, type_) - 0usize];
    ["Offset of field: XrActionsSyncInfo::next"]
        [::std::mem::offset_of!(XrActionsSyncInfo, next) - 8usize];
    ["Offset of field: XrActionsSyncInfo::countActiveActionSets"]
        [::std::mem::offset_of!(XrActionsSyncInfo, countActiveActionSets) - 16usize];
    ["Offset of field: XrActionsSyncInfo::activeActionSets"]
        [::std::mem::offset_of!(XrActionsSyncInfo, activeActionSets) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrBoundSourcesForActionEnumerateInfo {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub action: XrAction,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrBoundSourcesForActionEnumerateInfo"]
        [::std::mem::size_of::<XrBoundSourcesForActionEnumerateInfo>() - 24usize];
    ["Alignment of XrBoundSourcesForActionEnumerateInfo"]
        [::std::mem::align_of::<XrBoundSourcesForActionEnumerateInfo>() - 8usize];
    ["Offset of field: XrBoundSourcesForActionEnumerateInfo::type_"]
        [::std::mem::offset_of!(XrBoundSourcesForActionEnumerateInfo, type_) - 0usize];
    ["Offset of field: XrBoundSourcesForActionEnumerateInfo::next"]
        [::std::mem::offset_of!(XrBoundSourcesForActionEnumerateInfo, next) - 8usize];
    ["Offset of field: XrBoundSourcesForActionEnumerateInfo::action"]
        [::std::mem::offset_of!(XrBoundSourcesForActionEnumerateInfo, action) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrInputSourceLocalizedNameGetInfo {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub sourcePath: XrPath,
    pub whichComponents: XrInputSourceLocalizedNameFlags,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrInputSourceLocalizedNameGetInfo"]
        [::std::mem::size_of::<XrInputSourceLocalizedNameGetInfo>() - 32usize];
    ["Alignment of XrInputSourceLocalizedNameGetInfo"]
        [::std::mem::align_of::<XrInputSourceLocalizedNameGetInfo>() - 8usize];
    ["Offset of field: XrInputSourceLocalizedNameGetInfo::type_"]
        [::std::mem::offset_of!(XrInputSourceLocalizedNameGetInfo, type_) - 0usize];
    ["Offset of field: XrInputSourceLocalizedNameGetInfo::next"]
        [::std::mem::offset_of!(XrInputSourceLocalizedNameGetInfo, next) - 8usize];
    ["Offset of field: XrInputSourceLocalizedNameGetInfo::sourcePath"]
        [::std::mem::offset_of!(XrInputSourceLocalizedNameGetInfo, sourcePath) - 16usize];
    ["Offset of field: XrInputSourceLocalizedNameGetInfo::whichComponents"]
        [::std::mem::offset_of!(XrInputSourceLocalizedNameGetInfo, whichComponents) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrHapticActionInfo {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub action: XrAction,
    pub subactionPath: XrPath,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrHapticActionInfo"][::std::mem::size_of::<XrHapticActionInfo>() - 32usize];
    ["Alignment of XrHapticActionInfo"][::std::mem::align_of::<XrHapticActionInfo>() - 8usize];
    ["Offset of field: XrHapticActionInfo::type_"]
        [::std::mem::offset_of!(XrHapticActionInfo, type_) - 0usize];
    ["Offset of field: XrHapticActionInfo::next"]
        [::std::mem::offset_of!(XrHapticActionInfo, next) - 8usize];
    ["Offset of field: XrHapticActionInfo::action"]
        [::std::mem::offset_of!(XrHapticActionInfo, action) - 16usize];
    ["Offset of field: XrHapticActionInfo::subactionPath"]
        [::std::mem::offset_of!(XrHapticActionInfo, subactionPath) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrHapticBaseHeader {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrHapticBaseHeader"][::std::mem::size_of::<XrHapticBaseHeader>() - 16usize];
    ["Alignment of XrHapticBaseHeader"][::std::mem::align_of::<XrHapticBaseHeader>() - 8usize];
    ["Offset of field: XrHapticBaseHeader::type_"]
        [::std::mem::offset_of!(XrHapticBaseHeader, type_) - 0usize];
    ["Offset of field: XrHapticBaseHeader::next"]
        [::std::mem::offset_of!(XrHapticBaseHeader, next) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrBaseInStructure {
    pub type_: XrStructureType,
    pub next: *const XrBaseInStructure,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrBaseInStructure"][::std::mem::size_of::<XrBaseInStructure>() - 16usize];
    ["Alignment of XrBaseInStructure"][::std::mem::align_of::<XrBaseInStructure>() - 8usize];
    ["Offset of field: XrBaseInStructure::type_"]
        [::std::mem::offset_of!(XrBaseInStructure, type_) - 0usize];
    ["Offset of field: XrBaseInStructure::next"]
        [::std::mem::offset_of!(XrBaseInStructure, next) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrBaseOutStructure {
    pub type_: XrStructureType,
    pub next: *mut XrBaseOutStructure,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrBaseOutStructure"][::std::mem::size_of::<XrBaseOutStructure>() - 16usize];
    ["Alignment of XrBaseOutStructure"][::std::mem::align_of::<XrBaseOutStructure>() - 8usize];
    ["Offset of field: XrBaseOutStructure::type_"]
        [::std::mem::offset_of!(XrBaseOutStructure, type_) - 0usize];
    ["Offset of field: XrBaseOutStructure::next"]
        [::std::mem::offset_of!(XrBaseOutStructure, next) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrOffset2Di {
    pub x: i32,
    pub y: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrOffset2Di"][::std::mem::size_of::<XrOffset2Di>() - 8usize];
    ["Alignment of XrOffset2Di"][::std::mem::align_of::<XrOffset2Di>() - 4usize];
    ["Offset of field: XrOffset2Di::x"][::std::mem::offset_of!(XrOffset2Di, x) - 0usize];
    ["Offset of field: XrOffset2Di::y"][::std::mem::offset_of!(XrOffset2Di, y) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrExtent2Di {
    pub width: i32,
    pub height: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrExtent2Di"][::std::mem::size_of::<XrExtent2Di>() - 8usize];
    ["Alignment of XrExtent2Di"][::std::mem::align_of::<XrExtent2Di>() - 4usize];
    ["Offset of field: XrExtent2Di::width"][::std::mem::offset_of!(XrExtent2Di, width) - 0usize];
    ["Offset of field: XrExtent2Di::height"][::std::mem::offset_of!(XrExtent2Di, height) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrRect2Di {
    pub offset: XrOffset2Di,
    pub extent: XrExtent2Di,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrRect2Di"][::std::mem::size_of::<XrRect2Di>() - 16usize];
    ["Alignment of XrRect2Di"][::std::mem::align_of::<XrRect2Di>() - 4usize];
    ["Offset of field: XrRect2Di::offset"][::std::mem::offset_of!(XrRect2Di, offset) - 0usize];
    ["Offset of field: XrRect2Di::extent"][::std::mem::offset_of!(XrRect2Di, extent) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSwapchainSubImage {
    pub swapchain: XrSwapchain,
    pub imageRect: XrRect2Di,
    pub imageArrayIndex: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSwapchainSubImage"][::std::mem::size_of::<XrSwapchainSubImage>() - 32usize];
    ["Alignment of XrSwapchainSubImage"][::std::mem::align_of::<XrSwapchainSubImage>() - 8usize];
    ["Offset of field: XrSwapchainSubImage::swapchain"]
        [::std::mem::offset_of!(XrSwapchainSubImage, swapchain) - 0usize];
    ["Offset of field: XrSwapchainSubImage::imageRect"]
        [::std::mem::offset_of!(XrSwapchainSubImage, imageRect) - 8usize];
    ["Offset of field: XrSwapchainSubImage::imageArrayIndex"]
        [::std::mem::offset_of!(XrSwapchainSubImage, imageArrayIndex) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrCompositionLayerProjectionView {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub pose: XrPosef,
    pub fov: XrFovf,
    pub subImage: XrSwapchainSubImage,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrCompositionLayerProjectionView"]
        [::std::mem::size_of::<XrCompositionLayerProjectionView>() - 96usize];
    ["Alignment of XrCompositionLayerProjectionView"]
        [::std::mem::align_of::<XrCompositionLayerProjectionView>() - 8usize];
    ["Offset of field: XrCompositionLayerProjectionView::type_"]
        [::std::mem::offset_of!(XrCompositionLayerProjectionView, type_) - 0usize];
    ["Offset of field: XrCompositionLayerProjectionView::next"]
        [::std::mem::offset_of!(XrCompositionLayerProjectionView, next) - 8usize];
    ["Offset of field: XrCompositionLayerProjectionView::pose"]
        [::std::mem::offset_of!(XrCompositionLayerProjectionView, pose) - 16usize];
    ["Offset of field: XrCompositionLayerProjectionView::fov"]
        [::std::mem::offset_of!(XrCompositionLayerProjectionView, fov) - 44usize];
    ["Offset of field: XrCompositionLayerProjectionView::subImage"]
        [::std::mem::offset_of!(XrCompositionLayerProjectionView, subImage) - 64usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrCompositionLayerProjection {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub layerFlags: XrCompositionLayerFlags,
    pub space: XrSpace,
    pub viewCount: u32,
    pub views: *const XrCompositionLayerProjectionView,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrCompositionLayerProjection"]
        [::std::mem::size_of::<XrCompositionLayerProjection>() - 48usize];
    ["Alignment of XrCompositionLayerProjection"]
        [::std::mem::align_of::<XrCompositionLayerProjection>() - 8usize];
    ["Offset of field: XrCompositionLayerProjection::type_"]
        [::std::mem::offset_of!(XrCompositionLayerProjection, type_) - 0usize];
    ["Offset of field: XrCompositionLayerProjection::next"]
        [::std::mem::offset_of!(XrCompositionLayerProjection, next) - 8usize];
    ["Offset of field: XrCompositionLayerProjection::layerFlags"]
        [::std::mem::offset_of!(XrCompositionLayerProjection, layerFlags) - 16usize];
    ["Offset of field: XrCompositionLayerProjection::space"]
        [::std::mem::offset_of!(XrCompositionLayerProjection, space) - 24usize];
    ["Offset of field: XrCompositionLayerProjection::viewCount"]
        [::std::mem::offset_of!(XrCompositionLayerProjection, viewCount) - 32usize];
    ["Offset of field: XrCompositionLayerProjection::views"]
        [::std::mem::offset_of!(XrCompositionLayerProjection, views) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrCompositionLayerQuad {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub layerFlags: XrCompositionLayerFlags,
    pub space: XrSpace,
    pub eyeVisibility: XrEyeVisibility,
    pub subImage: XrSwapchainSubImage,
    pub pose: XrPosef,
    pub size: XrExtent2Df,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrCompositionLayerQuad"][::std::mem::size_of::<XrCompositionLayerQuad>() - 112usize];
    ["Alignment of XrCompositionLayerQuad"]
        [::std::mem::align_of::<XrCompositionLayerQuad>() - 8usize];
    ["Offset of field: XrCompositionLayerQuad::type_"]
        [::std::mem::offset_of!(XrCompositionLayerQuad, type_) - 0usize];
    ["Offset of field: XrCompositionLayerQuad::next"]
        [::std::mem::offset_of!(XrCompositionLayerQuad, next) - 8usize];
    ["Offset of field: XrCompositionLayerQuad::layerFlags"]
        [::std::mem::offset_of!(XrCompositionLayerQuad, layerFlags) - 16usize];
    ["Offset of field: XrCompositionLayerQuad::space"]
        [::std::mem::offset_of!(XrCompositionLayerQuad, space) - 24usize];
    ["Offset of field: XrCompositionLayerQuad::eyeVisibility"]
        [::std::mem::offset_of!(XrCompositionLayerQuad, eyeVisibility) - 32usize];
    ["Offset of field: XrCompositionLayerQuad::subImage"]
        [::std::mem::offset_of!(XrCompositionLayerQuad, subImage) - 40usize];
    ["Offset of field: XrCompositionLayerQuad::pose"]
        [::std::mem::offset_of!(XrCompositionLayerQuad, pose) - 72usize];
    ["Offset of field: XrCompositionLayerQuad::size"]
        [::std::mem::offset_of!(XrCompositionLayerQuad, size) - 100usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrEventDataBaseHeader {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrEventDataBaseHeader"][::std::mem::size_of::<XrEventDataBaseHeader>() - 16usize];
    ["Alignment of XrEventDataBaseHeader"]
        [::std::mem::align_of::<XrEventDataBaseHeader>() - 8usize];
    ["Offset of field: XrEventDataBaseHeader::type_"]
        [::std::mem::offset_of!(XrEventDataBaseHeader, type_) - 0usize];
    ["Offset of field: XrEventDataBaseHeader::next"]
        [::std::mem::offset_of!(XrEventDataBaseHeader, next) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrEventDataEventsLost {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub lostEventCount: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrEventDataEventsLost"][::std::mem::size_of::<XrEventDataEventsLost>() - 24usize];
    ["Alignment of XrEventDataEventsLost"]
        [::std::mem::align_of::<XrEventDataEventsLost>() - 8usize];
    ["Offset of field: XrEventDataEventsLost::type_"]
        [::std::mem::offset_of!(XrEventDataEventsLost, type_) - 0usize];
    ["Offset of field: XrEventDataEventsLost::next"]
        [::std::mem::offset_of!(XrEventDataEventsLost, next) - 8usize];
    ["Offset of field: XrEventDataEventsLost::lostEventCount"]
        [::std::mem::offset_of!(XrEventDataEventsLost, lostEventCount) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrEventDataInstanceLossPending {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub lossTime: XrTime,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrEventDataInstanceLossPending"]
        [::std::mem::size_of::<XrEventDataInstanceLossPending>() - 24usize];
    ["Alignment of XrEventDataInstanceLossPending"]
        [::std::mem::align_of::<XrEventDataInstanceLossPending>() - 8usize];
    ["Offset of field: XrEventDataInstanceLossPending::type_"]
        [::std::mem::offset_of!(XrEventDataInstanceLossPending, type_) - 0usize];
    ["Offset of field: XrEventDataInstanceLossPending::next"]
        [::std::mem::offset_of!(XrEventDataInstanceLossPending, next) - 8usize];
    ["Offset of field: XrEventDataInstanceLossPending::lossTime"]
        [::std::mem::offset_of!(XrEventDataInstanceLossPending, lossTime) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrEventDataSessionStateChanged {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub session: XrSession,
    pub state: XrSessionState,
    pub time: XrTime,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrEventDataSessionStateChanged"]
        [::std::mem::size_of::<XrEventDataSessionStateChanged>() - 40usize];
    ["Alignment of XrEventDataSessionStateChanged"]
        [::std::mem::align_of::<XrEventDataSessionStateChanged>() - 8usize];
    ["Offset of field: XrEventDataSessionStateChanged::type_"]
        [::std::mem::offset_of!(XrEventDataSessionStateChanged, type_) - 0usize];
    ["Offset of field: XrEventDataSessionStateChanged::next"]
        [::std::mem::offset_of!(XrEventDataSessionStateChanged, next) - 8usize];
    ["Offset of field: XrEventDataSessionStateChanged::session"]
        [::std::mem::offset_of!(XrEventDataSessionStateChanged, session) - 16usize];
    ["Offset of field: XrEventDataSessionStateChanged::state"]
        [::std::mem::offset_of!(XrEventDataSessionStateChanged, state) - 24usize];
    ["Offset of field: XrEventDataSessionStateChanged::time"]
        [::std::mem::offset_of!(XrEventDataSessionStateChanged, time) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrEventDataReferenceSpaceChangePending {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub session: XrSession,
    pub referenceSpaceType: XrReferenceSpaceType,
    pub changeTime: XrTime,
    pub poseValid: XrBool32,
    pub poseInPreviousSpace: XrPosef,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrEventDataReferenceSpaceChangePending"]
        [::std::mem::size_of::<XrEventDataReferenceSpaceChangePending>() - 72usize];
    ["Alignment of XrEventDataReferenceSpaceChangePending"]
        [::std::mem::align_of::<XrEventDataReferenceSpaceChangePending>() - 8usize];
    ["Offset of field: XrEventDataReferenceSpaceChangePending::type_"]
        [::std::mem::offset_of!(XrEventDataReferenceSpaceChangePending, type_) - 0usize];
    ["Offset of field: XrEventDataReferenceSpaceChangePending::next"]
        [::std::mem::offset_of!(XrEventDataReferenceSpaceChangePending, next) - 8usize];
    ["Offset of field: XrEventDataReferenceSpaceChangePending::session"]
        [::std::mem::offset_of!(XrEventDataReferenceSpaceChangePending, session) - 16usize];
    ["Offset of field: XrEventDataReferenceSpaceChangePending::referenceSpaceType"][::std::mem::offset_of!(
        XrEventDataReferenceSpaceChangePending,
        referenceSpaceType
    ) - 24usize];
    ["Offset of field: XrEventDataReferenceSpaceChangePending::changeTime"]
        [::std::mem::offset_of!(XrEventDataReferenceSpaceChangePending, changeTime) - 32usize];
    ["Offset of field: XrEventDataReferenceSpaceChangePending::poseValid"]
        [::std::mem::offset_of!(XrEventDataReferenceSpaceChangePending, poseValid) - 40usize];
    ["Offset of field: XrEventDataReferenceSpaceChangePending::poseInPreviousSpace"][::std::mem::offset_of!(
        XrEventDataReferenceSpaceChangePending,
        poseInPreviousSpace
    ) - 44usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrEventDataInteractionProfileChanged {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub session: XrSession,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrEventDataInteractionProfileChanged"]
        [::std::mem::size_of::<XrEventDataInteractionProfileChanged>() - 24usize];
    ["Alignment of XrEventDataInteractionProfileChanged"]
        [::std::mem::align_of::<XrEventDataInteractionProfileChanged>() - 8usize];
    ["Offset of field: XrEventDataInteractionProfileChanged::type_"]
        [::std::mem::offset_of!(XrEventDataInteractionProfileChanged, type_) - 0usize];
    ["Offset of field: XrEventDataInteractionProfileChanged::next"]
        [::std::mem::offset_of!(XrEventDataInteractionProfileChanged, next) - 8usize];
    ["Offset of field: XrEventDataInteractionProfileChanged::session"]
        [::std::mem::offset_of!(XrEventDataInteractionProfileChanged, session) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrHapticVibration {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub duration: XrDuration,
    pub frequency: f32,
    pub amplitude: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrHapticVibration"][::std::mem::size_of::<XrHapticVibration>() - 32usize];
    ["Alignment of XrHapticVibration"][::std::mem::align_of::<XrHapticVibration>() - 8usize];
    ["Offset of field: XrHapticVibration::type_"]
        [::std::mem::offset_of!(XrHapticVibration, type_) - 0usize];
    ["Offset of field: XrHapticVibration::next"]
        [::std::mem::offset_of!(XrHapticVibration, next) - 8usize];
    ["Offset of field: XrHapticVibration::duration"]
        [::std::mem::offset_of!(XrHapticVibration, duration) - 16usize];
    ["Offset of field: XrHapticVibration::frequency"]
        [::std::mem::offset_of!(XrHapticVibration, frequency) - 24usize];
    ["Offset of field: XrHapticVibration::amplitude"]
        [::std::mem::offset_of!(XrHapticVibration, amplitude) - 28usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrOffset2Df {
    pub x: f32,
    pub y: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrOffset2Df"][::std::mem::size_of::<XrOffset2Df>() - 8usize];
    ["Alignment of XrOffset2Df"][::std::mem::align_of::<XrOffset2Df>() - 4usize];
    ["Offset of field: XrOffset2Df::x"][::std::mem::offset_of!(XrOffset2Df, x) - 0usize];
    ["Offset of field: XrOffset2Df::y"][::std::mem::offset_of!(XrOffset2Df, y) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrRect2Df {
    pub offset: XrOffset2Df,
    pub extent: XrExtent2Df,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrRect2Df"][::std::mem::size_of::<XrRect2Df>() - 16usize];
    ["Alignment of XrRect2Df"][::std::mem::align_of::<XrRect2Df>() - 4usize];
    ["Offset of field: XrRect2Df::offset"][::std::mem::offset_of!(XrRect2Df, offset) - 0usize];
    ["Offset of field: XrRect2Df::extent"][::std::mem::offset_of!(XrRect2Df, extent) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrVector4f {
    pub x: f32,
    pub y: f32,
    pub z: f32,
    pub w: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrVector4f"][::std::mem::size_of::<XrVector4f>() - 16usize];
    ["Alignment of XrVector4f"][::std::mem::align_of::<XrVector4f>() - 4usize];
    ["Offset of field: XrVector4f::x"][::std::mem::offset_of!(XrVector4f, x) - 0usize];
    ["Offset of field: XrVector4f::y"][::std::mem::offset_of!(XrVector4f, y) - 4usize];
    ["Offset of field: XrVector4f::z"][::std::mem::offset_of!(XrVector4f, z) - 8usize];
    ["Offset of field: XrVector4f::w"][::std::mem::offset_of!(XrVector4f, w) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrColor4f {
    pub r: f32,
    pub g: f32,
    pub b: f32,
    pub a: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrColor4f"][::std::mem::size_of::<XrColor4f>() - 16usize];
    ["Alignment of XrColor4f"][::std::mem::align_of::<XrColor4f>() - 4usize];
    ["Offset of field: XrColor4f::r"][::std::mem::offset_of!(XrColor4f, r) - 0usize];
    ["Offset of field: XrColor4f::g"][::std::mem::offset_of!(XrColor4f, g) - 4usize];
    ["Offset of field: XrColor4f::b"][::std::mem::offset_of!(XrColor4f, b) - 8usize];
    ["Offset of field: XrColor4f::a"][::std::mem::offset_of!(XrColor4f, a) - 12usize];
};
extern "C" {
    pub fn xrGetInstanceProcAddr(
        instance: XrInstance,
        name: *const ::std::os::raw::c_char,
        function: *mut PFN_xrVoidFunction,
    ) -> XrResult;
}
extern "C" {
    pub fn xrEnumerateApiLayerProperties(
        propertyCapacityInput: u32,
        propertyCountOutput: *mut u32,
        properties: *mut XrApiLayerProperties,
    ) -> XrResult;
}
extern "C" {
    pub fn xrEnumerateInstanceExtensionProperties(
        layerName: *const ::std::os::raw::c_char,
        propertyCapacityInput: u32,
        propertyCountOutput: *mut u32,
        properties: *mut XrExtensionProperties,
    ) -> XrResult;
}
extern "C" {
    pub fn xrCreateInstance(
        createInfo: *const XrInstanceCreateInfo,
        instance: *mut XrInstance,
    ) -> XrResult;
}
extern "C" {
    pub fn xrDestroyInstance(instance: XrInstance) -> XrResult;
}
extern "C" {
    pub fn xrGetInstanceProperties(
        instance: XrInstance,
        instanceProperties: *mut XrInstanceProperties,
    ) -> XrResult;
}
extern "C" {
    pub fn xrPollEvent(instance: XrInstance, eventData: *mut XrEventDataBuffer) -> XrResult;
}
extern "C" {
    pub fn xrResultToString(
        instance: XrInstance,
        value: XrResult,
        buffer: *mut ::std::os::raw::c_char,
    ) -> XrResult;
}
extern "C" {
    pub fn xrStructureTypeToString(
        instance: XrInstance,
        value: XrStructureType,
        buffer: *mut ::std::os::raw::c_char,
    ) -> XrResult;
}
extern "C" {
    pub fn xrGetSystem(
        instance: XrInstance,
        getInfo: *const XrSystemGetInfo,
        systemId: *mut XrSystemId,
    ) -> XrResult;
}
extern "C" {
    pub fn xrGetSystemProperties(
        instance: XrInstance,
        systemId: XrSystemId,
        properties: *mut XrSystemProperties,
    ) -> XrResult;
}
extern "C" {
    pub fn xrEnumerateEnvironmentBlendModes(
        instance: XrInstance,
        systemId: XrSystemId,
        viewConfigurationType: XrViewConfigurationType,
        environmentBlendModeCapacityInput: u32,
        environmentBlendModeCountOutput: *mut u32,
        environmentBlendModes: *mut XrEnvironmentBlendMode,
    ) -> XrResult;
}
extern "C" {
    pub fn xrCreateSession(
        instance: XrInstance,
        createInfo: *const XrSessionCreateInfo,
        session: *mut XrSession,
    ) -> XrResult;
}
extern "C" {
    pub fn xrDestroySession(session: XrSession) -> XrResult;
}
extern "C" {
    pub fn xrEnumerateReferenceSpaces(
        session: XrSession,
        spaceCapacityInput: u32,
        spaceCountOutput: *mut u32,
        spaces: *mut XrReferenceSpaceType,
    ) -> XrResult;
}
extern "C" {
    pub fn xrCreateReferenceSpace(
        session: XrSession,
        createInfo: *const XrReferenceSpaceCreateInfo,
        space: *mut XrSpace,
    ) -> XrResult;
}
extern "C" {
    pub fn xrGetReferenceSpaceBoundsRect(
        session: XrSession,
        referenceSpaceType: XrReferenceSpaceType,
        bounds: *mut XrExtent2Df,
    ) -> XrResult;
}
extern "C" {
    pub fn xrCreateActionSpace(
        session: XrSession,
        createInfo: *const XrActionSpaceCreateInfo,
        space: *mut XrSpace,
    ) -> XrResult;
}
extern "C" {
    pub fn xrLocateSpace(
        space: XrSpace,
        baseSpace: XrSpace,
        time: XrTime,
        location: *mut XrSpaceLocation,
    ) -> XrResult;
}
extern "C" {
    pub fn xrDestroySpace(space: XrSpace) -> XrResult;
}
extern "C" {
    pub fn xrEnumerateViewConfigurations(
        instance: XrInstance,
        systemId: XrSystemId,
        viewConfigurationTypeCapacityInput: u32,
        viewConfigurationTypeCountOutput: *mut u32,
        viewConfigurationTypes: *mut XrViewConfigurationType,
    ) -> XrResult;
}
extern "C" {
    pub fn xrGetViewConfigurationProperties(
        instance: XrInstance,
        systemId: XrSystemId,
        viewConfigurationType: XrViewConfigurationType,
        configurationProperties: *mut XrViewConfigurationProperties,
    ) -> XrResult;
}
extern "C" {
    pub fn xrEnumerateViewConfigurationViews(
        instance: XrInstance,
        systemId: XrSystemId,
        viewConfigurationType: XrViewConfigurationType,
        viewCapacityInput: u32,
        viewCountOutput: *mut u32,
        views: *mut XrViewConfigurationView,
    ) -> XrResult;
}
extern "C" {
    pub fn xrEnumerateSwapchainFormats(
        session: XrSession,
        formatCapacityInput: u32,
        formatCountOutput: *mut u32,
        formats: *mut i64,
    ) -> XrResult;
}
extern "C" {
    pub fn xrCreateSwapchain(
        session: XrSession,
        createInfo: *const XrSwapchainCreateInfo,
        swapchain: *mut XrSwapchain,
    ) -> XrResult;
}
extern "C" {
    pub fn xrDestroySwapchain(swapchain: XrSwapchain) -> XrResult;
}
extern "C" {
    pub fn xrEnumerateSwapchainImages(
        swapchain: XrSwapchain,
        imageCapacityInput: u32,
        imageCountOutput: *mut u32,
        images: *mut XrSwapchainImageBaseHeader,
    ) -> XrResult;
}
extern "C" {
    pub fn xrAcquireSwapchainImage(
        swapchain: XrSwapchain,
        acquireInfo: *const XrSwapchainImageAcquireInfo,
        index: *mut u32,
    ) -> XrResult;
}
extern "C" {
    pub fn xrWaitSwapchainImage(
        swapchain: XrSwapchain,
        waitInfo: *const XrSwapchainImageWaitInfo,
    ) -> XrResult;
}
extern "C" {
    pub fn xrReleaseSwapchainImage(
        swapchain: XrSwapchain,
        releaseInfo: *const XrSwapchainImageReleaseInfo,
    ) -> XrResult;
}
extern "C" {
    pub fn xrBeginSession(session: XrSession, beginInfo: *const XrSessionBeginInfo) -> XrResult;
}
extern "C" {
    pub fn xrEndSession(session: XrSession) -> XrResult;
}
extern "C" {
    pub fn xrRequestExitSession(session: XrSession) -> XrResult;
}
extern "C" {
    pub fn xrWaitFrame(
        session: XrSession,
        frameWaitInfo: *const XrFrameWaitInfo,
        frameState: *mut XrFrameState,
    ) -> XrResult;
}
extern "C" {
    pub fn xrBeginFrame(session: XrSession, frameBeginInfo: *const XrFrameBeginInfo) -> XrResult;
}
extern "C" {
    pub fn xrEndFrame(session: XrSession, frameEndInfo: *const XrFrameEndInfo) -> XrResult;
}
extern "C" {
    pub fn xrLocateViews(
        session: XrSession,
        viewLocateInfo: *const XrViewLocateInfo,
        viewState: *mut XrViewState,
        viewCapacityInput: u32,
        viewCountOutput: *mut u32,
        views: *mut XrView,
    ) -> XrResult;
}
extern "C" {
    pub fn xrStringToPath(
        instance: XrInstance,
        pathString: *const ::std::os::raw::c_char,
        path: *mut XrPath,
    ) -> XrResult;
}
extern "C" {
    pub fn xrPathToString(
        instance: XrInstance,
        path: XrPath,
        bufferCapacityInput: u32,
        bufferCountOutput: *mut u32,
        buffer: *mut ::std::os::raw::c_char,
    ) -> XrResult;
}
extern "C" {
    pub fn xrCreateActionSet(
        instance: XrInstance,
        createInfo: *const XrActionSetCreateInfo,
        actionSet: *mut XrActionSet,
    ) -> XrResult;
}
extern "C" {
    pub fn xrDestroyActionSet(actionSet: XrActionSet) -> XrResult;
}
extern "C" {
    pub fn xrCreateAction(
        actionSet: XrActionSet,
        createInfo: *const XrActionCreateInfo,
        action: *mut XrAction,
    ) -> XrResult;
}
extern "C" {
    pub fn xrDestroyAction(action: XrAction) -> XrResult;
}
extern "C" {
    pub fn xrSuggestInteractionProfileBindings(
        instance: XrInstance,
        suggestedBindings: *const XrInteractionProfileSuggestedBinding,
    ) -> XrResult;
}
extern "C" {
    pub fn xrAttachSessionActionSets(
        session: XrSession,
        attachInfo: *const XrSessionActionSetsAttachInfo,
    ) -> XrResult;
}
extern "C" {
    pub fn xrGetCurrentInteractionProfile(
        session: XrSession,
        topLevelUserPath: XrPath,
        interactionProfile: *mut XrInteractionProfileState,
    ) -> XrResult;
}
extern "C" {
    pub fn xrGetActionStateBoolean(
        session: XrSession,
        getInfo: *const XrActionStateGetInfo,
        state: *mut XrActionStateBoolean,
    ) -> XrResult;
}
extern "C" {
    pub fn xrGetActionStateFloat(
        session: XrSession,
        getInfo: *const XrActionStateGetInfo,
        state: *mut XrActionStateFloat,
    ) -> XrResult;
}
extern "C" {
    pub fn xrGetActionStateVector2f(
        session: XrSession,
        getInfo: *const XrActionStateGetInfo,
        state: *mut XrActionStateVector2f,
    ) -> XrResult;
}
extern "C" {
    pub fn xrGetActionStatePose(
        session: XrSession,
        getInfo: *const XrActionStateGetInfo,
        state: *mut XrActionStatePose,
    ) -> XrResult;
}
extern "C" {
    pub fn xrSyncActions(session: XrSession, syncInfo: *const XrActionsSyncInfo) -> XrResult;
}
extern "C" {
    pub fn xrEnumerateBoundSourcesForAction(
        session: XrSession,
        enumerateInfo: *const XrBoundSourcesForActionEnumerateInfo,
        sourceCapacityInput: u32,
        sourceCountOutput: *mut u32,
        sources: *mut XrPath,
    ) -> XrResult;
}
extern "C" {
    pub fn xrGetInputSourceLocalizedName(
        session: XrSession,
        getInfo: *const XrInputSourceLocalizedNameGetInfo,
        bufferCapacityInput: u32,
        bufferCountOutput: *mut u32,
        buffer: *mut ::std::os::raw::c_char,
    ) -> XrResult;
}
extern "C" {
    pub fn xrApplyHapticFeedback(
        session: XrSession,
        hapticActionInfo: *const XrHapticActionInfo,
        hapticFeedback: *const XrHapticBaseHeader,
    ) -> XrResult;
}
extern "C" {
    pub fn xrStopHapticFeedback(
        session: XrSession,
        hapticActionInfo: *const XrHapticActionInfo,
    ) -> XrResult;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrColor3f {
    pub r: f32,
    pub g: f32,
    pub b: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrColor3f"][::std::mem::size_of::<XrColor3f>() - 12usize];
    ["Alignment of XrColor3f"][::std::mem::align_of::<XrColor3f>() - 4usize];
    ["Offset of field: XrColor3f::r"][::std::mem::offset_of!(XrColor3f, r) - 0usize];
    ["Offset of field: XrColor3f::g"][::std::mem::offset_of!(XrColor3f, g) - 4usize];
    ["Offset of field: XrColor3f::b"][::std::mem::offset_of!(XrColor3f, b) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrExtent3Df {
    pub width: f32,
    pub height: f32,
    pub depth: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrExtent3Df"][::std::mem::size_of::<XrExtent3Df>() - 12usize];
    ["Alignment of XrExtent3Df"][::std::mem::align_of::<XrExtent3Df>() - 4usize];
    ["Offset of field: XrExtent3Df::width"][::std::mem::offset_of!(XrExtent3Df, width) - 0usize];
    ["Offset of field: XrExtent3Df::height"][::std::mem::offset_of!(XrExtent3Df, height) - 4usize];
    ["Offset of field: XrExtent3Df::depth"][::std::mem::offset_of!(XrExtent3Df, depth) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSpheref {
    pub center: XrPosef,
    pub radius: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSpheref"][::std::mem::size_of::<XrSpheref>() - 32usize];
    ["Alignment of XrSpheref"][::std::mem::align_of::<XrSpheref>() - 4usize];
    ["Offset of field: XrSpheref::center"][::std::mem::offset_of!(XrSpheref, center) - 0usize];
    ["Offset of field: XrSpheref::radius"][::std::mem::offset_of!(XrSpheref, radius) - 28usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrBoxf {
    pub center: XrPosef,
    pub extents: XrExtent3Df,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrBoxf"][::std::mem::size_of::<XrBoxf>() - 40usize];
    ["Alignment of XrBoxf"][::std::mem::align_of::<XrBoxf>() - 4usize];
    ["Offset of field: XrBoxf::center"][::std::mem::offset_of!(XrBoxf, center) - 0usize];
    ["Offset of field: XrBoxf::extents"][::std::mem::offset_of!(XrBoxf, extents) - 28usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrFrustumf {
    pub pose: XrPosef,
    pub fov: XrFovf,
    pub nearZ: f32,
    pub farZ: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrFrustumf"][::std::mem::size_of::<XrFrustumf>() - 52usize];
    ["Alignment of XrFrustumf"][::std::mem::align_of::<XrFrustumf>() - 4usize];
    ["Offset of field: XrFrustumf::pose"][::std::mem::offset_of!(XrFrustumf, pose) - 0usize];
    ["Offset of field: XrFrustumf::fov"][::std::mem::offset_of!(XrFrustumf, fov) - 28usize];
    ["Offset of field: XrFrustumf::nearZ"][::std::mem::offset_of!(XrFrustumf, nearZ) - 44usize];
    ["Offset of field: XrFrustumf::farZ"][::std::mem::offset_of!(XrFrustumf, farZ) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrUuid {
    pub data: [u8; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrUuid"][::std::mem::size_of::<XrUuid>() - 16usize];
    ["Alignment of XrUuid"][::std::mem::align_of::<XrUuid>() - 1usize];
    ["Offset of field: XrUuid::data"][::std::mem::offset_of!(XrUuid, data) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSpacesLocateInfo {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub baseSpace: XrSpace,
    pub time: XrTime,
    pub spaceCount: u32,
    pub spaces: *const XrSpace,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSpacesLocateInfo"][::std::mem::size_of::<XrSpacesLocateInfo>() - 48usize];
    ["Alignment of XrSpacesLocateInfo"][::std::mem::align_of::<XrSpacesLocateInfo>() - 8usize];
    ["Offset of field: XrSpacesLocateInfo::type_"]
        [::std::mem::offset_of!(XrSpacesLocateInfo, type_) - 0usize];
    ["Offset of field: XrSpacesLocateInfo::next"]
        [::std::mem::offset_of!(XrSpacesLocateInfo, next) - 8usize];
    ["Offset of field: XrSpacesLocateInfo::baseSpace"]
        [::std::mem::offset_of!(XrSpacesLocateInfo, baseSpace) - 16usize];
    ["Offset of field: XrSpacesLocateInfo::time"]
        [::std::mem::offset_of!(XrSpacesLocateInfo, time) - 24usize];
    ["Offset of field: XrSpacesLocateInfo::spaceCount"]
        [::std::mem::offset_of!(XrSpacesLocateInfo, spaceCount) - 32usize];
    ["Offset of field: XrSpacesLocateInfo::spaces"]
        [::std::mem::offset_of!(XrSpacesLocateInfo, spaces) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSpaceLocationData {
    pub locationFlags: XrSpaceLocationFlags,
    pub pose: XrPosef,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSpaceLocationData"][::std::mem::size_of::<XrSpaceLocationData>() - 40usize];
    ["Alignment of XrSpaceLocationData"][::std::mem::align_of::<XrSpaceLocationData>() - 8usize];
    ["Offset of field: XrSpaceLocationData::locationFlags"]
        [::std::mem::offset_of!(XrSpaceLocationData, locationFlags) - 0usize];
    ["Offset of field: XrSpaceLocationData::pose"]
        [::std::mem::offset_of!(XrSpaceLocationData, pose) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSpaceLocations {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub locationCount: u32,
    pub locations: *mut XrSpaceLocationData,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSpaceLocations"][::std::mem::size_of::<XrSpaceLocations>() - 32usize];
    ["Alignment of XrSpaceLocations"][::std::mem::align_of::<XrSpaceLocations>() - 8usize];
    ["Offset of field: XrSpaceLocations::type_"]
        [::std::mem::offset_of!(XrSpaceLocations, type_) - 0usize];
    ["Offset of field: XrSpaceLocations::next"]
        [::std::mem::offset_of!(XrSpaceLocations, next) - 8usize];
    ["Offset of field: XrSpaceLocations::locationCount"]
        [::std::mem::offset_of!(XrSpaceLocations, locationCount) - 16usize];
    ["Offset of field: XrSpaceLocations::locations"]
        [::std::mem::offset_of!(XrSpaceLocations, locations) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSpaceVelocityData {
    pub velocityFlags: XrSpaceVelocityFlags,
    pub linearVelocity: XrVector3f,
    pub angularVelocity: XrVector3f,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSpaceVelocityData"][::std::mem::size_of::<XrSpaceVelocityData>() - 32usize];
    ["Alignment of XrSpaceVelocityData"][::std::mem::align_of::<XrSpaceVelocityData>() - 8usize];
    ["Offset of field: XrSpaceVelocityData::velocityFlags"]
        [::std::mem::offset_of!(XrSpaceVelocityData, velocityFlags) - 0usize];
    ["Offset of field: XrSpaceVelocityData::linearVelocity"]
        [::std::mem::offset_of!(XrSpaceVelocityData, linearVelocity) - 8usize];
    ["Offset of field: XrSpaceVelocityData::angularVelocity"]
        [::std::mem::offset_of!(XrSpaceVelocityData, angularVelocity) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSpaceVelocities {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub velocityCount: u32,
    pub velocities: *mut XrSpaceVelocityData,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSpaceVelocities"][::std::mem::size_of::<XrSpaceVelocities>() - 32usize];
    ["Alignment of XrSpaceVelocities"][::std::mem::align_of::<XrSpaceVelocities>() - 8usize];
    ["Offset of field: XrSpaceVelocities::type_"]
        [::std::mem::offset_of!(XrSpaceVelocities, type_) - 0usize];
    ["Offset of field: XrSpaceVelocities::next"]
        [::std::mem::offset_of!(XrSpaceVelocities, next) - 8usize];
    ["Offset of field: XrSpaceVelocities::velocityCount"]
        [::std::mem::offset_of!(XrSpaceVelocities, velocityCount) - 16usize];
    ["Offset of field: XrSpaceVelocities::velocities"]
        [::std::mem::offset_of!(XrSpaceVelocities, velocities) - 24usize];
};
extern "C" {
    pub fn xrLocateSpaces(
        session: XrSession,
        locateInfo: *const XrSpacesLocateInfo,
        spaceLocations: *mut XrSpaceLocations,
    ) -> XrResult;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrCompositionLayerCubeKHR {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub layerFlags: XrCompositionLayerFlags,
    pub space: XrSpace,
    pub eyeVisibility: XrEyeVisibility,
    pub swapchain: XrSwapchain,
    pub imageArrayIndex: u32,
    pub orientation: XrQuaternionf,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrCompositionLayerCubeKHR"]
        [::std::mem::size_of::<XrCompositionLayerCubeKHR>() - 72usize];
    ["Alignment of XrCompositionLayerCubeKHR"]
        [::std::mem::align_of::<XrCompositionLayerCubeKHR>() - 8usize];
    ["Offset of field: XrCompositionLayerCubeKHR::type_"]
        [::std::mem::offset_of!(XrCompositionLayerCubeKHR, type_) - 0usize];
    ["Offset of field: XrCompositionLayerCubeKHR::next"]
        [::std::mem::offset_of!(XrCompositionLayerCubeKHR, next) - 8usize];
    ["Offset of field: XrCompositionLayerCubeKHR::layerFlags"]
        [::std::mem::offset_of!(XrCompositionLayerCubeKHR, layerFlags) - 16usize];
    ["Offset of field: XrCompositionLayerCubeKHR::space"]
        [::std::mem::offset_of!(XrCompositionLayerCubeKHR, space) - 24usize];
    ["Offset of field: XrCompositionLayerCubeKHR::eyeVisibility"]
        [::std::mem::offset_of!(XrCompositionLayerCubeKHR, eyeVisibility) - 32usize];
    ["Offset of field: XrCompositionLayerCubeKHR::swapchain"]
        [::std::mem::offset_of!(XrCompositionLayerCubeKHR, swapchain) - 40usize];
    ["Offset of field: XrCompositionLayerCubeKHR::imageArrayIndex"]
        [::std::mem::offset_of!(XrCompositionLayerCubeKHR, imageArrayIndex) - 48usize];
    ["Offset of field: XrCompositionLayerCubeKHR::orientation"]
        [::std::mem::offset_of!(XrCompositionLayerCubeKHR, orientation) - 52usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrCompositionLayerDepthInfoKHR {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub subImage: XrSwapchainSubImage,
    pub minDepth: f32,
    pub maxDepth: f32,
    pub nearZ: f32,
    pub farZ: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrCompositionLayerDepthInfoKHR"]
        [::std::mem::size_of::<XrCompositionLayerDepthInfoKHR>() - 64usize];
    ["Alignment of XrCompositionLayerDepthInfoKHR"]
        [::std::mem::align_of::<XrCompositionLayerDepthInfoKHR>() - 8usize];
    ["Offset of field: XrCompositionLayerDepthInfoKHR::type_"]
        [::std::mem::offset_of!(XrCompositionLayerDepthInfoKHR, type_) - 0usize];
    ["Offset of field: XrCompositionLayerDepthInfoKHR::next"]
        [::std::mem::offset_of!(XrCompositionLayerDepthInfoKHR, next) - 8usize];
    ["Offset of field: XrCompositionLayerDepthInfoKHR::subImage"]
        [::std::mem::offset_of!(XrCompositionLayerDepthInfoKHR, subImage) - 16usize];
    ["Offset of field: XrCompositionLayerDepthInfoKHR::minDepth"]
        [::std::mem::offset_of!(XrCompositionLayerDepthInfoKHR, minDepth) - 48usize];
    ["Offset of field: XrCompositionLayerDepthInfoKHR::maxDepth"]
        [::std::mem::offset_of!(XrCompositionLayerDepthInfoKHR, maxDepth) - 52usize];
    ["Offset of field: XrCompositionLayerDepthInfoKHR::nearZ"]
        [::std::mem::offset_of!(XrCompositionLayerDepthInfoKHR, nearZ) - 56usize];
    ["Offset of field: XrCompositionLayerDepthInfoKHR::farZ"]
        [::std::mem::offset_of!(XrCompositionLayerDepthInfoKHR, farZ) - 60usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrCompositionLayerCylinderKHR {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub layerFlags: XrCompositionLayerFlags,
    pub space: XrSpace,
    pub eyeVisibility: XrEyeVisibility,
    pub subImage: XrSwapchainSubImage,
    pub pose: XrPosef,
    pub radius: f32,
    pub centralAngle: f32,
    pub aspectRatio: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrCompositionLayerCylinderKHR"]
        [::std::mem::size_of::<XrCompositionLayerCylinderKHR>() - 112usize];
    ["Alignment of XrCompositionLayerCylinderKHR"]
        [::std::mem::align_of::<XrCompositionLayerCylinderKHR>() - 8usize];
    ["Offset of field: XrCompositionLayerCylinderKHR::type_"]
        [::std::mem::offset_of!(XrCompositionLayerCylinderKHR, type_) - 0usize];
    ["Offset of field: XrCompositionLayerCylinderKHR::next"]
        [::std::mem::offset_of!(XrCompositionLayerCylinderKHR, next) - 8usize];
    ["Offset of field: XrCompositionLayerCylinderKHR::layerFlags"]
        [::std::mem::offset_of!(XrCompositionLayerCylinderKHR, layerFlags) - 16usize];
    ["Offset of field: XrCompositionLayerCylinderKHR::space"]
        [::std::mem::offset_of!(XrCompositionLayerCylinderKHR, space) - 24usize];
    ["Offset of field: XrCompositionLayerCylinderKHR::eyeVisibility"]
        [::std::mem::offset_of!(XrCompositionLayerCylinderKHR, eyeVisibility) - 32usize];
    ["Offset of field: XrCompositionLayerCylinderKHR::subImage"]
        [::std::mem::offset_of!(XrCompositionLayerCylinderKHR, subImage) - 40usize];
    ["Offset of field: XrCompositionLayerCylinderKHR::pose"]
        [::std::mem::offset_of!(XrCompositionLayerCylinderKHR, pose) - 72usize];
    ["Offset of field: XrCompositionLayerCylinderKHR::radius"]
        [::std::mem::offset_of!(XrCompositionLayerCylinderKHR, radius) - 100usize];
    ["Offset of field: XrCompositionLayerCylinderKHR::centralAngle"]
        [::std::mem::offset_of!(XrCompositionLayerCylinderKHR, centralAngle) - 104usize];
    ["Offset of field: XrCompositionLayerCylinderKHR::aspectRatio"]
        [::std::mem::offset_of!(XrCompositionLayerCylinderKHR, aspectRatio) - 108usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrCompositionLayerEquirectKHR {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub layerFlags: XrCompositionLayerFlags,
    pub space: XrSpace,
    pub eyeVisibility: XrEyeVisibility,
    pub subImage: XrSwapchainSubImage,
    pub pose: XrPosef,
    pub radius: f32,
    pub scale: XrVector2f,
    pub bias: XrVector2f,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrCompositionLayerEquirectKHR"]
        [::std::mem::size_of::<XrCompositionLayerEquirectKHR>() - 120usize];
    ["Alignment of XrCompositionLayerEquirectKHR"]
        [::std::mem::align_of::<XrCompositionLayerEquirectKHR>() - 8usize];
    ["Offset of field: XrCompositionLayerEquirectKHR::type_"]
        [::std::mem::offset_of!(XrCompositionLayerEquirectKHR, type_) - 0usize];
    ["Offset of field: XrCompositionLayerEquirectKHR::next"]
        [::std::mem::offset_of!(XrCompositionLayerEquirectKHR, next) - 8usize];
    ["Offset of field: XrCompositionLayerEquirectKHR::layerFlags"]
        [::std::mem::offset_of!(XrCompositionLayerEquirectKHR, layerFlags) - 16usize];
    ["Offset of field: XrCompositionLayerEquirectKHR::space"]
        [::std::mem::offset_of!(XrCompositionLayerEquirectKHR, space) - 24usize];
    ["Offset of field: XrCompositionLayerEquirectKHR::eyeVisibility"]
        [::std::mem::offset_of!(XrCompositionLayerEquirectKHR, eyeVisibility) - 32usize];
    ["Offset of field: XrCompositionLayerEquirectKHR::subImage"]
        [::std::mem::offset_of!(XrCompositionLayerEquirectKHR, subImage) - 40usize];
    ["Offset of field: XrCompositionLayerEquirectKHR::pose"]
        [::std::mem::offset_of!(XrCompositionLayerEquirectKHR, pose) - 72usize];
    ["Offset of field: XrCompositionLayerEquirectKHR::radius"]
        [::std::mem::offset_of!(XrCompositionLayerEquirectKHR, radius) - 100usize];
    ["Offset of field: XrCompositionLayerEquirectKHR::scale"]
        [::std::mem::offset_of!(XrCompositionLayerEquirectKHR, scale) - 104usize];
    ["Offset of field: XrCompositionLayerEquirectKHR::bias"]
        [::std::mem::offset_of!(XrCompositionLayerEquirectKHR, bias) - 112usize];
};
pub const XrVisibilityMaskTypeKHR_XR_VISIBILITY_MASK_TYPE_HIDDEN_TRIANGLE_MESH_KHR:
    XrVisibilityMaskTypeKHR = 1;
pub const XrVisibilityMaskTypeKHR_XR_VISIBILITY_MASK_TYPE_VISIBLE_TRIANGLE_MESH_KHR:
    XrVisibilityMaskTypeKHR = 2;
pub const XrVisibilityMaskTypeKHR_XR_VISIBILITY_MASK_TYPE_LINE_LOOP_KHR: XrVisibilityMaskTypeKHR =
    3;
pub const XrVisibilityMaskTypeKHR_XR_VISIBILITY_MASK_TYPE_MAX_ENUM_KHR: XrVisibilityMaskTypeKHR =
    2147483647;
pub type XrVisibilityMaskTypeKHR = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrVisibilityMaskKHR {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub vertexCapacityInput: u32,
    pub vertexCountOutput: u32,
    pub vertices: *mut XrVector2f,
    pub indexCapacityInput: u32,
    pub indexCountOutput: u32,
    pub indices: *mut u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrVisibilityMaskKHR"][::std::mem::size_of::<XrVisibilityMaskKHR>() - 48usize];
    ["Alignment of XrVisibilityMaskKHR"][::std::mem::align_of::<XrVisibilityMaskKHR>() - 8usize];
    ["Offset of field: XrVisibilityMaskKHR::type_"]
        [::std::mem::offset_of!(XrVisibilityMaskKHR, type_) - 0usize];
    ["Offset of field: XrVisibilityMaskKHR::next"]
        [::std::mem::offset_of!(XrVisibilityMaskKHR, next) - 8usize];
    ["Offset of field: XrVisibilityMaskKHR::vertexCapacityInput"]
        [::std::mem::offset_of!(XrVisibilityMaskKHR, vertexCapacityInput) - 16usize];
    ["Offset of field: XrVisibilityMaskKHR::vertexCountOutput"]
        [::std::mem::offset_of!(XrVisibilityMaskKHR, vertexCountOutput) - 20usize];
    ["Offset of field: XrVisibilityMaskKHR::vertices"]
        [::std::mem::offset_of!(XrVisibilityMaskKHR, vertices) - 24usize];
    ["Offset of field: XrVisibilityMaskKHR::indexCapacityInput"]
        [::std::mem::offset_of!(XrVisibilityMaskKHR, indexCapacityInput) - 32usize];
    ["Offset of field: XrVisibilityMaskKHR::indexCountOutput"]
        [::std::mem::offset_of!(XrVisibilityMaskKHR, indexCountOutput) - 36usize];
    ["Offset of field: XrVisibilityMaskKHR::indices"]
        [::std::mem::offset_of!(XrVisibilityMaskKHR, indices) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrEventDataVisibilityMaskChangedKHR {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub session: XrSession,
    pub viewConfigurationType: XrViewConfigurationType,
    pub viewIndex: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrEventDataVisibilityMaskChangedKHR"]
        [::std::mem::size_of::<XrEventDataVisibilityMaskChangedKHR>() - 32usize];
    ["Alignment of XrEventDataVisibilityMaskChangedKHR"]
        [::std::mem::align_of::<XrEventDataVisibilityMaskChangedKHR>() - 8usize];
    ["Offset of field: XrEventDataVisibilityMaskChangedKHR::type_"]
        [::std::mem::offset_of!(XrEventDataVisibilityMaskChangedKHR, type_) - 0usize];
    ["Offset of field: XrEventDataVisibilityMaskChangedKHR::next"]
        [::std::mem::offset_of!(XrEventDataVisibilityMaskChangedKHR, next) - 8usize];
    ["Offset of field: XrEventDataVisibilityMaskChangedKHR::session"]
        [::std::mem::offset_of!(XrEventDataVisibilityMaskChangedKHR, session) - 16usize];
    ["Offset of field: XrEventDataVisibilityMaskChangedKHR::viewConfigurationType"][::std::mem::offset_of!(
        XrEventDataVisibilityMaskChangedKHR,
        viewConfigurationType
    ) - 24usize];
    ["Offset of field: XrEventDataVisibilityMaskChangedKHR::viewIndex"]
        [::std::mem::offset_of!(XrEventDataVisibilityMaskChangedKHR, viewIndex) - 28usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrCompositionLayerColorScaleBiasKHR {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub colorScale: XrColor4f,
    pub colorBias: XrColor4f,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrCompositionLayerColorScaleBiasKHR"]
        [::std::mem::size_of::<XrCompositionLayerColorScaleBiasKHR>() - 48usize];
    ["Alignment of XrCompositionLayerColorScaleBiasKHR"]
        [::std::mem::align_of::<XrCompositionLayerColorScaleBiasKHR>() - 8usize];
    ["Offset of field: XrCompositionLayerColorScaleBiasKHR::type_"]
        [::std::mem::offset_of!(XrCompositionLayerColorScaleBiasKHR, type_) - 0usize];
    ["Offset of field: XrCompositionLayerColorScaleBiasKHR::next"]
        [::std::mem::offset_of!(XrCompositionLayerColorScaleBiasKHR, next) - 8usize];
    ["Offset of field: XrCompositionLayerColorScaleBiasKHR::colorScale"]
        [::std::mem::offset_of!(XrCompositionLayerColorScaleBiasKHR, colorScale) - 16usize];
    ["Offset of field: XrCompositionLayerColorScaleBiasKHR::colorBias"]
        [::std::mem::offset_of!(XrCompositionLayerColorScaleBiasKHR, colorBias) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrLoaderInitInfoBaseHeaderKHR {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrLoaderInitInfoBaseHeaderKHR"]
        [::std::mem::size_of::<XrLoaderInitInfoBaseHeaderKHR>() - 16usize];
    ["Alignment of XrLoaderInitInfoBaseHeaderKHR"]
        [::std::mem::align_of::<XrLoaderInitInfoBaseHeaderKHR>() - 8usize];
    ["Offset of field: XrLoaderInitInfoBaseHeaderKHR::type_"]
        [::std::mem::offset_of!(XrLoaderInitInfoBaseHeaderKHR, type_) - 0usize];
    ["Offset of field: XrLoaderInitInfoBaseHeaderKHR::next"]
        [::std::mem::offset_of!(XrLoaderInitInfoBaseHeaderKHR, next) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrCompositionLayerEquirect2KHR {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub layerFlags: XrCompositionLayerFlags,
    pub space: XrSpace,
    pub eyeVisibility: XrEyeVisibility,
    pub subImage: XrSwapchainSubImage,
    pub pose: XrPosef,
    pub radius: f32,
    pub centralHorizontalAngle: f32,
    pub upperVerticalAngle: f32,
    pub lowerVerticalAngle: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrCompositionLayerEquirect2KHR"]
        [::std::mem::size_of::<XrCompositionLayerEquirect2KHR>() - 120usize];
    ["Alignment of XrCompositionLayerEquirect2KHR"]
        [::std::mem::align_of::<XrCompositionLayerEquirect2KHR>() - 8usize];
    ["Offset of field: XrCompositionLayerEquirect2KHR::type_"]
        [::std::mem::offset_of!(XrCompositionLayerEquirect2KHR, type_) - 0usize];
    ["Offset of field: XrCompositionLayerEquirect2KHR::next"]
        [::std::mem::offset_of!(XrCompositionLayerEquirect2KHR, next) - 8usize];
    ["Offset of field: XrCompositionLayerEquirect2KHR::layerFlags"]
        [::std::mem::offset_of!(XrCompositionLayerEquirect2KHR, layerFlags) - 16usize];
    ["Offset of field: XrCompositionLayerEquirect2KHR::space"]
        [::std::mem::offset_of!(XrCompositionLayerEquirect2KHR, space) - 24usize];
    ["Offset of field: XrCompositionLayerEquirect2KHR::eyeVisibility"]
        [::std::mem::offset_of!(XrCompositionLayerEquirect2KHR, eyeVisibility) - 32usize];
    ["Offset of field: XrCompositionLayerEquirect2KHR::subImage"]
        [::std::mem::offset_of!(XrCompositionLayerEquirect2KHR, subImage) - 40usize];
    ["Offset of field: XrCompositionLayerEquirect2KHR::pose"]
        [::std::mem::offset_of!(XrCompositionLayerEquirect2KHR, pose) - 72usize];
    ["Offset of field: XrCompositionLayerEquirect2KHR::radius"]
        [::std::mem::offset_of!(XrCompositionLayerEquirect2KHR, radius) - 100usize];
    ["Offset of field: XrCompositionLayerEquirect2KHR::centralHorizontalAngle"]
        [::std::mem::offset_of!(XrCompositionLayerEquirect2KHR, centralHorizontalAngle) - 104usize];
    ["Offset of field: XrCompositionLayerEquirect2KHR::upperVerticalAngle"]
        [::std::mem::offset_of!(XrCompositionLayerEquirect2KHR, upperVerticalAngle) - 108usize];
    ["Offset of field: XrCompositionLayerEquirect2KHR::lowerVerticalAngle"]
        [::std::mem::offset_of!(XrCompositionLayerEquirect2KHR, lowerVerticalAngle) - 112usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrBindingModificationBaseHeaderKHR {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrBindingModificationBaseHeaderKHR"]
        [::std::mem::size_of::<XrBindingModificationBaseHeaderKHR>() - 16usize];
    ["Alignment of XrBindingModificationBaseHeaderKHR"]
        [::std::mem::align_of::<XrBindingModificationBaseHeaderKHR>() - 8usize];
    ["Offset of field: XrBindingModificationBaseHeaderKHR::type_"]
        [::std::mem::offset_of!(XrBindingModificationBaseHeaderKHR, type_) - 0usize];
    ["Offset of field: XrBindingModificationBaseHeaderKHR::next"]
        [::std::mem::offset_of!(XrBindingModificationBaseHeaderKHR, next) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrBindingModificationsKHR {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub bindingModificationCount: u32,
    pub bindingModifications: *const *const XrBindingModificationBaseHeaderKHR,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrBindingModificationsKHR"]
        [::std::mem::size_of::<XrBindingModificationsKHR>() - 32usize];
    ["Alignment of XrBindingModificationsKHR"]
        [::std::mem::align_of::<XrBindingModificationsKHR>() - 8usize];
    ["Offset of field: XrBindingModificationsKHR::type_"]
        [::std::mem::offset_of!(XrBindingModificationsKHR, type_) - 0usize];
    ["Offset of field: XrBindingModificationsKHR::next"]
        [::std::mem::offset_of!(XrBindingModificationsKHR, next) - 8usize];
    ["Offset of field: XrBindingModificationsKHR::bindingModificationCount"]
        [::std::mem::offset_of!(XrBindingModificationsKHR, bindingModificationCount) - 16usize];
    ["Offset of field: XrBindingModificationsKHR::bindingModifications"]
        [::std::mem::offset_of!(XrBindingModificationsKHR, bindingModifications) - 24usize];
};
pub type XrSpacesLocateInfoKHR = XrSpacesLocateInfo;
pub type XrSpaceLocationDataKHR = XrSpaceLocationData;
pub type XrSpaceLocationsKHR = XrSpaceLocations;
pub type XrSpaceVelocityDataKHR = XrSpaceVelocityData;
pub type XrSpaceVelocitiesKHR = XrSpaceVelocities;
pub type XrColor3fKHR = XrColor3f;
pub type XrExtent3DfKHR = XrExtent3Df;
pub type XrSpherefKHR = XrSpheref;
pub type XrBoxfKHR = XrBoxf;
pub type XrFrustumfKHR = XrFrustumf;
pub const XrPerfSettingsDomainEXT_XR_PERF_SETTINGS_DOMAIN_CPU_EXT: XrPerfSettingsDomainEXT = 1;
pub const XrPerfSettingsDomainEXT_XR_PERF_SETTINGS_DOMAIN_GPU_EXT: XrPerfSettingsDomainEXT = 2;
pub const XrPerfSettingsDomainEXT_XR_PERF_SETTINGS_DOMAIN_MAX_ENUM_EXT: XrPerfSettingsDomainEXT =
    2147483647;
pub type XrPerfSettingsDomainEXT = ::std::os::raw::c_uint;
pub const XrPerfSettingsSubDomainEXT_XR_PERF_SETTINGS_SUB_DOMAIN_COMPOSITING_EXT:
    XrPerfSettingsSubDomainEXT = 1;
pub const XrPerfSettingsSubDomainEXT_XR_PERF_SETTINGS_SUB_DOMAIN_RENDERING_EXT:
    XrPerfSettingsSubDomainEXT = 2;
pub const XrPerfSettingsSubDomainEXT_XR_PERF_SETTINGS_SUB_DOMAIN_THERMAL_EXT:
    XrPerfSettingsSubDomainEXT = 3;
pub const XrPerfSettingsSubDomainEXT_XR_PERF_SETTINGS_SUB_DOMAIN_MAX_ENUM_EXT:
    XrPerfSettingsSubDomainEXT = 2147483647;
pub type XrPerfSettingsSubDomainEXT = ::std::os::raw::c_uint;
pub const XrPerfSettingsLevelEXT_XR_PERF_SETTINGS_LEVEL_POWER_SAVINGS_EXT: XrPerfSettingsLevelEXT =
    0;
pub const XrPerfSettingsLevelEXT_XR_PERF_SETTINGS_LEVEL_SUSTAINED_LOW_EXT: XrPerfSettingsLevelEXT =
    25;
pub const XrPerfSettingsLevelEXT_XR_PERF_SETTINGS_LEVEL_SUSTAINED_HIGH_EXT: XrPerfSettingsLevelEXT =
    50;
pub const XrPerfSettingsLevelEXT_XR_PERF_SETTINGS_LEVEL_BOOST_EXT: XrPerfSettingsLevelEXT = 75;
pub const XrPerfSettingsLevelEXT_XR_PERF_SETTINGS_LEVEL_MAX_ENUM_EXT: XrPerfSettingsLevelEXT =
    2147483647;
pub type XrPerfSettingsLevelEXT = ::std::os::raw::c_uint;
pub const XrPerfSettingsNotificationLevelEXT_XR_PERF_SETTINGS_NOTIF_LEVEL_NORMAL_EXT:
    XrPerfSettingsNotificationLevelEXT = 0;
pub const XrPerfSettingsNotificationLevelEXT_XR_PERF_SETTINGS_NOTIF_LEVEL_WARNING_EXT:
    XrPerfSettingsNotificationLevelEXT = 25;
pub const XrPerfSettingsNotificationLevelEXT_XR_PERF_SETTINGS_NOTIF_LEVEL_IMPAIRED_EXT:
    XrPerfSettingsNotificationLevelEXT = 75;
pub const XrPerfSettingsNotificationLevelEXT_XR_PERF_SETTINGS_NOTIFICATION_LEVEL_MAX_ENUM_EXT:
    XrPerfSettingsNotificationLevelEXT = 2147483647;
pub type XrPerfSettingsNotificationLevelEXT = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrEventDataPerfSettingsEXT {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub domain: XrPerfSettingsDomainEXT,
    pub subDomain: XrPerfSettingsSubDomainEXT,
    pub fromLevel: XrPerfSettingsNotificationLevelEXT,
    pub toLevel: XrPerfSettingsNotificationLevelEXT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrEventDataPerfSettingsEXT"]
        [::std::mem::size_of::<XrEventDataPerfSettingsEXT>() - 32usize];
    ["Alignment of XrEventDataPerfSettingsEXT"]
        [::std::mem::align_of::<XrEventDataPerfSettingsEXT>() - 8usize];
    ["Offset of field: XrEventDataPerfSettingsEXT::type_"]
        [::std::mem::offset_of!(XrEventDataPerfSettingsEXT, type_) - 0usize];
    ["Offset of field: XrEventDataPerfSettingsEXT::next"]
        [::std::mem::offset_of!(XrEventDataPerfSettingsEXT, next) - 8usize];
    ["Offset of field: XrEventDataPerfSettingsEXT::domain"]
        [::std::mem::offset_of!(XrEventDataPerfSettingsEXT, domain) - 16usize];
    ["Offset of field: XrEventDataPerfSettingsEXT::subDomain"]
        [::std::mem::offset_of!(XrEventDataPerfSettingsEXT, subDomain) - 20usize];
    ["Offset of field: XrEventDataPerfSettingsEXT::fromLevel"]
        [::std::mem::offset_of!(XrEventDataPerfSettingsEXT, fromLevel) - 24usize];
    ["Offset of field: XrEventDataPerfSettingsEXT::toLevel"]
        [::std::mem::offset_of!(XrEventDataPerfSettingsEXT, toLevel) - 28usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrDebugUtilsMessengerEXT_T {
    _unused: [u8; 0],
}
pub type XrDebugUtilsMessengerEXT = *mut XrDebugUtilsMessengerEXT_T;
pub type XrDebugUtilsMessageSeverityFlagsEXT = XrFlags64;
pub const XR_DEBUG_UTILS_MESSAGE_SEVERITY_VERBOSE_BIT_EXT: XrDebugUtilsMessageSeverityFlagsEXT = 1;
pub const XR_DEBUG_UTILS_MESSAGE_SEVERITY_INFO_BIT_EXT: XrDebugUtilsMessageSeverityFlagsEXT = 16;
pub const XR_DEBUG_UTILS_MESSAGE_SEVERITY_WARNING_BIT_EXT: XrDebugUtilsMessageSeverityFlagsEXT =
    256;
pub const XR_DEBUG_UTILS_MESSAGE_SEVERITY_ERROR_BIT_EXT: XrDebugUtilsMessageSeverityFlagsEXT = 4096;
pub type XrDebugUtilsMessageTypeFlagsEXT = XrFlags64;
pub const XR_DEBUG_UTILS_MESSAGE_TYPE_GENERAL_BIT_EXT: XrDebugUtilsMessageTypeFlagsEXT = 1;
pub const XR_DEBUG_UTILS_MESSAGE_TYPE_VALIDATION_BIT_EXT: XrDebugUtilsMessageTypeFlagsEXT = 2;
pub const XR_DEBUG_UTILS_MESSAGE_TYPE_PERFORMANCE_BIT_EXT: XrDebugUtilsMessageTypeFlagsEXT = 4;
pub const XR_DEBUG_UTILS_MESSAGE_TYPE_CONFORMANCE_BIT_EXT: XrDebugUtilsMessageTypeFlagsEXT = 8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrDebugUtilsObjectNameInfoEXT {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub objectType: XrObjectType,
    pub objectHandle: u64,
    pub objectName: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrDebugUtilsObjectNameInfoEXT"]
        [::std::mem::size_of::<XrDebugUtilsObjectNameInfoEXT>() - 40usize];
    ["Alignment of XrDebugUtilsObjectNameInfoEXT"]
        [::std::mem::align_of::<XrDebugUtilsObjectNameInfoEXT>() - 8usize];
    ["Offset of field: XrDebugUtilsObjectNameInfoEXT::type_"]
        [::std::mem::offset_of!(XrDebugUtilsObjectNameInfoEXT, type_) - 0usize];
    ["Offset of field: XrDebugUtilsObjectNameInfoEXT::next"]
        [::std::mem::offset_of!(XrDebugUtilsObjectNameInfoEXT, next) - 8usize];
    ["Offset of field: XrDebugUtilsObjectNameInfoEXT::objectType"]
        [::std::mem::offset_of!(XrDebugUtilsObjectNameInfoEXT, objectType) - 16usize];
    ["Offset of field: XrDebugUtilsObjectNameInfoEXT::objectHandle"]
        [::std::mem::offset_of!(XrDebugUtilsObjectNameInfoEXT, objectHandle) - 24usize];
    ["Offset of field: XrDebugUtilsObjectNameInfoEXT::objectName"]
        [::std::mem::offset_of!(XrDebugUtilsObjectNameInfoEXT, objectName) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrDebugUtilsLabelEXT {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub labelName: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrDebugUtilsLabelEXT"][::std::mem::size_of::<XrDebugUtilsLabelEXT>() - 24usize];
    ["Alignment of XrDebugUtilsLabelEXT"][::std::mem::align_of::<XrDebugUtilsLabelEXT>() - 8usize];
    ["Offset of field: XrDebugUtilsLabelEXT::type_"]
        [::std::mem::offset_of!(XrDebugUtilsLabelEXT, type_) - 0usize];
    ["Offset of field: XrDebugUtilsLabelEXT::next"]
        [::std::mem::offset_of!(XrDebugUtilsLabelEXT, next) - 8usize];
    ["Offset of field: XrDebugUtilsLabelEXT::labelName"]
        [::std::mem::offset_of!(XrDebugUtilsLabelEXT, labelName) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrDebugUtilsMessengerCallbackDataEXT {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub messageId: *const ::std::os::raw::c_char,
    pub functionName: *const ::std::os::raw::c_char,
    pub message: *const ::std::os::raw::c_char,
    pub objectCount: u32,
    pub objects: *mut XrDebugUtilsObjectNameInfoEXT,
    pub sessionLabelCount: u32,
    pub sessionLabels: *mut XrDebugUtilsLabelEXT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrDebugUtilsMessengerCallbackDataEXT"]
        [::std::mem::size_of::<XrDebugUtilsMessengerCallbackDataEXT>() - 72usize];
    ["Alignment of XrDebugUtilsMessengerCallbackDataEXT"]
        [::std::mem::align_of::<XrDebugUtilsMessengerCallbackDataEXT>() - 8usize];
    ["Offset of field: XrDebugUtilsMessengerCallbackDataEXT::type_"]
        [::std::mem::offset_of!(XrDebugUtilsMessengerCallbackDataEXT, type_) - 0usize];
    ["Offset of field: XrDebugUtilsMessengerCallbackDataEXT::next"]
        [::std::mem::offset_of!(XrDebugUtilsMessengerCallbackDataEXT, next) - 8usize];
    ["Offset of field: XrDebugUtilsMessengerCallbackDataEXT::messageId"]
        [::std::mem::offset_of!(XrDebugUtilsMessengerCallbackDataEXT, messageId) - 16usize];
    ["Offset of field: XrDebugUtilsMessengerCallbackDataEXT::functionName"]
        [::std::mem::offset_of!(XrDebugUtilsMessengerCallbackDataEXT, functionName) - 24usize];
    ["Offset of field: XrDebugUtilsMessengerCallbackDataEXT::message"]
        [::std::mem::offset_of!(XrDebugUtilsMessengerCallbackDataEXT, message) - 32usize];
    ["Offset of field: XrDebugUtilsMessengerCallbackDataEXT::objectCount"]
        [::std::mem::offset_of!(XrDebugUtilsMessengerCallbackDataEXT, objectCount) - 40usize];
    ["Offset of field: XrDebugUtilsMessengerCallbackDataEXT::objects"]
        [::std::mem::offset_of!(XrDebugUtilsMessengerCallbackDataEXT, objects) - 48usize];
    ["Offset of field: XrDebugUtilsMessengerCallbackDataEXT::sessionLabelCount"]
        [::std::mem::offset_of!(XrDebugUtilsMessengerCallbackDataEXT, sessionLabelCount) - 56usize];
    ["Offset of field: XrDebugUtilsMessengerCallbackDataEXT::sessionLabels"]
        [::std::mem::offset_of!(XrDebugUtilsMessengerCallbackDataEXT, sessionLabels) - 64usize];
};
pub type PFN_xrDebugUtilsMessengerCallbackEXT = ::std::option::Option<
    unsafe extern "C" fn(
        messageSeverity: XrDebugUtilsMessageSeverityFlagsEXT,
        messageTypes: XrDebugUtilsMessageTypeFlagsEXT,
        callbackData: *const XrDebugUtilsMessengerCallbackDataEXT,
        userData: *mut ::std::os::raw::c_void,
    ) -> XrBool32,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrDebugUtilsMessengerCreateInfoEXT {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub messageSeverities: XrDebugUtilsMessageSeverityFlagsEXT,
    pub messageTypes: XrDebugUtilsMessageTypeFlagsEXT,
    pub userCallback: PFN_xrDebugUtilsMessengerCallbackEXT,
    pub userData: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrDebugUtilsMessengerCreateInfoEXT"]
        [::std::mem::size_of::<XrDebugUtilsMessengerCreateInfoEXT>() - 48usize];
    ["Alignment of XrDebugUtilsMessengerCreateInfoEXT"]
        [::std::mem::align_of::<XrDebugUtilsMessengerCreateInfoEXT>() - 8usize];
    ["Offset of field: XrDebugUtilsMessengerCreateInfoEXT::type_"]
        [::std::mem::offset_of!(XrDebugUtilsMessengerCreateInfoEXT, type_) - 0usize];
    ["Offset of field: XrDebugUtilsMessengerCreateInfoEXT::next"]
        [::std::mem::offset_of!(XrDebugUtilsMessengerCreateInfoEXT, next) - 8usize];
    ["Offset of field: XrDebugUtilsMessengerCreateInfoEXT::messageSeverities"]
        [::std::mem::offset_of!(XrDebugUtilsMessengerCreateInfoEXT, messageSeverities) - 16usize];
    ["Offset of field: XrDebugUtilsMessengerCreateInfoEXT::messageTypes"]
        [::std::mem::offset_of!(XrDebugUtilsMessengerCreateInfoEXT, messageTypes) - 24usize];
    ["Offset of field: XrDebugUtilsMessengerCreateInfoEXT::userCallback"]
        [::std::mem::offset_of!(XrDebugUtilsMessengerCreateInfoEXT, userCallback) - 32usize];
    ["Offset of field: XrDebugUtilsMessengerCreateInfoEXT::userData"]
        [::std::mem::offset_of!(XrDebugUtilsMessengerCreateInfoEXT, userData) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSystemEyeGazeInteractionPropertiesEXT {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub supportsEyeGazeInteraction: XrBool32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSystemEyeGazeInteractionPropertiesEXT"]
        [::std::mem::size_of::<XrSystemEyeGazeInteractionPropertiesEXT>() - 24usize];
    ["Alignment of XrSystemEyeGazeInteractionPropertiesEXT"]
        [::std::mem::align_of::<XrSystemEyeGazeInteractionPropertiesEXT>() - 8usize];
    ["Offset of field: XrSystemEyeGazeInteractionPropertiesEXT::type_"]
        [::std::mem::offset_of!(XrSystemEyeGazeInteractionPropertiesEXT, type_) - 0usize];
    ["Offset of field: XrSystemEyeGazeInteractionPropertiesEXT::next"]
        [::std::mem::offset_of!(XrSystemEyeGazeInteractionPropertiesEXT, next) - 8usize];
    ["Offset of field: XrSystemEyeGazeInteractionPropertiesEXT::supportsEyeGazeInteraction"][::std::mem::offset_of!(
        XrSystemEyeGazeInteractionPropertiesEXT,
        supportsEyeGazeInteraction
    )
        - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrEyeGazeSampleTimeEXT {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub time: XrTime,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrEyeGazeSampleTimeEXT"][::std::mem::size_of::<XrEyeGazeSampleTimeEXT>() - 24usize];
    ["Alignment of XrEyeGazeSampleTimeEXT"]
        [::std::mem::align_of::<XrEyeGazeSampleTimeEXT>() - 8usize];
    ["Offset of field: XrEyeGazeSampleTimeEXT::type_"]
        [::std::mem::offset_of!(XrEyeGazeSampleTimeEXT, type_) - 0usize];
    ["Offset of field: XrEyeGazeSampleTimeEXT::next"]
        [::std::mem::offset_of!(XrEyeGazeSampleTimeEXT, next) - 8usize];
    ["Offset of field: XrEyeGazeSampleTimeEXT::time"]
        [::std::mem::offset_of!(XrEyeGazeSampleTimeEXT, time) - 16usize];
};
pub type XrOverlaySessionCreateFlagsEXTX = XrFlags64;
pub type XrOverlayMainSessionFlagsEXTX = XrFlags64;
pub const XR_OVERLAY_MAIN_SESSION_ENABLED_COMPOSITION_LAYER_INFO_DEPTH_BIT_EXTX:
    XrOverlayMainSessionFlagsEXTX = 1;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSessionCreateInfoOverlayEXTX {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub createFlags: XrOverlaySessionCreateFlagsEXTX,
    pub sessionLayersPlacement: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSessionCreateInfoOverlayEXTX"]
        [::std::mem::size_of::<XrSessionCreateInfoOverlayEXTX>() - 32usize];
    ["Alignment of XrSessionCreateInfoOverlayEXTX"]
        [::std::mem::align_of::<XrSessionCreateInfoOverlayEXTX>() - 8usize];
    ["Offset of field: XrSessionCreateInfoOverlayEXTX::type_"]
        [::std::mem::offset_of!(XrSessionCreateInfoOverlayEXTX, type_) - 0usize];
    ["Offset of field: XrSessionCreateInfoOverlayEXTX::next"]
        [::std::mem::offset_of!(XrSessionCreateInfoOverlayEXTX, next) - 8usize];
    ["Offset of field: XrSessionCreateInfoOverlayEXTX::createFlags"]
        [::std::mem::offset_of!(XrSessionCreateInfoOverlayEXTX, createFlags) - 16usize];
    ["Offset of field: XrSessionCreateInfoOverlayEXTX::sessionLayersPlacement"]
        [::std::mem::offset_of!(XrSessionCreateInfoOverlayEXTX, sessionLayersPlacement) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrEventDataMainSessionVisibilityChangedEXTX {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub visible: XrBool32,
    pub flags: XrOverlayMainSessionFlagsEXTX,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrEventDataMainSessionVisibilityChangedEXTX"]
        [::std::mem::size_of::<XrEventDataMainSessionVisibilityChangedEXTX>() - 32usize];
    ["Alignment of XrEventDataMainSessionVisibilityChangedEXTX"]
        [::std::mem::align_of::<XrEventDataMainSessionVisibilityChangedEXTX>() - 8usize];
    ["Offset of field: XrEventDataMainSessionVisibilityChangedEXTX::type_"]
        [::std::mem::offset_of!(XrEventDataMainSessionVisibilityChangedEXTX, type_) - 0usize];
    ["Offset of field: XrEventDataMainSessionVisibilityChangedEXTX::next"]
        [::std::mem::offset_of!(XrEventDataMainSessionVisibilityChangedEXTX, next) - 8usize];
    ["Offset of field: XrEventDataMainSessionVisibilityChangedEXTX::visible"]
        [::std::mem::offset_of!(XrEventDataMainSessionVisibilityChangedEXTX, visible) - 16usize];
    ["Offset of field: XrEventDataMainSessionVisibilityChangedEXTX::flags"]
        [::std::mem::offset_of!(XrEventDataMainSessionVisibilityChangedEXTX, flags) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSpatialAnchorMSFT_T {
    _unused: [u8; 0],
}
pub type XrSpatialAnchorMSFT = *mut XrSpatialAnchorMSFT_T;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSpatialAnchorCreateInfoMSFT {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub space: XrSpace,
    pub pose: XrPosef,
    pub time: XrTime,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSpatialAnchorCreateInfoMSFT"]
        [::std::mem::size_of::<XrSpatialAnchorCreateInfoMSFT>() - 64usize];
    ["Alignment of XrSpatialAnchorCreateInfoMSFT"]
        [::std::mem::align_of::<XrSpatialAnchorCreateInfoMSFT>() - 8usize];
    ["Offset of field: XrSpatialAnchorCreateInfoMSFT::type_"]
        [::std::mem::offset_of!(XrSpatialAnchorCreateInfoMSFT, type_) - 0usize];
    ["Offset of field: XrSpatialAnchorCreateInfoMSFT::next"]
        [::std::mem::offset_of!(XrSpatialAnchorCreateInfoMSFT, next) - 8usize];
    ["Offset of field: XrSpatialAnchorCreateInfoMSFT::space"]
        [::std::mem::offset_of!(XrSpatialAnchorCreateInfoMSFT, space) - 16usize];
    ["Offset of field: XrSpatialAnchorCreateInfoMSFT::pose"]
        [::std::mem::offset_of!(XrSpatialAnchorCreateInfoMSFT, pose) - 24usize];
    ["Offset of field: XrSpatialAnchorCreateInfoMSFT::time"]
        [::std::mem::offset_of!(XrSpatialAnchorCreateInfoMSFT, time) - 56usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSpatialAnchorSpaceCreateInfoMSFT {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub anchor: XrSpatialAnchorMSFT,
    pub poseInAnchorSpace: XrPosef,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSpatialAnchorSpaceCreateInfoMSFT"]
        [::std::mem::size_of::<XrSpatialAnchorSpaceCreateInfoMSFT>() - 56usize];
    ["Alignment of XrSpatialAnchorSpaceCreateInfoMSFT"]
        [::std::mem::align_of::<XrSpatialAnchorSpaceCreateInfoMSFT>() - 8usize];
    ["Offset of field: XrSpatialAnchorSpaceCreateInfoMSFT::type_"]
        [::std::mem::offset_of!(XrSpatialAnchorSpaceCreateInfoMSFT, type_) - 0usize];
    ["Offset of field: XrSpatialAnchorSpaceCreateInfoMSFT::next"]
        [::std::mem::offset_of!(XrSpatialAnchorSpaceCreateInfoMSFT, next) - 8usize];
    ["Offset of field: XrSpatialAnchorSpaceCreateInfoMSFT::anchor"]
        [::std::mem::offset_of!(XrSpatialAnchorSpaceCreateInfoMSFT, anchor) - 16usize];
    ["Offset of field: XrSpatialAnchorSpaceCreateInfoMSFT::poseInAnchorSpace"]
        [::std::mem::offset_of!(XrSpatialAnchorSpaceCreateInfoMSFT, poseInAnchorSpace) - 24usize];
};
pub type XrCompositionLayerImageLayoutFlagsFB = XrFlags64;
pub const XR_COMPOSITION_LAYER_IMAGE_LAYOUT_VERTICAL_FLIP_BIT_FB:
    XrCompositionLayerImageLayoutFlagsFB = 1;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrCompositionLayerImageLayoutFB {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub flags: XrCompositionLayerImageLayoutFlagsFB,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrCompositionLayerImageLayoutFB"]
        [::std::mem::size_of::<XrCompositionLayerImageLayoutFB>() - 24usize];
    ["Alignment of XrCompositionLayerImageLayoutFB"]
        [::std::mem::align_of::<XrCompositionLayerImageLayoutFB>() - 8usize];
    ["Offset of field: XrCompositionLayerImageLayoutFB::type_"]
        [::std::mem::offset_of!(XrCompositionLayerImageLayoutFB, type_) - 0usize];
    ["Offset of field: XrCompositionLayerImageLayoutFB::next"]
        [::std::mem::offset_of!(XrCompositionLayerImageLayoutFB, next) - 8usize];
    ["Offset of field: XrCompositionLayerImageLayoutFB::flags"]
        [::std::mem::offset_of!(XrCompositionLayerImageLayoutFB, flags) - 16usize];
};
pub const XrBlendFactorFB_XR_BLEND_FACTOR_ZERO_FB: XrBlendFactorFB = 0;
pub const XrBlendFactorFB_XR_BLEND_FACTOR_ONE_FB: XrBlendFactorFB = 1;
pub const XrBlendFactorFB_XR_BLEND_FACTOR_SRC_ALPHA_FB: XrBlendFactorFB = 2;
pub const XrBlendFactorFB_XR_BLEND_FACTOR_ONE_MINUS_SRC_ALPHA_FB: XrBlendFactorFB = 3;
pub const XrBlendFactorFB_XR_BLEND_FACTOR_DST_ALPHA_FB: XrBlendFactorFB = 4;
pub const XrBlendFactorFB_XR_BLEND_FACTOR_ONE_MINUS_DST_ALPHA_FB: XrBlendFactorFB = 5;
pub const XrBlendFactorFB_XR_BLEND_FACTOR_MAX_ENUM_FB: XrBlendFactorFB = 2147483647;
pub type XrBlendFactorFB = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrCompositionLayerAlphaBlendFB {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub srcFactorColor: XrBlendFactorFB,
    pub dstFactorColor: XrBlendFactorFB,
    pub srcFactorAlpha: XrBlendFactorFB,
    pub dstFactorAlpha: XrBlendFactorFB,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrCompositionLayerAlphaBlendFB"]
        [::std::mem::size_of::<XrCompositionLayerAlphaBlendFB>() - 32usize];
    ["Alignment of XrCompositionLayerAlphaBlendFB"]
        [::std::mem::align_of::<XrCompositionLayerAlphaBlendFB>() - 8usize];
    ["Offset of field: XrCompositionLayerAlphaBlendFB::type_"]
        [::std::mem::offset_of!(XrCompositionLayerAlphaBlendFB, type_) - 0usize];
    ["Offset of field: XrCompositionLayerAlphaBlendFB::next"]
        [::std::mem::offset_of!(XrCompositionLayerAlphaBlendFB, next) - 8usize];
    ["Offset of field: XrCompositionLayerAlphaBlendFB::srcFactorColor"]
        [::std::mem::offset_of!(XrCompositionLayerAlphaBlendFB, srcFactorColor) - 16usize];
    ["Offset of field: XrCompositionLayerAlphaBlendFB::dstFactorColor"]
        [::std::mem::offset_of!(XrCompositionLayerAlphaBlendFB, dstFactorColor) - 20usize];
    ["Offset of field: XrCompositionLayerAlphaBlendFB::srcFactorAlpha"]
        [::std::mem::offset_of!(XrCompositionLayerAlphaBlendFB, srcFactorAlpha) - 24usize];
    ["Offset of field: XrCompositionLayerAlphaBlendFB::dstFactorAlpha"]
        [::std::mem::offset_of!(XrCompositionLayerAlphaBlendFB, dstFactorAlpha) - 28usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrViewConfigurationDepthRangeEXT {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub recommendedNearZ: f32,
    pub minNearZ: f32,
    pub recommendedFarZ: f32,
    pub maxFarZ: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrViewConfigurationDepthRangeEXT"]
        [::std::mem::size_of::<XrViewConfigurationDepthRangeEXT>() - 32usize];
    ["Alignment of XrViewConfigurationDepthRangeEXT"]
        [::std::mem::align_of::<XrViewConfigurationDepthRangeEXT>() - 8usize];
    ["Offset of field: XrViewConfigurationDepthRangeEXT::type_"]
        [::std::mem::offset_of!(XrViewConfigurationDepthRangeEXT, type_) - 0usize];
    ["Offset of field: XrViewConfigurationDepthRangeEXT::next"]
        [::std::mem::offset_of!(XrViewConfigurationDepthRangeEXT, next) - 8usize];
    ["Offset of field: XrViewConfigurationDepthRangeEXT::recommendedNearZ"]
        [::std::mem::offset_of!(XrViewConfigurationDepthRangeEXT, recommendedNearZ) - 16usize];
    ["Offset of field: XrViewConfigurationDepthRangeEXT::minNearZ"]
        [::std::mem::offset_of!(XrViewConfigurationDepthRangeEXT, minNearZ) - 20usize];
    ["Offset of field: XrViewConfigurationDepthRangeEXT::recommendedFarZ"]
        [::std::mem::offset_of!(XrViewConfigurationDepthRangeEXT, recommendedFarZ) - 24usize];
    ["Offset of field: XrViewConfigurationDepthRangeEXT::maxFarZ"]
        [::std::mem::offset_of!(XrViewConfigurationDepthRangeEXT, maxFarZ) - 28usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSpatialGraphNodeBindingMSFT_T {
    _unused: [u8; 0],
}
pub type XrSpatialGraphNodeBindingMSFT = *mut XrSpatialGraphNodeBindingMSFT_T;
pub const XrSpatialGraphNodeTypeMSFT_XR_SPATIAL_GRAPH_NODE_TYPE_STATIC_MSFT:
    XrSpatialGraphNodeTypeMSFT = 1;
pub const XrSpatialGraphNodeTypeMSFT_XR_SPATIAL_GRAPH_NODE_TYPE_DYNAMIC_MSFT:
    XrSpatialGraphNodeTypeMSFT = 2;
pub const XrSpatialGraphNodeTypeMSFT_XR_SPATIAL_GRAPH_NODE_TYPE_MAX_ENUM_MSFT:
    XrSpatialGraphNodeTypeMSFT = 2147483647;
pub type XrSpatialGraphNodeTypeMSFT = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSpatialGraphNodeSpaceCreateInfoMSFT {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub nodeType: XrSpatialGraphNodeTypeMSFT,
    pub nodeId: [u8; 16usize],
    pub pose: XrPosef,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSpatialGraphNodeSpaceCreateInfoMSFT"]
        [::std::mem::size_of::<XrSpatialGraphNodeSpaceCreateInfoMSFT>() - 64usize];
    ["Alignment of XrSpatialGraphNodeSpaceCreateInfoMSFT"]
        [::std::mem::align_of::<XrSpatialGraphNodeSpaceCreateInfoMSFT>() - 8usize];
    ["Offset of field: XrSpatialGraphNodeSpaceCreateInfoMSFT::type_"]
        [::std::mem::offset_of!(XrSpatialGraphNodeSpaceCreateInfoMSFT, type_) - 0usize];
    ["Offset of field: XrSpatialGraphNodeSpaceCreateInfoMSFT::next"]
        [::std::mem::offset_of!(XrSpatialGraphNodeSpaceCreateInfoMSFT, next) - 8usize];
    ["Offset of field: XrSpatialGraphNodeSpaceCreateInfoMSFT::nodeType"]
        [::std::mem::offset_of!(XrSpatialGraphNodeSpaceCreateInfoMSFT, nodeType) - 16usize];
    ["Offset of field: XrSpatialGraphNodeSpaceCreateInfoMSFT::nodeId"]
        [::std::mem::offset_of!(XrSpatialGraphNodeSpaceCreateInfoMSFT, nodeId) - 20usize];
    ["Offset of field: XrSpatialGraphNodeSpaceCreateInfoMSFT::pose"]
        [::std::mem::offset_of!(XrSpatialGraphNodeSpaceCreateInfoMSFT, pose) - 36usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSpatialGraphStaticNodeBindingCreateInfoMSFT {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub space: XrSpace,
    pub poseInSpace: XrPosef,
    pub time: XrTime,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSpatialGraphStaticNodeBindingCreateInfoMSFT"]
        [::std::mem::size_of::<XrSpatialGraphStaticNodeBindingCreateInfoMSFT>() - 64usize];
    ["Alignment of XrSpatialGraphStaticNodeBindingCreateInfoMSFT"]
        [::std::mem::align_of::<XrSpatialGraphStaticNodeBindingCreateInfoMSFT>() - 8usize];
    ["Offset of field: XrSpatialGraphStaticNodeBindingCreateInfoMSFT::type_"]
        [::std::mem::offset_of!(XrSpatialGraphStaticNodeBindingCreateInfoMSFT, type_) - 0usize];
    ["Offset of field: XrSpatialGraphStaticNodeBindingCreateInfoMSFT::next"]
        [::std::mem::offset_of!(XrSpatialGraphStaticNodeBindingCreateInfoMSFT, next) - 8usize];
    ["Offset of field: XrSpatialGraphStaticNodeBindingCreateInfoMSFT::space"]
        [::std::mem::offset_of!(XrSpatialGraphStaticNodeBindingCreateInfoMSFT, space) - 16usize];
    ["Offset of field: XrSpatialGraphStaticNodeBindingCreateInfoMSFT::poseInSpace"][::std::mem::offset_of!(
        XrSpatialGraphStaticNodeBindingCreateInfoMSFT,
        poseInSpace
    ) - 24usize];
    ["Offset of field: XrSpatialGraphStaticNodeBindingCreateInfoMSFT::time"]
        [::std::mem::offset_of!(XrSpatialGraphStaticNodeBindingCreateInfoMSFT, time) - 56usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSpatialGraphNodeBindingPropertiesGetInfoMSFT {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSpatialGraphNodeBindingPropertiesGetInfoMSFT"]
        [::std::mem::size_of::<XrSpatialGraphNodeBindingPropertiesGetInfoMSFT>() - 16usize];
    ["Alignment of XrSpatialGraphNodeBindingPropertiesGetInfoMSFT"]
        [::std::mem::align_of::<XrSpatialGraphNodeBindingPropertiesGetInfoMSFT>() - 8usize];
    ["Offset of field: XrSpatialGraphNodeBindingPropertiesGetInfoMSFT::type_"]
        [::std::mem::offset_of!(XrSpatialGraphNodeBindingPropertiesGetInfoMSFT, type_) - 0usize];
    ["Offset of field: XrSpatialGraphNodeBindingPropertiesGetInfoMSFT::next"]
        [::std::mem::offset_of!(XrSpatialGraphNodeBindingPropertiesGetInfoMSFT, next) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSpatialGraphNodeBindingPropertiesMSFT {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub nodeId: [u8; 16usize],
    pub poseInNodeSpace: XrPosef,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSpatialGraphNodeBindingPropertiesMSFT"]
        [::std::mem::size_of::<XrSpatialGraphNodeBindingPropertiesMSFT>() - 64usize];
    ["Alignment of XrSpatialGraphNodeBindingPropertiesMSFT"]
        [::std::mem::align_of::<XrSpatialGraphNodeBindingPropertiesMSFT>() - 8usize];
    ["Offset of field: XrSpatialGraphNodeBindingPropertiesMSFT::type_"]
        [::std::mem::offset_of!(XrSpatialGraphNodeBindingPropertiesMSFT, type_) - 0usize];
    ["Offset of field: XrSpatialGraphNodeBindingPropertiesMSFT::next"]
        [::std::mem::offset_of!(XrSpatialGraphNodeBindingPropertiesMSFT, next) - 8usize];
    ["Offset of field: XrSpatialGraphNodeBindingPropertiesMSFT::nodeId"]
        [::std::mem::offset_of!(XrSpatialGraphNodeBindingPropertiesMSFT, nodeId) - 16usize];
    ["Offset of field: XrSpatialGraphNodeBindingPropertiesMSFT::poseInNodeSpace"][::std::mem::offset_of!(
        XrSpatialGraphNodeBindingPropertiesMSFT,
        poseInNodeSpace
    ) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrHandTrackerEXT_T {
    _unused: [u8; 0],
}
pub type XrHandTrackerEXT = *mut XrHandTrackerEXT_T;
pub const XrHandEXT_XR_HAND_LEFT_EXT: XrHandEXT = 1;
pub const XrHandEXT_XR_HAND_RIGHT_EXT: XrHandEXT = 2;
pub const XrHandEXT_XR_HAND_MAX_ENUM_EXT: XrHandEXT = 2147483647;
pub type XrHandEXT = ::std::os::raw::c_uint;
pub const XrHandJointEXT_XR_HAND_JOINT_PALM_EXT: XrHandJointEXT = 0;
pub const XrHandJointEXT_XR_HAND_JOINT_WRIST_EXT: XrHandJointEXT = 1;
pub const XrHandJointEXT_XR_HAND_JOINT_THUMB_METACARPAL_EXT: XrHandJointEXT = 2;
pub const XrHandJointEXT_XR_HAND_JOINT_THUMB_PROXIMAL_EXT: XrHandJointEXT = 3;
pub const XrHandJointEXT_XR_HAND_JOINT_THUMB_DISTAL_EXT: XrHandJointEXT = 4;
pub const XrHandJointEXT_XR_HAND_JOINT_THUMB_TIP_EXT: XrHandJointEXT = 5;
pub const XrHandJointEXT_XR_HAND_JOINT_INDEX_METACARPAL_EXT: XrHandJointEXT = 6;
pub const XrHandJointEXT_XR_HAND_JOINT_INDEX_PROXIMAL_EXT: XrHandJointEXT = 7;
pub const XrHandJointEXT_XR_HAND_JOINT_INDEX_INTERMEDIATE_EXT: XrHandJointEXT = 8;
pub const XrHandJointEXT_XR_HAND_JOINT_INDEX_DISTAL_EXT: XrHandJointEXT = 9;
pub const XrHandJointEXT_XR_HAND_JOINT_INDEX_TIP_EXT: XrHandJointEXT = 10;
pub const XrHandJointEXT_XR_HAND_JOINT_MIDDLE_METACARPAL_EXT: XrHandJointEXT = 11;
pub const XrHandJointEXT_XR_HAND_JOINT_MIDDLE_PROXIMAL_EXT: XrHandJointEXT = 12;
pub const XrHandJointEXT_XR_HAND_JOINT_MIDDLE_INTERMEDIATE_EXT: XrHandJointEXT = 13;
pub const XrHandJointEXT_XR_HAND_JOINT_MIDDLE_DISTAL_EXT: XrHandJointEXT = 14;
pub const XrHandJointEXT_XR_HAND_JOINT_MIDDLE_TIP_EXT: XrHandJointEXT = 15;
pub const XrHandJointEXT_XR_HAND_JOINT_RING_METACARPAL_EXT: XrHandJointEXT = 16;
pub const XrHandJointEXT_XR_HAND_JOINT_RING_PROXIMAL_EXT: XrHandJointEXT = 17;
pub const XrHandJointEXT_XR_HAND_JOINT_RING_INTERMEDIATE_EXT: XrHandJointEXT = 18;
pub const XrHandJointEXT_XR_HAND_JOINT_RING_DISTAL_EXT: XrHandJointEXT = 19;
pub const XrHandJointEXT_XR_HAND_JOINT_RING_TIP_EXT: XrHandJointEXT = 20;
pub const XrHandJointEXT_XR_HAND_JOINT_LITTLE_METACARPAL_EXT: XrHandJointEXT = 21;
pub const XrHandJointEXT_XR_HAND_JOINT_LITTLE_PROXIMAL_EXT: XrHandJointEXT = 22;
pub const XrHandJointEXT_XR_HAND_JOINT_LITTLE_INTERMEDIATE_EXT: XrHandJointEXT = 23;
pub const XrHandJointEXT_XR_HAND_JOINT_LITTLE_DISTAL_EXT: XrHandJointEXT = 24;
pub const XrHandJointEXT_XR_HAND_JOINT_LITTLE_TIP_EXT: XrHandJointEXT = 25;
pub const XrHandJointEXT_XR_HAND_JOINT_MAX_ENUM_EXT: XrHandJointEXT = 2147483647;
pub type XrHandJointEXT = ::std::os::raw::c_uint;
pub const XrHandJointSetEXT_XR_HAND_JOINT_SET_DEFAULT_EXT: XrHandJointSetEXT = 0;
pub const XrHandJointSetEXT_XR_HAND_JOINT_SET_HAND_WITH_FOREARM_ULTRALEAP: XrHandJointSetEXT =
    1000149000;
pub const XrHandJointSetEXT_XR_HAND_JOINT_SET_MAX_ENUM_EXT: XrHandJointSetEXT = 2147483647;
pub type XrHandJointSetEXT = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSystemHandTrackingPropertiesEXT {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub supportsHandTracking: XrBool32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSystemHandTrackingPropertiesEXT"]
        [::std::mem::size_of::<XrSystemHandTrackingPropertiesEXT>() - 24usize];
    ["Alignment of XrSystemHandTrackingPropertiesEXT"]
        [::std::mem::align_of::<XrSystemHandTrackingPropertiesEXT>() - 8usize];
    ["Offset of field: XrSystemHandTrackingPropertiesEXT::type_"]
        [::std::mem::offset_of!(XrSystemHandTrackingPropertiesEXT, type_) - 0usize];
    ["Offset of field: XrSystemHandTrackingPropertiesEXT::next"]
        [::std::mem::offset_of!(XrSystemHandTrackingPropertiesEXT, next) - 8usize];
    ["Offset of field: XrSystemHandTrackingPropertiesEXT::supportsHandTracking"]
        [::std::mem::offset_of!(XrSystemHandTrackingPropertiesEXT, supportsHandTracking) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrHandTrackerCreateInfoEXT {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub hand: XrHandEXT,
    pub handJointSet: XrHandJointSetEXT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrHandTrackerCreateInfoEXT"]
        [::std::mem::size_of::<XrHandTrackerCreateInfoEXT>() - 24usize];
    ["Alignment of XrHandTrackerCreateInfoEXT"]
        [::std::mem::align_of::<XrHandTrackerCreateInfoEXT>() - 8usize];
    ["Offset of field: XrHandTrackerCreateInfoEXT::type_"]
        [::std::mem::offset_of!(XrHandTrackerCreateInfoEXT, type_) - 0usize];
    ["Offset of field: XrHandTrackerCreateInfoEXT::next"]
        [::std::mem::offset_of!(XrHandTrackerCreateInfoEXT, next) - 8usize];
    ["Offset of field: XrHandTrackerCreateInfoEXT::hand"]
        [::std::mem::offset_of!(XrHandTrackerCreateInfoEXT, hand) - 16usize];
    ["Offset of field: XrHandTrackerCreateInfoEXT::handJointSet"]
        [::std::mem::offset_of!(XrHandTrackerCreateInfoEXT, handJointSet) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrHandJointsLocateInfoEXT {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub baseSpace: XrSpace,
    pub time: XrTime,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrHandJointsLocateInfoEXT"]
        [::std::mem::size_of::<XrHandJointsLocateInfoEXT>() - 32usize];
    ["Alignment of XrHandJointsLocateInfoEXT"]
        [::std::mem::align_of::<XrHandJointsLocateInfoEXT>() - 8usize];
    ["Offset of field: XrHandJointsLocateInfoEXT::type_"]
        [::std::mem::offset_of!(XrHandJointsLocateInfoEXT, type_) - 0usize];
    ["Offset of field: XrHandJointsLocateInfoEXT::next"]
        [::std::mem::offset_of!(XrHandJointsLocateInfoEXT, next) - 8usize];
    ["Offset of field: XrHandJointsLocateInfoEXT::baseSpace"]
        [::std::mem::offset_of!(XrHandJointsLocateInfoEXT, baseSpace) - 16usize];
    ["Offset of field: XrHandJointsLocateInfoEXT::time"]
        [::std::mem::offset_of!(XrHandJointsLocateInfoEXT, time) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrHandJointLocationEXT {
    pub locationFlags: XrSpaceLocationFlags,
    pub pose: XrPosef,
    pub radius: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrHandJointLocationEXT"][::std::mem::size_of::<XrHandJointLocationEXT>() - 40usize];
    ["Alignment of XrHandJointLocationEXT"]
        [::std::mem::align_of::<XrHandJointLocationEXT>() - 8usize];
    ["Offset of field: XrHandJointLocationEXT::locationFlags"]
        [::std::mem::offset_of!(XrHandJointLocationEXT, locationFlags) - 0usize];
    ["Offset of field: XrHandJointLocationEXT::pose"]
        [::std::mem::offset_of!(XrHandJointLocationEXT, pose) - 8usize];
    ["Offset of field: XrHandJointLocationEXT::radius"]
        [::std::mem::offset_of!(XrHandJointLocationEXT, radius) - 36usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrHandJointVelocityEXT {
    pub velocityFlags: XrSpaceVelocityFlags,
    pub linearVelocity: XrVector3f,
    pub angularVelocity: XrVector3f,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrHandJointVelocityEXT"][::std::mem::size_of::<XrHandJointVelocityEXT>() - 32usize];
    ["Alignment of XrHandJointVelocityEXT"]
        [::std::mem::align_of::<XrHandJointVelocityEXT>() - 8usize];
    ["Offset of field: XrHandJointVelocityEXT::velocityFlags"]
        [::std::mem::offset_of!(XrHandJointVelocityEXT, velocityFlags) - 0usize];
    ["Offset of field: XrHandJointVelocityEXT::linearVelocity"]
        [::std::mem::offset_of!(XrHandJointVelocityEXT, linearVelocity) - 8usize];
    ["Offset of field: XrHandJointVelocityEXT::angularVelocity"]
        [::std::mem::offset_of!(XrHandJointVelocityEXT, angularVelocity) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrHandJointLocationsEXT {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub isActive: XrBool32,
    pub jointCount: u32,
    pub jointLocations: *mut XrHandJointLocationEXT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrHandJointLocationsEXT"][::std::mem::size_of::<XrHandJointLocationsEXT>() - 32usize];
    ["Alignment of XrHandJointLocationsEXT"]
        [::std::mem::align_of::<XrHandJointLocationsEXT>() - 8usize];
    ["Offset of field: XrHandJointLocationsEXT::type_"]
        [::std::mem::offset_of!(XrHandJointLocationsEXT, type_) - 0usize];
    ["Offset of field: XrHandJointLocationsEXT::next"]
        [::std::mem::offset_of!(XrHandJointLocationsEXT, next) - 8usize];
    ["Offset of field: XrHandJointLocationsEXT::isActive"]
        [::std::mem::offset_of!(XrHandJointLocationsEXT, isActive) - 16usize];
    ["Offset of field: XrHandJointLocationsEXT::jointCount"]
        [::std::mem::offset_of!(XrHandJointLocationsEXT, jointCount) - 20usize];
    ["Offset of field: XrHandJointLocationsEXT::jointLocations"]
        [::std::mem::offset_of!(XrHandJointLocationsEXT, jointLocations) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrHandJointVelocitiesEXT {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub jointCount: u32,
    pub jointVelocities: *mut XrHandJointVelocityEXT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrHandJointVelocitiesEXT"]
        [::std::mem::size_of::<XrHandJointVelocitiesEXT>() - 32usize];
    ["Alignment of XrHandJointVelocitiesEXT"]
        [::std::mem::align_of::<XrHandJointVelocitiesEXT>() - 8usize];
    ["Offset of field: XrHandJointVelocitiesEXT::type_"]
        [::std::mem::offset_of!(XrHandJointVelocitiesEXT, type_) - 0usize];
    ["Offset of field: XrHandJointVelocitiesEXT::next"]
        [::std::mem::offset_of!(XrHandJointVelocitiesEXT, next) - 8usize];
    ["Offset of field: XrHandJointVelocitiesEXT::jointCount"]
        [::std::mem::offset_of!(XrHandJointVelocitiesEXT, jointCount) - 16usize];
    ["Offset of field: XrHandJointVelocitiesEXT::jointVelocities"]
        [::std::mem::offset_of!(XrHandJointVelocitiesEXT, jointVelocities) - 24usize];
};
pub const XrHandPoseTypeMSFT_XR_HAND_POSE_TYPE_TRACKED_MSFT: XrHandPoseTypeMSFT = 0;
pub const XrHandPoseTypeMSFT_XR_HAND_POSE_TYPE_REFERENCE_OPEN_PALM_MSFT: XrHandPoseTypeMSFT = 1;
pub const XrHandPoseTypeMSFT_XR_HAND_POSE_TYPE_MAX_ENUM_MSFT: XrHandPoseTypeMSFT = 2147483647;
pub type XrHandPoseTypeMSFT = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSystemHandTrackingMeshPropertiesMSFT {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub supportsHandTrackingMesh: XrBool32,
    pub maxHandMeshIndexCount: u32,
    pub maxHandMeshVertexCount: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSystemHandTrackingMeshPropertiesMSFT"]
        [::std::mem::size_of::<XrSystemHandTrackingMeshPropertiesMSFT>() - 32usize];
    ["Alignment of XrSystemHandTrackingMeshPropertiesMSFT"]
        [::std::mem::align_of::<XrSystemHandTrackingMeshPropertiesMSFT>() - 8usize];
    ["Offset of field: XrSystemHandTrackingMeshPropertiesMSFT::type_"]
        [::std::mem::offset_of!(XrSystemHandTrackingMeshPropertiesMSFT, type_) - 0usize];
    ["Offset of field: XrSystemHandTrackingMeshPropertiesMSFT::next"]
        [::std::mem::offset_of!(XrSystemHandTrackingMeshPropertiesMSFT, next) - 8usize];
    ["Offset of field: XrSystemHandTrackingMeshPropertiesMSFT::supportsHandTrackingMesh"][::std::mem::offset_of!(
        XrSystemHandTrackingMeshPropertiesMSFT,
        supportsHandTrackingMesh
    )
        - 16usize];
    ["Offset of field: XrSystemHandTrackingMeshPropertiesMSFT::maxHandMeshIndexCount"][::std::mem::offset_of!(
        XrSystemHandTrackingMeshPropertiesMSFT,
        maxHandMeshIndexCount
    ) - 20usize];
    ["Offset of field: XrSystemHandTrackingMeshPropertiesMSFT::maxHandMeshVertexCount"][::std::mem::offset_of!(
        XrSystemHandTrackingMeshPropertiesMSFT,
        maxHandMeshVertexCount
    )
        - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrHandMeshSpaceCreateInfoMSFT {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub handPoseType: XrHandPoseTypeMSFT,
    pub poseInHandMeshSpace: XrPosef,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrHandMeshSpaceCreateInfoMSFT"]
        [::std::mem::size_of::<XrHandMeshSpaceCreateInfoMSFT>() - 48usize];
    ["Alignment of XrHandMeshSpaceCreateInfoMSFT"]
        [::std::mem::align_of::<XrHandMeshSpaceCreateInfoMSFT>() - 8usize];
    ["Offset of field: XrHandMeshSpaceCreateInfoMSFT::type_"]
        [::std::mem::offset_of!(XrHandMeshSpaceCreateInfoMSFT, type_) - 0usize];
    ["Offset of field: XrHandMeshSpaceCreateInfoMSFT::next"]
        [::std::mem::offset_of!(XrHandMeshSpaceCreateInfoMSFT, next) - 8usize];
    ["Offset of field: XrHandMeshSpaceCreateInfoMSFT::handPoseType"]
        [::std::mem::offset_of!(XrHandMeshSpaceCreateInfoMSFT, handPoseType) - 16usize];
    ["Offset of field: XrHandMeshSpaceCreateInfoMSFT::poseInHandMeshSpace"]
        [::std::mem::offset_of!(XrHandMeshSpaceCreateInfoMSFT, poseInHandMeshSpace) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrHandMeshUpdateInfoMSFT {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub time: XrTime,
    pub handPoseType: XrHandPoseTypeMSFT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrHandMeshUpdateInfoMSFT"]
        [::std::mem::size_of::<XrHandMeshUpdateInfoMSFT>() - 32usize];
    ["Alignment of XrHandMeshUpdateInfoMSFT"]
        [::std::mem::align_of::<XrHandMeshUpdateInfoMSFT>() - 8usize];
    ["Offset of field: XrHandMeshUpdateInfoMSFT::type_"]
        [::std::mem::offset_of!(XrHandMeshUpdateInfoMSFT, type_) - 0usize];
    ["Offset of field: XrHandMeshUpdateInfoMSFT::next"]
        [::std::mem::offset_of!(XrHandMeshUpdateInfoMSFT, next) - 8usize];
    ["Offset of field: XrHandMeshUpdateInfoMSFT::time"]
        [::std::mem::offset_of!(XrHandMeshUpdateInfoMSFT, time) - 16usize];
    ["Offset of field: XrHandMeshUpdateInfoMSFT::handPoseType"]
        [::std::mem::offset_of!(XrHandMeshUpdateInfoMSFT, handPoseType) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrHandMeshIndexBufferMSFT {
    pub indexBufferKey: u32,
    pub indexCapacityInput: u32,
    pub indexCountOutput: u32,
    pub indices: *mut u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrHandMeshIndexBufferMSFT"]
        [::std::mem::size_of::<XrHandMeshIndexBufferMSFT>() - 24usize];
    ["Alignment of XrHandMeshIndexBufferMSFT"]
        [::std::mem::align_of::<XrHandMeshIndexBufferMSFT>() - 8usize];
    ["Offset of field: XrHandMeshIndexBufferMSFT::indexBufferKey"]
        [::std::mem::offset_of!(XrHandMeshIndexBufferMSFT, indexBufferKey) - 0usize];
    ["Offset of field: XrHandMeshIndexBufferMSFT::indexCapacityInput"]
        [::std::mem::offset_of!(XrHandMeshIndexBufferMSFT, indexCapacityInput) - 4usize];
    ["Offset of field: XrHandMeshIndexBufferMSFT::indexCountOutput"]
        [::std::mem::offset_of!(XrHandMeshIndexBufferMSFT, indexCountOutput) - 8usize];
    ["Offset of field: XrHandMeshIndexBufferMSFT::indices"]
        [::std::mem::offset_of!(XrHandMeshIndexBufferMSFT, indices) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrHandMeshVertexMSFT {
    pub position: XrVector3f,
    pub normal: XrVector3f,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrHandMeshVertexMSFT"][::std::mem::size_of::<XrHandMeshVertexMSFT>() - 24usize];
    ["Alignment of XrHandMeshVertexMSFT"][::std::mem::align_of::<XrHandMeshVertexMSFT>() - 4usize];
    ["Offset of field: XrHandMeshVertexMSFT::position"]
        [::std::mem::offset_of!(XrHandMeshVertexMSFT, position) - 0usize];
    ["Offset of field: XrHandMeshVertexMSFT::normal"]
        [::std::mem::offset_of!(XrHandMeshVertexMSFT, normal) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrHandMeshVertexBufferMSFT {
    pub vertexUpdateTime: XrTime,
    pub vertexCapacityInput: u32,
    pub vertexCountOutput: u32,
    pub vertices: *mut XrHandMeshVertexMSFT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrHandMeshVertexBufferMSFT"]
        [::std::mem::size_of::<XrHandMeshVertexBufferMSFT>() - 24usize];
    ["Alignment of XrHandMeshVertexBufferMSFT"]
        [::std::mem::align_of::<XrHandMeshVertexBufferMSFT>() - 8usize];
    ["Offset of field: XrHandMeshVertexBufferMSFT::vertexUpdateTime"]
        [::std::mem::offset_of!(XrHandMeshVertexBufferMSFT, vertexUpdateTime) - 0usize];
    ["Offset of field: XrHandMeshVertexBufferMSFT::vertexCapacityInput"]
        [::std::mem::offset_of!(XrHandMeshVertexBufferMSFT, vertexCapacityInput) - 8usize];
    ["Offset of field: XrHandMeshVertexBufferMSFT::vertexCountOutput"]
        [::std::mem::offset_of!(XrHandMeshVertexBufferMSFT, vertexCountOutput) - 12usize];
    ["Offset of field: XrHandMeshVertexBufferMSFT::vertices"]
        [::std::mem::offset_of!(XrHandMeshVertexBufferMSFT, vertices) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrHandMeshMSFT {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub isActive: XrBool32,
    pub indexBufferChanged: XrBool32,
    pub vertexBufferChanged: XrBool32,
    pub indexBuffer: XrHandMeshIndexBufferMSFT,
    pub vertexBuffer: XrHandMeshVertexBufferMSFT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrHandMeshMSFT"][::std::mem::size_of::<XrHandMeshMSFT>() - 80usize];
    ["Alignment of XrHandMeshMSFT"][::std::mem::align_of::<XrHandMeshMSFT>() - 8usize];
    ["Offset of field: XrHandMeshMSFT::type_"]
        [::std::mem::offset_of!(XrHandMeshMSFT, type_) - 0usize];
    ["Offset of field: XrHandMeshMSFT::next"]
        [::std::mem::offset_of!(XrHandMeshMSFT, next) - 8usize];
    ["Offset of field: XrHandMeshMSFT::isActive"]
        [::std::mem::offset_of!(XrHandMeshMSFT, isActive) - 16usize];
    ["Offset of field: XrHandMeshMSFT::indexBufferChanged"]
        [::std::mem::offset_of!(XrHandMeshMSFT, indexBufferChanged) - 20usize];
    ["Offset of field: XrHandMeshMSFT::vertexBufferChanged"]
        [::std::mem::offset_of!(XrHandMeshMSFT, vertexBufferChanged) - 24usize];
    ["Offset of field: XrHandMeshMSFT::indexBuffer"]
        [::std::mem::offset_of!(XrHandMeshMSFT, indexBuffer) - 32usize];
    ["Offset of field: XrHandMeshMSFT::vertexBuffer"]
        [::std::mem::offset_of!(XrHandMeshMSFT, vertexBuffer) - 56usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrHandPoseTypeInfoMSFT {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub handPoseType: XrHandPoseTypeMSFT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrHandPoseTypeInfoMSFT"][::std::mem::size_of::<XrHandPoseTypeInfoMSFT>() - 24usize];
    ["Alignment of XrHandPoseTypeInfoMSFT"]
        [::std::mem::align_of::<XrHandPoseTypeInfoMSFT>() - 8usize];
    ["Offset of field: XrHandPoseTypeInfoMSFT::type_"]
        [::std::mem::offset_of!(XrHandPoseTypeInfoMSFT, type_) - 0usize];
    ["Offset of field: XrHandPoseTypeInfoMSFT::next"]
        [::std::mem::offset_of!(XrHandPoseTypeInfoMSFT, next) - 8usize];
    ["Offset of field: XrHandPoseTypeInfoMSFT::handPoseType"]
        [::std::mem::offset_of!(XrHandPoseTypeInfoMSFT, handPoseType) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSecondaryViewConfigurationSessionBeginInfoMSFT {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub viewConfigurationCount: u32,
    pub enabledViewConfigurationTypes: *const XrViewConfigurationType,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSecondaryViewConfigurationSessionBeginInfoMSFT"]
        [::std::mem::size_of::<XrSecondaryViewConfigurationSessionBeginInfoMSFT>() - 32usize];
    ["Alignment of XrSecondaryViewConfigurationSessionBeginInfoMSFT"]
        [::std::mem::align_of::<XrSecondaryViewConfigurationSessionBeginInfoMSFT>() - 8usize];
    ["Offset of field: XrSecondaryViewConfigurationSessionBeginInfoMSFT::type_"]
        [::std::mem::offset_of!(XrSecondaryViewConfigurationSessionBeginInfoMSFT, type_) - 0usize];
    ["Offset of field: XrSecondaryViewConfigurationSessionBeginInfoMSFT::next"]
        [::std::mem::offset_of!(XrSecondaryViewConfigurationSessionBeginInfoMSFT, next) - 8usize];
    ["Offset of field: XrSecondaryViewConfigurationSessionBeginInfoMSFT::viewConfigurationCount"][::std::mem::offset_of!(
        XrSecondaryViewConfigurationSessionBeginInfoMSFT,
        viewConfigurationCount
    )
        - 16usize];
    ["Offset of field: XrSecondaryViewConfigurationSessionBeginInfoMSFT::enabledViewConfigurationTypes"] [:: std :: mem :: offset_of ! (XrSecondaryViewConfigurationSessionBeginInfoMSFT , enabledViewConfigurationTypes) - 24usize] ;
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSecondaryViewConfigurationStateMSFT {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub viewConfigurationType: XrViewConfigurationType,
    pub active: XrBool32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSecondaryViewConfigurationStateMSFT"]
        [::std::mem::size_of::<XrSecondaryViewConfigurationStateMSFT>() - 24usize];
    ["Alignment of XrSecondaryViewConfigurationStateMSFT"]
        [::std::mem::align_of::<XrSecondaryViewConfigurationStateMSFT>() - 8usize];
    ["Offset of field: XrSecondaryViewConfigurationStateMSFT::type_"]
        [::std::mem::offset_of!(XrSecondaryViewConfigurationStateMSFT, type_) - 0usize];
    ["Offset of field: XrSecondaryViewConfigurationStateMSFT::next"]
        [::std::mem::offset_of!(XrSecondaryViewConfigurationStateMSFT, next) - 8usize];
    ["Offset of field: XrSecondaryViewConfigurationStateMSFT::viewConfigurationType"][::std::mem::offset_of!(
        XrSecondaryViewConfigurationStateMSFT,
        viewConfigurationType
    ) - 16usize];
    ["Offset of field: XrSecondaryViewConfigurationStateMSFT::active"]
        [::std::mem::offset_of!(XrSecondaryViewConfigurationStateMSFT, active) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSecondaryViewConfigurationFrameStateMSFT {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub viewConfigurationCount: u32,
    pub viewConfigurationStates: *mut XrSecondaryViewConfigurationStateMSFT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSecondaryViewConfigurationFrameStateMSFT"]
        [::std::mem::size_of::<XrSecondaryViewConfigurationFrameStateMSFT>() - 32usize];
    ["Alignment of XrSecondaryViewConfigurationFrameStateMSFT"]
        [::std::mem::align_of::<XrSecondaryViewConfigurationFrameStateMSFT>() - 8usize];
    ["Offset of field: XrSecondaryViewConfigurationFrameStateMSFT::type_"]
        [::std::mem::offset_of!(XrSecondaryViewConfigurationFrameStateMSFT, type_) - 0usize];
    ["Offset of field: XrSecondaryViewConfigurationFrameStateMSFT::next"]
        [::std::mem::offset_of!(XrSecondaryViewConfigurationFrameStateMSFT, next) - 8usize];
    ["Offset of field: XrSecondaryViewConfigurationFrameStateMSFT::viewConfigurationCount"][::std::mem::offset_of!(
        XrSecondaryViewConfigurationFrameStateMSFT,
        viewConfigurationCount
    )
        - 16usize];
    ["Offset of field: XrSecondaryViewConfigurationFrameStateMSFT::viewConfigurationStates"][::std::mem::offset_of!(
        XrSecondaryViewConfigurationFrameStateMSFT,
        viewConfigurationStates
    )
        - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSecondaryViewConfigurationLayerInfoMSFT {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub viewConfigurationType: XrViewConfigurationType,
    pub environmentBlendMode: XrEnvironmentBlendMode,
    pub layerCount: u32,
    pub layers: *const *const XrCompositionLayerBaseHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSecondaryViewConfigurationLayerInfoMSFT"]
        [::std::mem::size_of::<XrSecondaryViewConfigurationLayerInfoMSFT>() - 40usize];
    ["Alignment of XrSecondaryViewConfigurationLayerInfoMSFT"]
        [::std::mem::align_of::<XrSecondaryViewConfigurationLayerInfoMSFT>() - 8usize];
    ["Offset of field: XrSecondaryViewConfigurationLayerInfoMSFT::type_"]
        [::std::mem::offset_of!(XrSecondaryViewConfigurationLayerInfoMSFT, type_) - 0usize];
    ["Offset of field: XrSecondaryViewConfigurationLayerInfoMSFT::next"]
        [::std::mem::offset_of!(XrSecondaryViewConfigurationLayerInfoMSFT, next) - 8usize];
    ["Offset of field: XrSecondaryViewConfigurationLayerInfoMSFT::viewConfigurationType"][::std::mem::offset_of!(
        XrSecondaryViewConfigurationLayerInfoMSFT,
        viewConfigurationType
    )
        - 16usize];
    ["Offset of field: XrSecondaryViewConfigurationLayerInfoMSFT::environmentBlendMode"][::std::mem::offset_of!(
        XrSecondaryViewConfigurationLayerInfoMSFT,
        environmentBlendMode
    )
        - 20usize];
    ["Offset of field: XrSecondaryViewConfigurationLayerInfoMSFT::layerCount"]
        [::std::mem::offset_of!(XrSecondaryViewConfigurationLayerInfoMSFT, layerCount) - 24usize];
    ["Offset of field: XrSecondaryViewConfigurationLayerInfoMSFT::layers"]
        [::std::mem::offset_of!(XrSecondaryViewConfigurationLayerInfoMSFT, layers) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSecondaryViewConfigurationFrameEndInfoMSFT {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub viewConfigurationCount: u32,
    pub viewConfigurationLayersInfo: *const XrSecondaryViewConfigurationLayerInfoMSFT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSecondaryViewConfigurationFrameEndInfoMSFT"]
        [::std::mem::size_of::<XrSecondaryViewConfigurationFrameEndInfoMSFT>() - 32usize];
    ["Alignment of XrSecondaryViewConfigurationFrameEndInfoMSFT"]
        [::std::mem::align_of::<XrSecondaryViewConfigurationFrameEndInfoMSFT>() - 8usize];
    ["Offset of field: XrSecondaryViewConfigurationFrameEndInfoMSFT::type_"]
        [::std::mem::offset_of!(XrSecondaryViewConfigurationFrameEndInfoMSFT, type_) - 0usize];
    ["Offset of field: XrSecondaryViewConfigurationFrameEndInfoMSFT::next"]
        [::std::mem::offset_of!(XrSecondaryViewConfigurationFrameEndInfoMSFT, next) - 8usize];
    ["Offset of field: XrSecondaryViewConfigurationFrameEndInfoMSFT::viewConfigurationCount"][::std::mem::offset_of!(
        XrSecondaryViewConfigurationFrameEndInfoMSFT,
        viewConfigurationCount
    )
        - 16usize];
    ["Offset of field: XrSecondaryViewConfigurationFrameEndInfoMSFT::viewConfigurationLayersInfo"] [:: std :: mem :: offset_of ! (XrSecondaryViewConfigurationFrameEndInfoMSFT , viewConfigurationLayersInfo) - 24usize] ;
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSecondaryViewConfigurationSwapchainCreateInfoMSFT {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub viewConfigurationType: XrViewConfigurationType,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSecondaryViewConfigurationSwapchainCreateInfoMSFT"]
        [::std::mem::size_of::<XrSecondaryViewConfigurationSwapchainCreateInfoMSFT>() - 24usize];
    ["Alignment of XrSecondaryViewConfigurationSwapchainCreateInfoMSFT"]
        [::std::mem::align_of::<XrSecondaryViewConfigurationSwapchainCreateInfoMSFT>() - 8usize];
    ["Offset of field: XrSecondaryViewConfigurationSwapchainCreateInfoMSFT::type_"][::std::mem::offset_of!(
        XrSecondaryViewConfigurationSwapchainCreateInfoMSFT,
        type_
    ) - 0usize];
    ["Offset of field: XrSecondaryViewConfigurationSwapchainCreateInfoMSFT::next"][::std::mem::offset_of!(
        XrSecondaryViewConfigurationSwapchainCreateInfoMSFT,
        next
    ) - 8usize];
    ["Offset of field: XrSecondaryViewConfigurationSwapchainCreateInfoMSFT::viewConfigurationType"] [:: std :: mem :: offset_of ! (XrSecondaryViewConfigurationSwapchainCreateInfoMSFT , viewConfigurationType) - 16usize] ;
};
pub type XrControllerModelKeyMSFT = u64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrControllerModelKeyStateMSFT {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub modelKey: XrControllerModelKeyMSFT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrControllerModelKeyStateMSFT"]
        [::std::mem::size_of::<XrControllerModelKeyStateMSFT>() - 24usize];
    ["Alignment of XrControllerModelKeyStateMSFT"]
        [::std::mem::align_of::<XrControllerModelKeyStateMSFT>() - 8usize];
    ["Offset of field: XrControllerModelKeyStateMSFT::type_"]
        [::std::mem::offset_of!(XrControllerModelKeyStateMSFT, type_) - 0usize];
    ["Offset of field: XrControllerModelKeyStateMSFT::next"]
        [::std::mem::offset_of!(XrControllerModelKeyStateMSFT, next) - 8usize];
    ["Offset of field: XrControllerModelKeyStateMSFT::modelKey"]
        [::std::mem::offset_of!(XrControllerModelKeyStateMSFT, modelKey) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrControllerModelNodePropertiesMSFT {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub parentNodeName: [::std::os::raw::c_char; 64usize],
    pub nodeName: [::std::os::raw::c_char; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrControllerModelNodePropertiesMSFT"]
        [::std::mem::size_of::<XrControllerModelNodePropertiesMSFT>() - 144usize];
    ["Alignment of XrControllerModelNodePropertiesMSFT"]
        [::std::mem::align_of::<XrControllerModelNodePropertiesMSFT>() - 8usize];
    ["Offset of field: XrControllerModelNodePropertiesMSFT::type_"]
        [::std::mem::offset_of!(XrControllerModelNodePropertiesMSFT, type_) - 0usize];
    ["Offset of field: XrControllerModelNodePropertiesMSFT::next"]
        [::std::mem::offset_of!(XrControllerModelNodePropertiesMSFT, next) - 8usize];
    ["Offset of field: XrControllerModelNodePropertiesMSFT::parentNodeName"]
        [::std::mem::offset_of!(XrControllerModelNodePropertiesMSFT, parentNodeName) - 16usize];
    ["Offset of field: XrControllerModelNodePropertiesMSFT::nodeName"]
        [::std::mem::offset_of!(XrControllerModelNodePropertiesMSFT, nodeName) - 80usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrControllerModelPropertiesMSFT {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub nodeCapacityInput: u32,
    pub nodeCountOutput: u32,
    pub nodeProperties: *mut XrControllerModelNodePropertiesMSFT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrControllerModelPropertiesMSFT"]
        [::std::mem::size_of::<XrControllerModelPropertiesMSFT>() - 32usize];
    ["Alignment of XrControllerModelPropertiesMSFT"]
        [::std::mem::align_of::<XrControllerModelPropertiesMSFT>() - 8usize];
    ["Offset of field: XrControllerModelPropertiesMSFT::type_"]
        [::std::mem::offset_of!(XrControllerModelPropertiesMSFT, type_) - 0usize];
    ["Offset of field: XrControllerModelPropertiesMSFT::next"]
        [::std::mem::offset_of!(XrControllerModelPropertiesMSFT, next) - 8usize];
    ["Offset of field: XrControllerModelPropertiesMSFT::nodeCapacityInput"]
        [::std::mem::offset_of!(XrControllerModelPropertiesMSFT, nodeCapacityInput) - 16usize];
    ["Offset of field: XrControllerModelPropertiesMSFT::nodeCountOutput"]
        [::std::mem::offset_of!(XrControllerModelPropertiesMSFT, nodeCountOutput) - 20usize];
    ["Offset of field: XrControllerModelPropertiesMSFT::nodeProperties"]
        [::std::mem::offset_of!(XrControllerModelPropertiesMSFT, nodeProperties) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrControllerModelNodeStateMSFT {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub nodePose: XrPosef,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrControllerModelNodeStateMSFT"]
        [::std::mem::size_of::<XrControllerModelNodeStateMSFT>() - 48usize];
    ["Alignment of XrControllerModelNodeStateMSFT"]
        [::std::mem::align_of::<XrControllerModelNodeStateMSFT>() - 8usize];
    ["Offset of field: XrControllerModelNodeStateMSFT::type_"]
        [::std::mem::offset_of!(XrControllerModelNodeStateMSFT, type_) - 0usize];
    ["Offset of field: XrControllerModelNodeStateMSFT::next"]
        [::std::mem::offset_of!(XrControllerModelNodeStateMSFT, next) - 8usize];
    ["Offset of field: XrControllerModelNodeStateMSFT::nodePose"]
        [::std::mem::offset_of!(XrControllerModelNodeStateMSFT, nodePose) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrControllerModelStateMSFT {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub nodeCapacityInput: u32,
    pub nodeCountOutput: u32,
    pub nodeStates: *mut XrControllerModelNodeStateMSFT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrControllerModelStateMSFT"]
        [::std::mem::size_of::<XrControllerModelStateMSFT>() - 32usize];
    ["Alignment of XrControllerModelStateMSFT"]
        [::std::mem::align_of::<XrControllerModelStateMSFT>() - 8usize];
    ["Offset of field: XrControllerModelStateMSFT::type_"]
        [::std::mem::offset_of!(XrControllerModelStateMSFT, type_) - 0usize];
    ["Offset of field: XrControllerModelStateMSFT::next"]
        [::std::mem::offset_of!(XrControllerModelStateMSFT, next) - 8usize];
    ["Offset of field: XrControllerModelStateMSFT::nodeCapacityInput"]
        [::std::mem::offset_of!(XrControllerModelStateMSFT, nodeCapacityInput) - 16usize];
    ["Offset of field: XrControllerModelStateMSFT::nodeCountOutput"]
        [::std::mem::offset_of!(XrControllerModelStateMSFT, nodeCountOutput) - 20usize];
    ["Offset of field: XrControllerModelStateMSFT::nodeStates"]
        [::std::mem::offset_of!(XrControllerModelStateMSFT, nodeStates) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrViewConfigurationViewFovEPIC {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub recommendedFov: XrFovf,
    pub maxMutableFov: XrFovf,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrViewConfigurationViewFovEPIC"]
        [::std::mem::size_of::<XrViewConfigurationViewFovEPIC>() - 48usize];
    ["Alignment of XrViewConfigurationViewFovEPIC"]
        [::std::mem::align_of::<XrViewConfigurationViewFovEPIC>() - 8usize];
    ["Offset of field: XrViewConfigurationViewFovEPIC::type_"]
        [::std::mem::offset_of!(XrViewConfigurationViewFovEPIC, type_) - 0usize];
    ["Offset of field: XrViewConfigurationViewFovEPIC::next"]
        [::std::mem::offset_of!(XrViewConfigurationViewFovEPIC, next) - 8usize];
    ["Offset of field: XrViewConfigurationViewFovEPIC::recommendedFov"]
        [::std::mem::offset_of!(XrViewConfigurationViewFovEPIC, recommendedFov) - 16usize];
    ["Offset of field: XrViewConfigurationViewFovEPIC::maxMutableFov"]
        [::std::mem::offset_of!(XrViewConfigurationViewFovEPIC, maxMutableFov) - 32usize];
};
pub const XrReprojectionModeMSFT_XR_REPROJECTION_MODE_DEPTH_MSFT: XrReprojectionModeMSFT = 1;
pub const XrReprojectionModeMSFT_XR_REPROJECTION_MODE_PLANAR_FROM_DEPTH_MSFT:
    XrReprojectionModeMSFT = 2;
pub const XrReprojectionModeMSFT_XR_REPROJECTION_MODE_PLANAR_MANUAL_MSFT: XrReprojectionModeMSFT =
    3;
pub const XrReprojectionModeMSFT_XR_REPROJECTION_MODE_ORIENTATION_ONLY_MSFT:
    XrReprojectionModeMSFT = 4;
pub const XrReprojectionModeMSFT_XR_REPROJECTION_MODE_MAX_ENUM_MSFT: XrReprojectionModeMSFT =
    2147483647;
pub type XrReprojectionModeMSFT = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrCompositionLayerReprojectionInfoMSFT {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub reprojectionMode: XrReprojectionModeMSFT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrCompositionLayerReprojectionInfoMSFT"]
        [::std::mem::size_of::<XrCompositionLayerReprojectionInfoMSFT>() - 24usize];
    ["Alignment of XrCompositionLayerReprojectionInfoMSFT"]
        [::std::mem::align_of::<XrCompositionLayerReprojectionInfoMSFT>() - 8usize];
    ["Offset of field: XrCompositionLayerReprojectionInfoMSFT::type_"]
        [::std::mem::offset_of!(XrCompositionLayerReprojectionInfoMSFT, type_) - 0usize];
    ["Offset of field: XrCompositionLayerReprojectionInfoMSFT::next"]
        [::std::mem::offset_of!(XrCompositionLayerReprojectionInfoMSFT, next) - 8usize];
    ["Offset of field: XrCompositionLayerReprojectionInfoMSFT::reprojectionMode"][::std::mem::offset_of!(
        XrCompositionLayerReprojectionInfoMSFT,
        reprojectionMode
    ) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrCompositionLayerReprojectionPlaneOverrideMSFT {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub position: XrVector3f,
    pub normal: XrVector3f,
    pub velocity: XrVector3f,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrCompositionLayerReprojectionPlaneOverrideMSFT"]
        [::std::mem::size_of::<XrCompositionLayerReprojectionPlaneOverrideMSFT>() - 56usize];
    ["Alignment of XrCompositionLayerReprojectionPlaneOverrideMSFT"]
        [::std::mem::align_of::<XrCompositionLayerReprojectionPlaneOverrideMSFT>() - 8usize];
    ["Offset of field: XrCompositionLayerReprojectionPlaneOverrideMSFT::type_"]
        [::std::mem::offset_of!(XrCompositionLayerReprojectionPlaneOverrideMSFT, type_) - 0usize];
    ["Offset of field: XrCompositionLayerReprojectionPlaneOverrideMSFT::next"]
        [::std::mem::offset_of!(XrCompositionLayerReprojectionPlaneOverrideMSFT, next) - 8usize];
    ["Offset of field: XrCompositionLayerReprojectionPlaneOverrideMSFT::position"][::std::mem::offset_of!(
        XrCompositionLayerReprojectionPlaneOverrideMSFT,
        position
    ) - 16usize];
    ["Offset of field: XrCompositionLayerReprojectionPlaneOverrideMSFT::normal"]
        [::std::mem::offset_of!(XrCompositionLayerReprojectionPlaneOverrideMSFT, normal) - 28usize];
    ["Offset of field: XrCompositionLayerReprojectionPlaneOverrideMSFT::velocity"][::std::mem::offset_of!(
        XrCompositionLayerReprojectionPlaneOverrideMSFT,
        velocity
    ) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSwapchainStateBaseHeaderFB {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSwapchainStateBaseHeaderFB"]
        [::std::mem::size_of::<XrSwapchainStateBaseHeaderFB>() - 16usize];
    ["Alignment of XrSwapchainStateBaseHeaderFB"]
        [::std::mem::align_of::<XrSwapchainStateBaseHeaderFB>() - 8usize];
    ["Offset of field: XrSwapchainStateBaseHeaderFB::type_"]
        [::std::mem::offset_of!(XrSwapchainStateBaseHeaderFB, type_) - 0usize];
    ["Offset of field: XrSwapchainStateBaseHeaderFB::next"]
        [::std::mem::offset_of!(XrSwapchainStateBaseHeaderFB, next) - 8usize];
};
pub type XrCompositionLayerSecureContentFlagsFB = XrFlags64;
pub const XR_COMPOSITION_LAYER_SECURE_CONTENT_EXCLUDE_LAYER_BIT_FB:
    XrCompositionLayerSecureContentFlagsFB = 1;
pub const XR_COMPOSITION_LAYER_SECURE_CONTENT_REPLACE_LAYER_BIT_FB:
    XrCompositionLayerSecureContentFlagsFB = 2;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrCompositionLayerSecureContentFB {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub flags: XrCompositionLayerSecureContentFlagsFB,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrCompositionLayerSecureContentFB"]
        [::std::mem::size_of::<XrCompositionLayerSecureContentFB>() - 24usize];
    ["Alignment of XrCompositionLayerSecureContentFB"]
        [::std::mem::align_of::<XrCompositionLayerSecureContentFB>() - 8usize];
    ["Offset of field: XrCompositionLayerSecureContentFB::type_"]
        [::std::mem::offset_of!(XrCompositionLayerSecureContentFB, type_) - 0usize];
    ["Offset of field: XrCompositionLayerSecureContentFB::next"]
        [::std::mem::offset_of!(XrCompositionLayerSecureContentFB, next) - 8usize];
    ["Offset of field: XrCompositionLayerSecureContentFB::flags"]
        [::std::mem::offset_of!(XrCompositionLayerSecureContentFB, flags) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrBodyTrackerFB_T {
    _unused: [u8; 0],
}
pub type XrBodyTrackerFB = *mut XrBodyTrackerFB_T;
pub const XrBodyJointFB_XR_BODY_JOINT_ROOT_FB: XrBodyJointFB = 0;
pub const XrBodyJointFB_XR_BODY_JOINT_HIPS_FB: XrBodyJointFB = 1;
pub const XrBodyJointFB_XR_BODY_JOINT_SPINE_LOWER_FB: XrBodyJointFB = 2;
pub const XrBodyJointFB_XR_BODY_JOINT_SPINE_MIDDLE_FB: XrBodyJointFB = 3;
pub const XrBodyJointFB_XR_BODY_JOINT_SPINE_UPPER_FB: XrBodyJointFB = 4;
pub const XrBodyJointFB_XR_BODY_JOINT_CHEST_FB: XrBodyJointFB = 5;
pub const XrBodyJointFB_XR_BODY_JOINT_NECK_FB: XrBodyJointFB = 6;
pub const XrBodyJointFB_XR_BODY_JOINT_HEAD_FB: XrBodyJointFB = 7;
pub const XrBodyJointFB_XR_BODY_JOINT_LEFT_SHOULDER_FB: XrBodyJointFB = 8;
pub const XrBodyJointFB_XR_BODY_JOINT_LEFT_SCAPULA_FB: XrBodyJointFB = 9;
pub const XrBodyJointFB_XR_BODY_JOINT_LEFT_ARM_UPPER_FB: XrBodyJointFB = 10;
pub const XrBodyJointFB_XR_BODY_JOINT_LEFT_ARM_LOWER_FB: XrBodyJointFB = 11;
pub const XrBodyJointFB_XR_BODY_JOINT_LEFT_HAND_WRIST_TWIST_FB: XrBodyJointFB = 12;
pub const XrBodyJointFB_XR_BODY_JOINT_RIGHT_SHOULDER_FB: XrBodyJointFB = 13;
pub const XrBodyJointFB_XR_BODY_JOINT_RIGHT_SCAPULA_FB: XrBodyJointFB = 14;
pub const XrBodyJointFB_XR_BODY_JOINT_RIGHT_ARM_UPPER_FB: XrBodyJointFB = 15;
pub const XrBodyJointFB_XR_BODY_JOINT_RIGHT_ARM_LOWER_FB: XrBodyJointFB = 16;
pub const XrBodyJointFB_XR_BODY_JOINT_RIGHT_HAND_WRIST_TWIST_FB: XrBodyJointFB = 17;
pub const XrBodyJointFB_XR_BODY_JOINT_LEFT_HAND_PALM_FB: XrBodyJointFB = 18;
pub const XrBodyJointFB_XR_BODY_JOINT_LEFT_HAND_WRIST_FB: XrBodyJointFB = 19;
pub const XrBodyJointFB_XR_BODY_JOINT_LEFT_HAND_THUMB_METACARPAL_FB: XrBodyJointFB = 20;
pub const XrBodyJointFB_XR_BODY_JOINT_LEFT_HAND_THUMB_PROXIMAL_FB: XrBodyJointFB = 21;
pub const XrBodyJointFB_XR_BODY_JOINT_LEFT_HAND_THUMB_DISTAL_FB: XrBodyJointFB = 22;
pub const XrBodyJointFB_XR_BODY_JOINT_LEFT_HAND_THUMB_TIP_FB: XrBodyJointFB = 23;
pub const XrBodyJointFB_XR_BODY_JOINT_LEFT_HAND_INDEX_METACARPAL_FB: XrBodyJointFB = 24;
pub const XrBodyJointFB_XR_BODY_JOINT_LEFT_HAND_INDEX_PROXIMAL_FB: XrBodyJointFB = 25;
pub const XrBodyJointFB_XR_BODY_JOINT_LEFT_HAND_INDEX_INTERMEDIATE_FB: XrBodyJointFB = 26;
pub const XrBodyJointFB_XR_BODY_JOINT_LEFT_HAND_INDEX_DISTAL_FB: XrBodyJointFB = 27;
pub const XrBodyJointFB_XR_BODY_JOINT_LEFT_HAND_INDEX_TIP_FB: XrBodyJointFB = 28;
pub const XrBodyJointFB_XR_BODY_JOINT_LEFT_HAND_MIDDLE_METACARPAL_FB: XrBodyJointFB = 29;
pub const XrBodyJointFB_XR_BODY_JOINT_LEFT_HAND_MIDDLE_PROXIMAL_FB: XrBodyJointFB = 30;
pub const XrBodyJointFB_XR_BODY_JOINT_LEFT_HAND_MIDDLE_INTERMEDIATE_FB: XrBodyJointFB = 31;
pub const XrBodyJointFB_XR_BODY_JOINT_LEFT_HAND_MIDDLE_DISTAL_FB: XrBodyJointFB = 32;
pub const XrBodyJointFB_XR_BODY_JOINT_LEFT_HAND_MIDDLE_TIP_FB: XrBodyJointFB = 33;
pub const XrBodyJointFB_XR_BODY_JOINT_LEFT_HAND_RING_METACARPAL_FB: XrBodyJointFB = 34;
pub const XrBodyJointFB_XR_BODY_JOINT_LEFT_HAND_RING_PROXIMAL_FB: XrBodyJointFB = 35;
pub const XrBodyJointFB_XR_BODY_JOINT_LEFT_HAND_RING_INTERMEDIATE_FB: XrBodyJointFB = 36;
pub const XrBodyJointFB_XR_BODY_JOINT_LEFT_HAND_RING_DISTAL_FB: XrBodyJointFB = 37;
pub const XrBodyJointFB_XR_BODY_JOINT_LEFT_HAND_RING_TIP_FB: XrBodyJointFB = 38;
pub const XrBodyJointFB_XR_BODY_JOINT_LEFT_HAND_LITTLE_METACARPAL_FB: XrBodyJointFB = 39;
pub const XrBodyJointFB_XR_BODY_JOINT_LEFT_HAND_LITTLE_PROXIMAL_FB: XrBodyJointFB = 40;
pub const XrBodyJointFB_XR_BODY_JOINT_LEFT_HAND_LITTLE_INTERMEDIATE_FB: XrBodyJointFB = 41;
pub const XrBodyJointFB_XR_BODY_JOINT_LEFT_HAND_LITTLE_DISTAL_FB: XrBodyJointFB = 42;
pub const XrBodyJointFB_XR_BODY_JOINT_LEFT_HAND_LITTLE_TIP_FB: XrBodyJointFB = 43;
pub const XrBodyJointFB_XR_BODY_JOINT_RIGHT_HAND_PALM_FB: XrBodyJointFB = 44;
pub const XrBodyJointFB_XR_BODY_JOINT_RIGHT_HAND_WRIST_FB: XrBodyJointFB = 45;
pub const XrBodyJointFB_XR_BODY_JOINT_RIGHT_HAND_THUMB_METACARPAL_FB: XrBodyJointFB = 46;
pub const XrBodyJointFB_XR_BODY_JOINT_RIGHT_HAND_THUMB_PROXIMAL_FB: XrBodyJointFB = 47;
pub const XrBodyJointFB_XR_BODY_JOINT_RIGHT_HAND_THUMB_DISTAL_FB: XrBodyJointFB = 48;
pub const XrBodyJointFB_XR_BODY_JOINT_RIGHT_HAND_THUMB_TIP_FB: XrBodyJointFB = 49;
pub const XrBodyJointFB_XR_BODY_JOINT_RIGHT_HAND_INDEX_METACARPAL_FB: XrBodyJointFB = 50;
pub const XrBodyJointFB_XR_BODY_JOINT_RIGHT_HAND_INDEX_PROXIMAL_FB: XrBodyJointFB = 51;
pub const XrBodyJointFB_XR_BODY_JOINT_RIGHT_HAND_INDEX_INTERMEDIATE_FB: XrBodyJointFB = 52;
pub const XrBodyJointFB_XR_BODY_JOINT_RIGHT_HAND_INDEX_DISTAL_FB: XrBodyJointFB = 53;
pub const XrBodyJointFB_XR_BODY_JOINT_RIGHT_HAND_INDEX_TIP_FB: XrBodyJointFB = 54;
pub const XrBodyJointFB_XR_BODY_JOINT_RIGHT_HAND_MIDDLE_METACARPAL_FB: XrBodyJointFB = 55;
pub const XrBodyJointFB_XR_BODY_JOINT_RIGHT_HAND_MIDDLE_PROXIMAL_FB: XrBodyJointFB = 56;
pub const XrBodyJointFB_XR_BODY_JOINT_RIGHT_HAND_MIDDLE_INTERMEDIATE_FB: XrBodyJointFB = 57;
pub const XrBodyJointFB_XR_BODY_JOINT_RIGHT_HAND_MIDDLE_DISTAL_FB: XrBodyJointFB = 58;
pub const XrBodyJointFB_XR_BODY_JOINT_RIGHT_HAND_MIDDLE_TIP_FB: XrBodyJointFB = 59;
pub const XrBodyJointFB_XR_BODY_JOINT_RIGHT_HAND_RING_METACARPAL_FB: XrBodyJointFB = 60;
pub const XrBodyJointFB_XR_BODY_JOINT_RIGHT_HAND_RING_PROXIMAL_FB: XrBodyJointFB = 61;
pub const XrBodyJointFB_XR_BODY_JOINT_RIGHT_HAND_RING_INTERMEDIATE_FB: XrBodyJointFB = 62;
pub const XrBodyJointFB_XR_BODY_JOINT_RIGHT_HAND_RING_DISTAL_FB: XrBodyJointFB = 63;
pub const XrBodyJointFB_XR_BODY_JOINT_RIGHT_HAND_RING_TIP_FB: XrBodyJointFB = 64;
pub const XrBodyJointFB_XR_BODY_JOINT_RIGHT_HAND_LITTLE_METACARPAL_FB: XrBodyJointFB = 65;
pub const XrBodyJointFB_XR_BODY_JOINT_RIGHT_HAND_LITTLE_PROXIMAL_FB: XrBodyJointFB = 66;
pub const XrBodyJointFB_XR_BODY_JOINT_RIGHT_HAND_LITTLE_INTERMEDIATE_FB: XrBodyJointFB = 67;
pub const XrBodyJointFB_XR_BODY_JOINT_RIGHT_HAND_LITTLE_DISTAL_FB: XrBodyJointFB = 68;
pub const XrBodyJointFB_XR_BODY_JOINT_RIGHT_HAND_LITTLE_TIP_FB: XrBodyJointFB = 69;
pub const XrBodyJointFB_XR_BODY_JOINT_COUNT_FB: XrBodyJointFB = 70;
pub const XrBodyJointFB_XR_BODY_JOINT_NONE_FB: XrBodyJointFB = -1;
pub const XrBodyJointFB_XR_BODY_JOINT_MAX_ENUM_FB: XrBodyJointFB = 2147483647;
pub type XrBodyJointFB = ::std::os::raw::c_int;
pub const XrBodyJointSetFB_XR_BODY_JOINT_SET_DEFAULT_FB: XrBodyJointSetFB = 0;
pub const XrBodyJointSetFB_XR_BODY_JOINT_SET_MAX_ENUM_FB: XrBodyJointSetFB = 2147483647;
pub type XrBodyJointSetFB = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrBodyJointLocationFB {
    pub locationFlags: XrSpaceLocationFlags,
    pub pose: XrPosef,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrBodyJointLocationFB"][::std::mem::size_of::<XrBodyJointLocationFB>() - 40usize];
    ["Alignment of XrBodyJointLocationFB"]
        [::std::mem::align_of::<XrBodyJointLocationFB>() - 8usize];
    ["Offset of field: XrBodyJointLocationFB::locationFlags"]
        [::std::mem::offset_of!(XrBodyJointLocationFB, locationFlags) - 0usize];
    ["Offset of field: XrBodyJointLocationFB::pose"]
        [::std::mem::offset_of!(XrBodyJointLocationFB, pose) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSystemBodyTrackingPropertiesFB {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub supportsBodyTracking: XrBool32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSystemBodyTrackingPropertiesFB"]
        [::std::mem::size_of::<XrSystemBodyTrackingPropertiesFB>() - 24usize];
    ["Alignment of XrSystemBodyTrackingPropertiesFB"]
        [::std::mem::align_of::<XrSystemBodyTrackingPropertiesFB>() - 8usize];
    ["Offset of field: XrSystemBodyTrackingPropertiesFB::type_"]
        [::std::mem::offset_of!(XrSystemBodyTrackingPropertiesFB, type_) - 0usize];
    ["Offset of field: XrSystemBodyTrackingPropertiesFB::next"]
        [::std::mem::offset_of!(XrSystemBodyTrackingPropertiesFB, next) - 8usize];
    ["Offset of field: XrSystemBodyTrackingPropertiesFB::supportsBodyTracking"]
        [::std::mem::offset_of!(XrSystemBodyTrackingPropertiesFB, supportsBodyTracking) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrBodyTrackerCreateInfoFB {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub bodyJointSet: XrBodyJointSetFB,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrBodyTrackerCreateInfoFB"]
        [::std::mem::size_of::<XrBodyTrackerCreateInfoFB>() - 24usize];
    ["Alignment of XrBodyTrackerCreateInfoFB"]
        [::std::mem::align_of::<XrBodyTrackerCreateInfoFB>() - 8usize];
    ["Offset of field: XrBodyTrackerCreateInfoFB::type_"]
        [::std::mem::offset_of!(XrBodyTrackerCreateInfoFB, type_) - 0usize];
    ["Offset of field: XrBodyTrackerCreateInfoFB::next"]
        [::std::mem::offset_of!(XrBodyTrackerCreateInfoFB, next) - 8usize];
    ["Offset of field: XrBodyTrackerCreateInfoFB::bodyJointSet"]
        [::std::mem::offset_of!(XrBodyTrackerCreateInfoFB, bodyJointSet) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrBodySkeletonJointFB {
    pub joint: i32,
    pub parentJoint: i32,
    pub pose: XrPosef,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrBodySkeletonJointFB"][::std::mem::size_of::<XrBodySkeletonJointFB>() - 36usize];
    ["Alignment of XrBodySkeletonJointFB"]
        [::std::mem::align_of::<XrBodySkeletonJointFB>() - 4usize];
    ["Offset of field: XrBodySkeletonJointFB::joint"]
        [::std::mem::offset_of!(XrBodySkeletonJointFB, joint) - 0usize];
    ["Offset of field: XrBodySkeletonJointFB::parentJoint"]
        [::std::mem::offset_of!(XrBodySkeletonJointFB, parentJoint) - 4usize];
    ["Offset of field: XrBodySkeletonJointFB::pose"]
        [::std::mem::offset_of!(XrBodySkeletonJointFB, pose) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrBodySkeletonFB {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub jointCount: u32,
    pub joints: *mut XrBodySkeletonJointFB,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrBodySkeletonFB"][::std::mem::size_of::<XrBodySkeletonFB>() - 32usize];
    ["Alignment of XrBodySkeletonFB"][::std::mem::align_of::<XrBodySkeletonFB>() - 8usize];
    ["Offset of field: XrBodySkeletonFB::type_"]
        [::std::mem::offset_of!(XrBodySkeletonFB, type_) - 0usize];
    ["Offset of field: XrBodySkeletonFB::next"]
        [::std::mem::offset_of!(XrBodySkeletonFB, next) - 8usize];
    ["Offset of field: XrBodySkeletonFB::jointCount"]
        [::std::mem::offset_of!(XrBodySkeletonFB, jointCount) - 16usize];
    ["Offset of field: XrBodySkeletonFB::joints"]
        [::std::mem::offset_of!(XrBodySkeletonFB, joints) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrBodyJointsLocateInfoFB {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub baseSpace: XrSpace,
    pub time: XrTime,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrBodyJointsLocateInfoFB"]
        [::std::mem::size_of::<XrBodyJointsLocateInfoFB>() - 32usize];
    ["Alignment of XrBodyJointsLocateInfoFB"]
        [::std::mem::align_of::<XrBodyJointsLocateInfoFB>() - 8usize];
    ["Offset of field: XrBodyJointsLocateInfoFB::type_"]
        [::std::mem::offset_of!(XrBodyJointsLocateInfoFB, type_) - 0usize];
    ["Offset of field: XrBodyJointsLocateInfoFB::next"]
        [::std::mem::offset_of!(XrBodyJointsLocateInfoFB, next) - 8usize];
    ["Offset of field: XrBodyJointsLocateInfoFB::baseSpace"]
        [::std::mem::offset_of!(XrBodyJointsLocateInfoFB, baseSpace) - 16usize];
    ["Offset of field: XrBodyJointsLocateInfoFB::time"]
        [::std::mem::offset_of!(XrBodyJointsLocateInfoFB, time) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrBodyJointLocationsFB {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub isActive: XrBool32,
    pub confidence: f32,
    pub jointCount: u32,
    pub jointLocations: *mut XrBodyJointLocationFB,
    pub skeletonChangedCount: u32,
    pub time: XrTime,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrBodyJointLocationsFB"][::std::mem::size_of::<XrBodyJointLocationsFB>() - 56usize];
    ["Alignment of XrBodyJointLocationsFB"]
        [::std::mem::align_of::<XrBodyJointLocationsFB>() - 8usize];
    ["Offset of field: XrBodyJointLocationsFB::type_"]
        [::std::mem::offset_of!(XrBodyJointLocationsFB, type_) - 0usize];
    ["Offset of field: XrBodyJointLocationsFB::next"]
        [::std::mem::offset_of!(XrBodyJointLocationsFB, next) - 8usize];
    ["Offset of field: XrBodyJointLocationsFB::isActive"]
        [::std::mem::offset_of!(XrBodyJointLocationsFB, isActive) - 16usize];
    ["Offset of field: XrBodyJointLocationsFB::confidence"]
        [::std::mem::offset_of!(XrBodyJointLocationsFB, confidence) - 20usize];
    ["Offset of field: XrBodyJointLocationsFB::jointCount"]
        [::std::mem::offset_of!(XrBodyJointLocationsFB, jointCount) - 24usize];
    ["Offset of field: XrBodyJointLocationsFB::jointLocations"]
        [::std::mem::offset_of!(XrBodyJointLocationsFB, jointLocations) - 32usize];
    ["Offset of field: XrBodyJointLocationsFB::skeletonChangedCount"]
        [::std::mem::offset_of!(XrBodyJointLocationsFB, skeletonChangedCount) - 40usize];
    ["Offset of field: XrBodyJointLocationsFB::time"]
        [::std::mem::offset_of!(XrBodyJointLocationsFB, time) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrInteractionProfileDpadBindingEXT {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub binding: XrPath,
    pub actionSet: XrActionSet,
    pub forceThreshold: f32,
    pub forceThresholdReleased: f32,
    pub centerRegion: f32,
    pub wedgeAngle: f32,
    pub isSticky: XrBool32,
    pub onHaptic: *const XrHapticBaseHeader,
    pub offHaptic: *const XrHapticBaseHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrInteractionProfileDpadBindingEXT"]
        [::std::mem::size_of::<XrInteractionProfileDpadBindingEXT>() - 72usize];
    ["Alignment of XrInteractionProfileDpadBindingEXT"]
        [::std::mem::align_of::<XrInteractionProfileDpadBindingEXT>() - 8usize];
    ["Offset of field: XrInteractionProfileDpadBindingEXT::type_"]
        [::std::mem::offset_of!(XrInteractionProfileDpadBindingEXT, type_) - 0usize];
    ["Offset of field: XrInteractionProfileDpadBindingEXT::next"]
        [::std::mem::offset_of!(XrInteractionProfileDpadBindingEXT, next) - 8usize];
    ["Offset of field: XrInteractionProfileDpadBindingEXT::binding"]
        [::std::mem::offset_of!(XrInteractionProfileDpadBindingEXT, binding) - 16usize];
    ["Offset of field: XrInteractionProfileDpadBindingEXT::actionSet"]
        [::std::mem::offset_of!(XrInteractionProfileDpadBindingEXT, actionSet) - 24usize];
    ["Offset of field: XrInteractionProfileDpadBindingEXT::forceThreshold"]
        [::std::mem::offset_of!(XrInteractionProfileDpadBindingEXT, forceThreshold) - 32usize];
    ["Offset of field: XrInteractionProfileDpadBindingEXT::forceThresholdReleased"][::std::mem::offset_of!(
        XrInteractionProfileDpadBindingEXT,
        forceThresholdReleased
    ) - 36usize];
    ["Offset of field: XrInteractionProfileDpadBindingEXT::centerRegion"]
        [::std::mem::offset_of!(XrInteractionProfileDpadBindingEXT, centerRegion) - 40usize];
    ["Offset of field: XrInteractionProfileDpadBindingEXT::wedgeAngle"]
        [::std::mem::offset_of!(XrInteractionProfileDpadBindingEXT, wedgeAngle) - 44usize];
    ["Offset of field: XrInteractionProfileDpadBindingEXT::isSticky"]
        [::std::mem::offset_of!(XrInteractionProfileDpadBindingEXT, isSticky) - 48usize];
    ["Offset of field: XrInteractionProfileDpadBindingEXT::onHaptic"]
        [::std::mem::offset_of!(XrInteractionProfileDpadBindingEXT, onHaptic) - 56usize];
    ["Offset of field: XrInteractionProfileDpadBindingEXT::offHaptic"]
        [::std::mem::offset_of!(XrInteractionProfileDpadBindingEXT, offHaptic) - 64usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrInteractionProfileAnalogThresholdVALVE {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub action: XrAction,
    pub binding: XrPath,
    pub onThreshold: f32,
    pub offThreshold: f32,
    pub onHaptic: *const XrHapticBaseHeader,
    pub offHaptic: *const XrHapticBaseHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrInteractionProfileAnalogThresholdVALVE"]
        [::std::mem::size_of::<XrInteractionProfileAnalogThresholdVALVE>() - 56usize];
    ["Alignment of XrInteractionProfileAnalogThresholdVALVE"]
        [::std::mem::align_of::<XrInteractionProfileAnalogThresholdVALVE>() - 8usize];
    ["Offset of field: XrInteractionProfileAnalogThresholdVALVE::type_"]
        [::std::mem::offset_of!(XrInteractionProfileAnalogThresholdVALVE, type_) - 0usize];
    ["Offset of field: XrInteractionProfileAnalogThresholdVALVE::next"]
        [::std::mem::offset_of!(XrInteractionProfileAnalogThresholdVALVE, next) - 8usize];
    ["Offset of field: XrInteractionProfileAnalogThresholdVALVE::action"]
        [::std::mem::offset_of!(XrInteractionProfileAnalogThresholdVALVE, action) - 16usize];
    ["Offset of field: XrInteractionProfileAnalogThresholdVALVE::binding"]
        [::std::mem::offset_of!(XrInteractionProfileAnalogThresholdVALVE, binding) - 24usize];
    ["Offset of field: XrInteractionProfileAnalogThresholdVALVE::onThreshold"]
        [::std::mem::offset_of!(XrInteractionProfileAnalogThresholdVALVE, onThreshold) - 32usize];
    ["Offset of field: XrInteractionProfileAnalogThresholdVALVE::offThreshold"]
        [::std::mem::offset_of!(XrInteractionProfileAnalogThresholdVALVE, offThreshold) - 36usize];
    ["Offset of field: XrInteractionProfileAnalogThresholdVALVE::onHaptic"]
        [::std::mem::offset_of!(XrInteractionProfileAnalogThresholdVALVE, onHaptic) - 40usize];
    ["Offset of field: XrInteractionProfileAnalogThresholdVALVE::offHaptic"]
        [::std::mem::offset_of!(XrInteractionProfileAnalogThresholdVALVE, offHaptic) - 48usize];
};
pub const XrHandJointsMotionRangeEXT_XR_HAND_JOINTS_MOTION_RANGE_UNOBSTRUCTED_EXT:
    XrHandJointsMotionRangeEXT = 1;
pub const XrHandJointsMotionRangeEXT_XR_HAND_JOINTS_MOTION_RANGE_CONFORMING_TO_CONTROLLER_EXT:
    XrHandJointsMotionRangeEXT = 2;
pub const XrHandJointsMotionRangeEXT_XR_HAND_JOINTS_MOTION_RANGE_MAX_ENUM_EXT:
    XrHandJointsMotionRangeEXT = 2147483647;
pub type XrHandJointsMotionRangeEXT = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrHandJointsMotionRangeInfoEXT {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub handJointsMotionRange: XrHandJointsMotionRangeEXT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrHandJointsMotionRangeInfoEXT"]
        [::std::mem::size_of::<XrHandJointsMotionRangeInfoEXT>() - 24usize];
    ["Alignment of XrHandJointsMotionRangeInfoEXT"]
        [::std::mem::align_of::<XrHandJointsMotionRangeInfoEXT>() - 8usize];
    ["Offset of field: XrHandJointsMotionRangeInfoEXT::type_"]
        [::std::mem::offset_of!(XrHandJointsMotionRangeInfoEXT, type_) - 0usize];
    ["Offset of field: XrHandJointsMotionRangeInfoEXT::next"]
        [::std::mem::offset_of!(XrHandJointsMotionRangeInfoEXT, next) - 8usize];
    ["Offset of field: XrHandJointsMotionRangeInfoEXT::handJointsMotionRange"]
        [::std::mem::offset_of!(XrHandJointsMotionRangeInfoEXT, handJointsMotionRange) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSceneObserverMSFT_T {
    _unused: [u8; 0],
}
pub type XrSceneObserverMSFT = *mut XrSceneObserverMSFT_T;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSceneMSFT_T {
    _unused: [u8; 0],
}
pub type XrSceneMSFT = *mut XrSceneMSFT_T;
pub const XrSceneComputeFeatureMSFT_XR_SCENE_COMPUTE_FEATURE_PLANE_MSFT: XrSceneComputeFeatureMSFT =
    1;
pub const XrSceneComputeFeatureMSFT_XR_SCENE_COMPUTE_FEATURE_PLANE_MESH_MSFT:
    XrSceneComputeFeatureMSFT = 2;
pub const XrSceneComputeFeatureMSFT_XR_SCENE_COMPUTE_FEATURE_VISUAL_MESH_MSFT:
    XrSceneComputeFeatureMSFT = 3;
pub const XrSceneComputeFeatureMSFT_XR_SCENE_COMPUTE_FEATURE_COLLIDER_MESH_MSFT:
    XrSceneComputeFeatureMSFT = 4;
pub const XrSceneComputeFeatureMSFT_XR_SCENE_COMPUTE_FEATURE_SERIALIZE_SCENE_MSFT:
    XrSceneComputeFeatureMSFT = 1000098000;
pub const XrSceneComputeFeatureMSFT_XR_SCENE_COMPUTE_FEATURE_MARKER_MSFT:
    XrSceneComputeFeatureMSFT = 1000147000;
pub const XrSceneComputeFeatureMSFT_XR_SCENE_COMPUTE_FEATURE_MAX_ENUM_MSFT:
    XrSceneComputeFeatureMSFT = 2147483647;
pub type XrSceneComputeFeatureMSFT = ::std::os::raw::c_uint;
pub const XrSceneComputeConsistencyMSFT_XR_SCENE_COMPUTE_CONSISTENCY_SNAPSHOT_COMPLETE_MSFT:
    XrSceneComputeConsistencyMSFT = 1;
pub const XrSceneComputeConsistencyMSFT_XR_SCENE_COMPUTE_CONSISTENCY_SNAPSHOT_INCOMPLETE_FAST_MSFT : XrSceneComputeConsistencyMSFT = 2 ;
pub const XrSceneComputeConsistencyMSFT_XR_SCENE_COMPUTE_CONSISTENCY_OCCLUSION_OPTIMIZED_MSFT:
    XrSceneComputeConsistencyMSFT = 3;
pub const XrSceneComputeConsistencyMSFT_XR_SCENE_COMPUTE_CONSISTENCY_MAX_ENUM_MSFT:
    XrSceneComputeConsistencyMSFT = 2147483647;
pub type XrSceneComputeConsistencyMSFT = ::std::os::raw::c_uint;
pub const XrMeshComputeLodMSFT_XR_MESH_COMPUTE_LOD_COARSE_MSFT: XrMeshComputeLodMSFT = 1;
pub const XrMeshComputeLodMSFT_XR_MESH_COMPUTE_LOD_MEDIUM_MSFT: XrMeshComputeLodMSFT = 2;
pub const XrMeshComputeLodMSFT_XR_MESH_COMPUTE_LOD_FINE_MSFT: XrMeshComputeLodMSFT = 3;
pub const XrMeshComputeLodMSFT_XR_MESH_COMPUTE_LOD_UNLIMITED_MSFT: XrMeshComputeLodMSFT = 4;
pub const XrMeshComputeLodMSFT_XR_MESH_COMPUTE_LOD_MAX_ENUM_MSFT: XrMeshComputeLodMSFT = 2147483647;
pub type XrMeshComputeLodMSFT = ::std::os::raw::c_uint;
pub const XrSceneComponentTypeMSFT_XR_SCENE_COMPONENT_TYPE_INVALID_MSFT: XrSceneComponentTypeMSFT =
    -1;
pub const XrSceneComponentTypeMSFT_XR_SCENE_COMPONENT_TYPE_OBJECT_MSFT: XrSceneComponentTypeMSFT =
    1;
pub const XrSceneComponentTypeMSFT_XR_SCENE_COMPONENT_TYPE_PLANE_MSFT: XrSceneComponentTypeMSFT = 2;
pub const XrSceneComponentTypeMSFT_XR_SCENE_COMPONENT_TYPE_VISUAL_MESH_MSFT:
    XrSceneComponentTypeMSFT = 3;
pub const XrSceneComponentTypeMSFT_XR_SCENE_COMPONENT_TYPE_COLLIDER_MESH_MSFT:
    XrSceneComponentTypeMSFT = 4;
pub const XrSceneComponentTypeMSFT_XR_SCENE_COMPONENT_TYPE_SERIALIZED_SCENE_FRAGMENT_MSFT:
    XrSceneComponentTypeMSFT = 1000098000;
pub const XrSceneComponentTypeMSFT_XR_SCENE_COMPONENT_TYPE_MARKER_MSFT: XrSceneComponentTypeMSFT =
    1000147000;
pub const XrSceneComponentTypeMSFT_XR_SCENE_COMPONENT_TYPE_MAX_ENUM_MSFT: XrSceneComponentTypeMSFT =
    2147483647;
pub type XrSceneComponentTypeMSFT = ::std::os::raw::c_int;
pub const XrSceneObjectTypeMSFT_XR_SCENE_OBJECT_TYPE_UNCATEGORIZED_MSFT: XrSceneObjectTypeMSFT = -1;
pub const XrSceneObjectTypeMSFT_XR_SCENE_OBJECT_TYPE_BACKGROUND_MSFT: XrSceneObjectTypeMSFT = 1;
pub const XrSceneObjectTypeMSFT_XR_SCENE_OBJECT_TYPE_WALL_MSFT: XrSceneObjectTypeMSFT = 2;
pub const XrSceneObjectTypeMSFT_XR_SCENE_OBJECT_TYPE_FLOOR_MSFT: XrSceneObjectTypeMSFT = 3;
pub const XrSceneObjectTypeMSFT_XR_SCENE_OBJECT_TYPE_CEILING_MSFT: XrSceneObjectTypeMSFT = 4;
pub const XrSceneObjectTypeMSFT_XR_SCENE_OBJECT_TYPE_PLATFORM_MSFT: XrSceneObjectTypeMSFT = 5;
pub const XrSceneObjectTypeMSFT_XR_SCENE_OBJECT_TYPE_INFERRED_MSFT: XrSceneObjectTypeMSFT = 6;
pub const XrSceneObjectTypeMSFT_XR_SCENE_OBJECT_TYPE_MAX_ENUM_MSFT: XrSceneObjectTypeMSFT =
    2147483647;
pub type XrSceneObjectTypeMSFT = ::std::os::raw::c_int;
pub const XrScenePlaneAlignmentTypeMSFT_XR_SCENE_PLANE_ALIGNMENT_TYPE_NON_ORTHOGONAL_MSFT:
    XrScenePlaneAlignmentTypeMSFT = 0;
pub const XrScenePlaneAlignmentTypeMSFT_XR_SCENE_PLANE_ALIGNMENT_TYPE_HORIZONTAL_MSFT:
    XrScenePlaneAlignmentTypeMSFT = 1;
pub const XrScenePlaneAlignmentTypeMSFT_XR_SCENE_PLANE_ALIGNMENT_TYPE_VERTICAL_MSFT:
    XrScenePlaneAlignmentTypeMSFT = 2;
pub const XrScenePlaneAlignmentTypeMSFT_XR_SCENE_PLANE_ALIGNMENT_TYPE_MAX_ENUM_MSFT:
    XrScenePlaneAlignmentTypeMSFT = 2147483647;
pub type XrScenePlaneAlignmentTypeMSFT = ::std::os::raw::c_uint;
pub const XrSceneComputeStateMSFT_XR_SCENE_COMPUTE_STATE_NONE_MSFT: XrSceneComputeStateMSFT = 0;
pub const XrSceneComputeStateMSFT_XR_SCENE_COMPUTE_STATE_UPDATING_MSFT: XrSceneComputeStateMSFT = 1;
pub const XrSceneComputeStateMSFT_XR_SCENE_COMPUTE_STATE_COMPLETED_MSFT: XrSceneComputeStateMSFT =
    2;
pub const XrSceneComputeStateMSFT_XR_SCENE_COMPUTE_STATE_COMPLETED_WITH_ERROR_MSFT:
    XrSceneComputeStateMSFT = 3;
pub const XrSceneComputeStateMSFT_XR_SCENE_COMPUTE_STATE_MAX_ENUM_MSFT: XrSceneComputeStateMSFT =
    2147483647;
pub type XrSceneComputeStateMSFT = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrUuidMSFT {
    pub bytes: [u8; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrUuidMSFT"][::std::mem::size_of::<XrUuidMSFT>() - 16usize];
    ["Alignment of XrUuidMSFT"][::std::mem::align_of::<XrUuidMSFT>() - 1usize];
    ["Offset of field: XrUuidMSFT::bytes"][::std::mem::offset_of!(XrUuidMSFT, bytes) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSceneObserverCreateInfoMSFT {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSceneObserverCreateInfoMSFT"]
        [::std::mem::size_of::<XrSceneObserverCreateInfoMSFT>() - 16usize];
    ["Alignment of XrSceneObserverCreateInfoMSFT"]
        [::std::mem::align_of::<XrSceneObserverCreateInfoMSFT>() - 8usize];
    ["Offset of field: XrSceneObserverCreateInfoMSFT::type_"]
        [::std::mem::offset_of!(XrSceneObserverCreateInfoMSFT, type_) - 0usize];
    ["Offset of field: XrSceneObserverCreateInfoMSFT::next"]
        [::std::mem::offset_of!(XrSceneObserverCreateInfoMSFT, next) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSceneCreateInfoMSFT {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSceneCreateInfoMSFT"][::std::mem::size_of::<XrSceneCreateInfoMSFT>() - 16usize];
    ["Alignment of XrSceneCreateInfoMSFT"]
        [::std::mem::align_of::<XrSceneCreateInfoMSFT>() - 8usize];
    ["Offset of field: XrSceneCreateInfoMSFT::type_"]
        [::std::mem::offset_of!(XrSceneCreateInfoMSFT, type_) - 0usize];
    ["Offset of field: XrSceneCreateInfoMSFT::next"]
        [::std::mem::offset_of!(XrSceneCreateInfoMSFT, next) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSceneSphereBoundMSFT {
    pub center: XrVector3f,
    pub radius: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSceneSphereBoundMSFT"][::std::mem::size_of::<XrSceneSphereBoundMSFT>() - 16usize];
    ["Alignment of XrSceneSphereBoundMSFT"]
        [::std::mem::align_of::<XrSceneSphereBoundMSFT>() - 4usize];
    ["Offset of field: XrSceneSphereBoundMSFT::center"]
        [::std::mem::offset_of!(XrSceneSphereBoundMSFT, center) - 0usize];
    ["Offset of field: XrSceneSphereBoundMSFT::radius"]
        [::std::mem::offset_of!(XrSceneSphereBoundMSFT, radius) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSceneOrientedBoxBoundMSFT {
    pub pose: XrPosef,
    pub extents: XrVector3f,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSceneOrientedBoxBoundMSFT"]
        [::std::mem::size_of::<XrSceneOrientedBoxBoundMSFT>() - 40usize];
    ["Alignment of XrSceneOrientedBoxBoundMSFT"]
        [::std::mem::align_of::<XrSceneOrientedBoxBoundMSFT>() - 4usize];
    ["Offset of field: XrSceneOrientedBoxBoundMSFT::pose"]
        [::std::mem::offset_of!(XrSceneOrientedBoxBoundMSFT, pose) - 0usize];
    ["Offset of field: XrSceneOrientedBoxBoundMSFT::extents"]
        [::std::mem::offset_of!(XrSceneOrientedBoxBoundMSFT, extents) - 28usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSceneFrustumBoundMSFT {
    pub pose: XrPosef,
    pub fov: XrFovf,
    pub farDistance: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSceneFrustumBoundMSFT"][::std::mem::size_of::<XrSceneFrustumBoundMSFT>() - 48usize];
    ["Alignment of XrSceneFrustumBoundMSFT"]
        [::std::mem::align_of::<XrSceneFrustumBoundMSFT>() - 4usize];
    ["Offset of field: XrSceneFrustumBoundMSFT::pose"]
        [::std::mem::offset_of!(XrSceneFrustumBoundMSFT, pose) - 0usize];
    ["Offset of field: XrSceneFrustumBoundMSFT::fov"]
        [::std::mem::offset_of!(XrSceneFrustumBoundMSFT, fov) - 28usize];
    ["Offset of field: XrSceneFrustumBoundMSFT::farDistance"]
        [::std::mem::offset_of!(XrSceneFrustumBoundMSFT, farDistance) - 44usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSceneBoundsMSFT {
    pub space: XrSpace,
    pub time: XrTime,
    pub sphereCount: u32,
    pub spheres: *const XrSceneSphereBoundMSFT,
    pub boxCount: u32,
    pub boxes: *const XrSceneOrientedBoxBoundMSFT,
    pub frustumCount: u32,
    pub frustums: *const XrSceneFrustumBoundMSFT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSceneBoundsMSFT"][::std::mem::size_of::<XrSceneBoundsMSFT>() - 64usize];
    ["Alignment of XrSceneBoundsMSFT"][::std::mem::align_of::<XrSceneBoundsMSFT>() - 8usize];
    ["Offset of field: XrSceneBoundsMSFT::space"]
        [::std::mem::offset_of!(XrSceneBoundsMSFT, space) - 0usize];
    ["Offset of field: XrSceneBoundsMSFT::time"]
        [::std::mem::offset_of!(XrSceneBoundsMSFT, time) - 8usize];
    ["Offset of field: XrSceneBoundsMSFT::sphereCount"]
        [::std::mem::offset_of!(XrSceneBoundsMSFT, sphereCount) - 16usize];
    ["Offset of field: XrSceneBoundsMSFT::spheres"]
        [::std::mem::offset_of!(XrSceneBoundsMSFT, spheres) - 24usize];
    ["Offset of field: XrSceneBoundsMSFT::boxCount"]
        [::std::mem::offset_of!(XrSceneBoundsMSFT, boxCount) - 32usize];
    ["Offset of field: XrSceneBoundsMSFT::boxes"]
        [::std::mem::offset_of!(XrSceneBoundsMSFT, boxes) - 40usize];
    ["Offset of field: XrSceneBoundsMSFT::frustumCount"]
        [::std::mem::offset_of!(XrSceneBoundsMSFT, frustumCount) - 48usize];
    ["Offset of field: XrSceneBoundsMSFT::frustums"]
        [::std::mem::offset_of!(XrSceneBoundsMSFT, frustums) - 56usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrNewSceneComputeInfoMSFT {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub requestedFeatureCount: u32,
    pub requestedFeatures: *const XrSceneComputeFeatureMSFT,
    pub consistency: XrSceneComputeConsistencyMSFT,
    pub bounds: XrSceneBoundsMSFT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrNewSceneComputeInfoMSFT"]
        [::std::mem::size_of::<XrNewSceneComputeInfoMSFT>() - 104usize];
    ["Alignment of XrNewSceneComputeInfoMSFT"]
        [::std::mem::align_of::<XrNewSceneComputeInfoMSFT>() - 8usize];
    ["Offset of field: XrNewSceneComputeInfoMSFT::type_"]
        [::std::mem::offset_of!(XrNewSceneComputeInfoMSFT, type_) - 0usize];
    ["Offset of field: XrNewSceneComputeInfoMSFT::next"]
        [::std::mem::offset_of!(XrNewSceneComputeInfoMSFT, next) - 8usize];
    ["Offset of field: XrNewSceneComputeInfoMSFT::requestedFeatureCount"]
        [::std::mem::offset_of!(XrNewSceneComputeInfoMSFT, requestedFeatureCount) - 16usize];
    ["Offset of field: XrNewSceneComputeInfoMSFT::requestedFeatures"]
        [::std::mem::offset_of!(XrNewSceneComputeInfoMSFT, requestedFeatures) - 24usize];
    ["Offset of field: XrNewSceneComputeInfoMSFT::consistency"]
        [::std::mem::offset_of!(XrNewSceneComputeInfoMSFT, consistency) - 32usize];
    ["Offset of field: XrNewSceneComputeInfoMSFT::bounds"]
        [::std::mem::offset_of!(XrNewSceneComputeInfoMSFT, bounds) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrVisualMeshComputeLodInfoMSFT {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub lod: XrMeshComputeLodMSFT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrVisualMeshComputeLodInfoMSFT"]
        [::std::mem::size_of::<XrVisualMeshComputeLodInfoMSFT>() - 24usize];
    ["Alignment of XrVisualMeshComputeLodInfoMSFT"]
        [::std::mem::align_of::<XrVisualMeshComputeLodInfoMSFT>() - 8usize];
    ["Offset of field: XrVisualMeshComputeLodInfoMSFT::type_"]
        [::std::mem::offset_of!(XrVisualMeshComputeLodInfoMSFT, type_) - 0usize];
    ["Offset of field: XrVisualMeshComputeLodInfoMSFT::next"]
        [::std::mem::offset_of!(XrVisualMeshComputeLodInfoMSFT, next) - 8usize];
    ["Offset of field: XrVisualMeshComputeLodInfoMSFT::lod"]
        [::std::mem::offset_of!(XrVisualMeshComputeLodInfoMSFT, lod) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSceneComponentMSFT {
    pub componentType: XrSceneComponentTypeMSFT,
    pub id: XrUuidMSFT,
    pub parentId: XrUuidMSFT,
    pub updateTime: XrTime,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSceneComponentMSFT"][::std::mem::size_of::<XrSceneComponentMSFT>() - 48usize];
    ["Alignment of XrSceneComponentMSFT"][::std::mem::align_of::<XrSceneComponentMSFT>() - 8usize];
    ["Offset of field: XrSceneComponentMSFT::componentType"]
        [::std::mem::offset_of!(XrSceneComponentMSFT, componentType) - 0usize];
    ["Offset of field: XrSceneComponentMSFT::id"]
        [::std::mem::offset_of!(XrSceneComponentMSFT, id) - 4usize];
    ["Offset of field: XrSceneComponentMSFT::parentId"]
        [::std::mem::offset_of!(XrSceneComponentMSFT, parentId) - 20usize];
    ["Offset of field: XrSceneComponentMSFT::updateTime"]
        [::std::mem::offset_of!(XrSceneComponentMSFT, updateTime) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSceneComponentsMSFT {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub componentCapacityInput: u32,
    pub componentCountOutput: u32,
    pub components: *mut XrSceneComponentMSFT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSceneComponentsMSFT"][::std::mem::size_of::<XrSceneComponentsMSFT>() - 32usize];
    ["Alignment of XrSceneComponentsMSFT"]
        [::std::mem::align_of::<XrSceneComponentsMSFT>() - 8usize];
    ["Offset of field: XrSceneComponentsMSFT::type_"]
        [::std::mem::offset_of!(XrSceneComponentsMSFT, type_) - 0usize];
    ["Offset of field: XrSceneComponentsMSFT::next"]
        [::std::mem::offset_of!(XrSceneComponentsMSFT, next) - 8usize];
    ["Offset of field: XrSceneComponentsMSFT::componentCapacityInput"]
        [::std::mem::offset_of!(XrSceneComponentsMSFT, componentCapacityInput) - 16usize];
    ["Offset of field: XrSceneComponentsMSFT::componentCountOutput"]
        [::std::mem::offset_of!(XrSceneComponentsMSFT, componentCountOutput) - 20usize];
    ["Offset of field: XrSceneComponentsMSFT::components"]
        [::std::mem::offset_of!(XrSceneComponentsMSFT, components) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSceneComponentsGetInfoMSFT {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub componentType: XrSceneComponentTypeMSFT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSceneComponentsGetInfoMSFT"]
        [::std::mem::size_of::<XrSceneComponentsGetInfoMSFT>() - 24usize];
    ["Alignment of XrSceneComponentsGetInfoMSFT"]
        [::std::mem::align_of::<XrSceneComponentsGetInfoMSFT>() - 8usize];
    ["Offset of field: XrSceneComponentsGetInfoMSFT::type_"]
        [::std::mem::offset_of!(XrSceneComponentsGetInfoMSFT, type_) - 0usize];
    ["Offset of field: XrSceneComponentsGetInfoMSFT::next"]
        [::std::mem::offset_of!(XrSceneComponentsGetInfoMSFT, next) - 8usize];
    ["Offset of field: XrSceneComponentsGetInfoMSFT::componentType"]
        [::std::mem::offset_of!(XrSceneComponentsGetInfoMSFT, componentType) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSceneComponentLocationMSFT {
    pub flags: XrSpaceLocationFlags,
    pub pose: XrPosef,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSceneComponentLocationMSFT"]
        [::std::mem::size_of::<XrSceneComponentLocationMSFT>() - 40usize];
    ["Alignment of XrSceneComponentLocationMSFT"]
        [::std::mem::align_of::<XrSceneComponentLocationMSFT>() - 8usize];
    ["Offset of field: XrSceneComponentLocationMSFT::flags"]
        [::std::mem::offset_of!(XrSceneComponentLocationMSFT, flags) - 0usize];
    ["Offset of field: XrSceneComponentLocationMSFT::pose"]
        [::std::mem::offset_of!(XrSceneComponentLocationMSFT, pose) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSceneComponentLocationsMSFT {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub locationCount: u32,
    pub locations: *mut XrSceneComponentLocationMSFT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSceneComponentLocationsMSFT"]
        [::std::mem::size_of::<XrSceneComponentLocationsMSFT>() - 32usize];
    ["Alignment of XrSceneComponentLocationsMSFT"]
        [::std::mem::align_of::<XrSceneComponentLocationsMSFT>() - 8usize];
    ["Offset of field: XrSceneComponentLocationsMSFT::type_"]
        [::std::mem::offset_of!(XrSceneComponentLocationsMSFT, type_) - 0usize];
    ["Offset of field: XrSceneComponentLocationsMSFT::next"]
        [::std::mem::offset_of!(XrSceneComponentLocationsMSFT, next) - 8usize];
    ["Offset of field: XrSceneComponentLocationsMSFT::locationCount"]
        [::std::mem::offset_of!(XrSceneComponentLocationsMSFT, locationCount) - 16usize];
    ["Offset of field: XrSceneComponentLocationsMSFT::locations"]
        [::std::mem::offset_of!(XrSceneComponentLocationsMSFT, locations) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSceneComponentsLocateInfoMSFT {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub baseSpace: XrSpace,
    pub time: XrTime,
    pub componentIdCount: u32,
    pub componentIds: *const XrUuidMSFT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSceneComponentsLocateInfoMSFT"]
        [::std::mem::size_of::<XrSceneComponentsLocateInfoMSFT>() - 48usize];
    ["Alignment of XrSceneComponentsLocateInfoMSFT"]
        [::std::mem::align_of::<XrSceneComponentsLocateInfoMSFT>() - 8usize];
    ["Offset of field: XrSceneComponentsLocateInfoMSFT::type_"]
        [::std::mem::offset_of!(XrSceneComponentsLocateInfoMSFT, type_) - 0usize];
    ["Offset of field: XrSceneComponentsLocateInfoMSFT::next"]
        [::std::mem::offset_of!(XrSceneComponentsLocateInfoMSFT, next) - 8usize];
    ["Offset of field: XrSceneComponentsLocateInfoMSFT::baseSpace"]
        [::std::mem::offset_of!(XrSceneComponentsLocateInfoMSFT, baseSpace) - 16usize];
    ["Offset of field: XrSceneComponentsLocateInfoMSFT::time"]
        [::std::mem::offset_of!(XrSceneComponentsLocateInfoMSFT, time) - 24usize];
    ["Offset of field: XrSceneComponentsLocateInfoMSFT::componentIdCount"]
        [::std::mem::offset_of!(XrSceneComponentsLocateInfoMSFT, componentIdCount) - 32usize];
    ["Offset of field: XrSceneComponentsLocateInfoMSFT::componentIds"]
        [::std::mem::offset_of!(XrSceneComponentsLocateInfoMSFT, componentIds) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSceneObjectMSFT {
    pub objectType: XrSceneObjectTypeMSFT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSceneObjectMSFT"][::std::mem::size_of::<XrSceneObjectMSFT>() - 4usize];
    ["Alignment of XrSceneObjectMSFT"][::std::mem::align_of::<XrSceneObjectMSFT>() - 4usize];
    ["Offset of field: XrSceneObjectMSFT::objectType"]
        [::std::mem::offset_of!(XrSceneObjectMSFT, objectType) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSceneObjectsMSFT {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub sceneObjectCount: u32,
    pub sceneObjects: *mut XrSceneObjectMSFT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSceneObjectsMSFT"][::std::mem::size_of::<XrSceneObjectsMSFT>() - 32usize];
    ["Alignment of XrSceneObjectsMSFT"][::std::mem::align_of::<XrSceneObjectsMSFT>() - 8usize];
    ["Offset of field: XrSceneObjectsMSFT::type_"]
        [::std::mem::offset_of!(XrSceneObjectsMSFT, type_) - 0usize];
    ["Offset of field: XrSceneObjectsMSFT::next"]
        [::std::mem::offset_of!(XrSceneObjectsMSFT, next) - 8usize];
    ["Offset of field: XrSceneObjectsMSFT::sceneObjectCount"]
        [::std::mem::offset_of!(XrSceneObjectsMSFT, sceneObjectCount) - 16usize];
    ["Offset of field: XrSceneObjectsMSFT::sceneObjects"]
        [::std::mem::offset_of!(XrSceneObjectsMSFT, sceneObjects) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSceneComponentParentFilterInfoMSFT {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub parentId: XrUuidMSFT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSceneComponentParentFilterInfoMSFT"]
        [::std::mem::size_of::<XrSceneComponentParentFilterInfoMSFT>() - 32usize];
    ["Alignment of XrSceneComponentParentFilterInfoMSFT"]
        [::std::mem::align_of::<XrSceneComponentParentFilterInfoMSFT>() - 8usize];
    ["Offset of field: XrSceneComponentParentFilterInfoMSFT::type_"]
        [::std::mem::offset_of!(XrSceneComponentParentFilterInfoMSFT, type_) - 0usize];
    ["Offset of field: XrSceneComponentParentFilterInfoMSFT::next"]
        [::std::mem::offset_of!(XrSceneComponentParentFilterInfoMSFT, next) - 8usize];
    ["Offset of field: XrSceneComponentParentFilterInfoMSFT::parentId"]
        [::std::mem::offset_of!(XrSceneComponentParentFilterInfoMSFT, parentId) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSceneObjectTypesFilterInfoMSFT {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub objectTypeCount: u32,
    pub objectTypes: *const XrSceneObjectTypeMSFT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSceneObjectTypesFilterInfoMSFT"]
        [::std::mem::size_of::<XrSceneObjectTypesFilterInfoMSFT>() - 32usize];
    ["Alignment of XrSceneObjectTypesFilterInfoMSFT"]
        [::std::mem::align_of::<XrSceneObjectTypesFilterInfoMSFT>() - 8usize];
    ["Offset of field: XrSceneObjectTypesFilterInfoMSFT::type_"]
        [::std::mem::offset_of!(XrSceneObjectTypesFilterInfoMSFT, type_) - 0usize];
    ["Offset of field: XrSceneObjectTypesFilterInfoMSFT::next"]
        [::std::mem::offset_of!(XrSceneObjectTypesFilterInfoMSFT, next) - 8usize];
    ["Offset of field: XrSceneObjectTypesFilterInfoMSFT::objectTypeCount"]
        [::std::mem::offset_of!(XrSceneObjectTypesFilterInfoMSFT, objectTypeCount) - 16usize];
    ["Offset of field: XrSceneObjectTypesFilterInfoMSFT::objectTypes"]
        [::std::mem::offset_of!(XrSceneObjectTypesFilterInfoMSFT, objectTypes) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrScenePlaneMSFT {
    pub alignment: XrScenePlaneAlignmentTypeMSFT,
    pub size: XrExtent2Df,
    pub meshBufferId: u64,
    pub supportsIndicesUint16: XrBool32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrScenePlaneMSFT"][::std::mem::size_of::<XrScenePlaneMSFT>() - 32usize];
    ["Alignment of XrScenePlaneMSFT"][::std::mem::align_of::<XrScenePlaneMSFT>() - 8usize];
    ["Offset of field: XrScenePlaneMSFT::alignment"]
        [::std::mem::offset_of!(XrScenePlaneMSFT, alignment) - 0usize];
    ["Offset of field: XrScenePlaneMSFT::size"]
        [::std::mem::offset_of!(XrScenePlaneMSFT, size) - 4usize];
    ["Offset of field: XrScenePlaneMSFT::meshBufferId"]
        [::std::mem::offset_of!(XrScenePlaneMSFT, meshBufferId) - 16usize];
    ["Offset of field: XrScenePlaneMSFT::supportsIndicesUint16"]
        [::std::mem::offset_of!(XrScenePlaneMSFT, supportsIndicesUint16) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrScenePlanesMSFT {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub scenePlaneCount: u32,
    pub scenePlanes: *mut XrScenePlaneMSFT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrScenePlanesMSFT"][::std::mem::size_of::<XrScenePlanesMSFT>() - 32usize];
    ["Alignment of XrScenePlanesMSFT"][::std::mem::align_of::<XrScenePlanesMSFT>() - 8usize];
    ["Offset of field: XrScenePlanesMSFT::type_"]
        [::std::mem::offset_of!(XrScenePlanesMSFT, type_) - 0usize];
    ["Offset of field: XrScenePlanesMSFT::next"]
        [::std::mem::offset_of!(XrScenePlanesMSFT, next) - 8usize];
    ["Offset of field: XrScenePlanesMSFT::scenePlaneCount"]
        [::std::mem::offset_of!(XrScenePlanesMSFT, scenePlaneCount) - 16usize];
    ["Offset of field: XrScenePlanesMSFT::scenePlanes"]
        [::std::mem::offset_of!(XrScenePlanesMSFT, scenePlanes) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrScenePlaneAlignmentFilterInfoMSFT {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub alignmentCount: u32,
    pub alignments: *const XrScenePlaneAlignmentTypeMSFT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrScenePlaneAlignmentFilterInfoMSFT"]
        [::std::mem::size_of::<XrScenePlaneAlignmentFilterInfoMSFT>() - 32usize];
    ["Alignment of XrScenePlaneAlignmentFilterInfoMSFT"]
        [::std::mem::align_of::<XrScenePlaneAlignmentFilterInfoMSFT>() - 8usize];
    ["Offset of field: XrScenePlaneAlignmentFilterInfoMSFT::type_"]
        [::std::mem::offset_of!(XrScenePlaneAlignmentFilterInfoMSFT, type_) - 0usize];
    ["Offset of field: XrScenePlaneAlignmentFilterInfoMSFT::next"]
        [::std::mem::offset_of!(XrScenePlaneAlignmentFilterInfoMSFT, next) - 8usize];
    ["Offset of field: XrScenePlaneAlignmentFilterInfoMSFT::alignmentCount"]
        [::std::mem::offset_of!(XrScenePlaneAlignmentFilterInfoMSFT, alignmentCount) - 16usize];
    ["Offset of field: XrScenePlaneAlignmentFilterInfoMSFT::alignments"]
        [::std::mem::offset_of!(XrScenePlaneAlignmentFilterInfoMSFT, alignments) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSceneMeshMSFT {
    pub meshBufferId: u64,
    pub supportsIndicesUint16: XrBool32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSceneMeshMSFT"][::std::mem::size_of::<XrSceneMeshMSFT>() - 16usize];
    ["Alignment of XrSceneMeshMSFT"][::std::mem::align_of::<XrSceneMeshMSFT>() - 8usize];
    ["Offset of field: XrSceneMeshMSFT::meshBufferId"]
        [::std::mem::offset_of!(XrSceneMeshMSFT, meshBufferId) - 0usize];
    ["Offset of field: XrSceneMeshMSFT::supportsIndicesUint16"]
        [::std::mem::offset_of!(XrSceneMeshMSFT, supportsIndicesUint16) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSceneMeshesMSFT {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub sceneMeshCount: u32,
    pub sceneMeshes: *mut XrSceneMeshMSFT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSceneMeshesMSFT"][::std::mem::size_of::<XrSceneMeshesMSFT>() - 32usize];
    ["Alignment of XrSceneMeshesMSFT"][::std::mem::align_of::<XrSceneMeshesMSFT>() - 8usize];
    ["Offset of field: XrSceneMeshesMSFT::type_"]
        [::std::mem::offset_of!(XrSceneMeshesMSFT, type_) - 0usize];
    ["Offset of field: XrSceneMeshesMSFT::next"]
        [::std::mem::offset_of!(XrSceneMeshesMSFT, next) - 8usize];
    ["Offset of field: XrSceneMeshesMSFT::sceneMeshCount"]
        [::std::mem::offset_of!(XrSceneMeshesMSFT, sceneMeshCount) - 16usize];
    ["Offset of field: XrSceneMeshesMSFT::sceneMeshes"]
        [::std::mem::offset_of!(XrSceneMeshesMSFT, sceneMeshes) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSceneMeshBuffersGetInfoMSFT {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub meshBufferId: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSceneMeshBuffersGetInfoMSFT"]
        [::std::mem::size_of::<XrSceneMeshBuffersGetInfoMSFT>() - 24usize];
    ["Alignment of XrSceneMeshBuffersGetInfoMSFT"]
        [::std::mem::align_of::<XrSceneMeshBuffersGetInfoMSFT>() - 8usize];
    ["Offset of field: XrSceneMeshBuffersGetInfoMSFT::type_"]
        [::std::mem::offset_of!(XrSceneMeshBuffersGetInfoMSFT, type_) - 0usize];
    ["Offset of field: XrSceneMeshBuffersGetInfoMSFT::next"]
        [::std::mem::offset_of!(XrSceneMeshBuffersGetInfoMSFT, next) - 8usize];
    ["Offset of field: XrSceneMeshBuffersGetInfoMSFT::meshBufferId"]
        [::std::mem::offset_of!(XrSceneMeshBuffersGetInfoMSFT, meshBufferId) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSceneMeshBuffersMSFT {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSceneMeshBuffersMSFT"][::std::mem::size_of::<XrSceneMeshBuffersMSFT>() - 16usize];
    ["Alignment of XrSceneMeshBuffersMSFT"]
        [::std::mem::align_of::<XrSceneMeshBuffersMSFT>() - 8usize];
    ["Offset of field: XrSceneMeshBuffersMSFT::type_"]
        [::std::mem::offset_of!(XrSceneMeshBuffersMSFT, type_) - 0usize];
    ["Offset of field: XrSceneMeshBuffersMSFT::next"]
        [::std::mem::offset_of!(XrSceneMeshBuffersMSFT, next) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSceneMeshVertexBufferMSFT {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub vertexCapacityInput: u32,
    pub vertexCountOutput: u32,
    pub vertices: *mut XrVector3f,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSceneMeshVertexBufferMSFT"]
        [::std::mem::size_of::<XrSceneMeshVertexBufferMSFT>() - 32usize];
    ["Alignment of XrSceneMeshVertexBufferMSFT"]
        [::std::mem::align_of::<XrSceneMeshVertexBufferMSFT>() - 8usize];
    ["Offset of field: XrSceneMeshVertexBufferMSFT::type_"]
        [::std::mem::offset_of!(XrSceneMeshVertexBufferMSFT, type_) - 0usize];
    ["Offset of field: XrSceneMeshVertexBufferMSFT::next"]
        [::std::mem::offset_of!(XrSceneMeshVertexBufferMSFT, next) - 8usize];
    ["Offset of field: XrSceneMeshVertexBufferMSFT::vertexCapacityInput"]
        [::std::mem::offset_of!(XrSceneMeshVertexBufferMSFT, vertexCapacityInput) - 16usize];
    ["Offset of field: XrSceneMeshVertexBufferMSFT::vertexCountOutput"]
        [::std::mem::offset_of!(XrSceneMeshVertexBufferMSFT, vertexCountOutput) - 20usize];
    ["Offset of field: XrSceneMeshVertexBufferMSFT::vertices"]
        [::std::mem::offset_of!(XrSceneMeshVertexBufferMSFT, vertices) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSceneMeshIndicesUint32MSFT {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub indexCapacityInput: u32,
    pub indexCountOutput: u32,
    pub indices: *mut u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSceneMeshIndicesUint32MSFT"]
        [::std::mem::size_of::<XrSceneMeshIndicesUint32MSFT>() - 32usize];
    ["Alignment of XrSceneMeshIndicesUint32MSFT"]
        [::std::mem::align_of::<XrSceneMeshIndicesUint32MSFT>() - 8usize];
    ["Offset of field: XrSceneMeshIndicesUint32MSFT::type_"]
        [::std::mem::offset_of!(XrSceneMeshIndicesUint32MSFT, type_) - 0usize];
    ["Offset of field: XrSceneMeshIndicesUint32MSFT::next"]
        [::std::mem::offset_of!(XrSceneMeshIndicesUint32MSFT, next) - 8usize];
    ["Offset of field: XrSceneMeshIndicesUint32MSFT::indexCapacityInput"]
        [::std::mem::offset_of!(XrSceneMeshIndicesUint32MSFT, indexCapacityInput) - 16usize];
    ["Offset of field: XrSceneMeshIndicesUint32MSFT::indexCountOutput"]
        [::std::mem::offset_of!(XrSceneMeshIndicesUint32MSFT, indexCountOutput) - 20usize];
    ["Offset of field: XrSceneMeshIndicesUint32MSFT::indices"]
        [::std::mem::offset_of!(XrSceneMeshIndicesUint32MSFT, indices) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSceneMeshIndicesUint16MSFT {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub indexCapacityInput: u32,
    pub indexCountOutput: u32,
    pub indices: *mut u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSceneMeshIndicesUint16MSFT"]
        [::std::mem::size_of::<XrSceneMeshIndicesUint16MSFT>() - 32usize];
    ["Alignment of XrSceneMeshIndicesUint16MSFT"]
        [::std::mem::align_of::<XrSceneMeshIndicesUint16MSFT>() - 8usize];
    ["Offset of field: XrSceneMeshIndicesUint16MSFT::type_"]
        [::std::mem::offset_of!(XrSceneMeshIndicesUint16MSFT, type_) - 0usize];
    ["Offset of field: XrSceneMeshIndicesUint16MSFT::next"]
        [::std::mem::offset_of!(XrSceneMeshIndicesUint16MSFT, next) - 8usize];
    ["Offset of field: XrSceneMeshIndicesUint16MSFT::indexCapacityInput"]
        [::std::mem::offset_of!(XrSceneMeshIndicesUint16MSFT, indexCapacityInput) - 16usize];
    ["Offset of field: XrSceneMeshIndicesUint16MSFT::indexCountOutput"]
        [::std::mem::offset_of!(XrSceneMeshIndicesUint16MSFT, indexCountOutput) - 20usize];
    ["Offset of field: XrSceneMeshIndicesUint16MSFT::indices"]
        [::std::mem::offset_of!(XrSceneMeshIndicesUint16MSFT, indices) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSerializedSceneFragmentDataGetInfoMSFT {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub sceneFragmentId: XrUuidMSFT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSerializedSceneFragmentDataGetInfoMSFT"]
        [::std::mem::size_of::<XrSerializedSceneFragmentDataGetInfoMSFT>() - 32usize];
    ["Alignment of XrSerializedSceneFragmentDataGetInfoMSFT"]
        [::std::mem::align_of::<XrSerializedSceneFragmentDataGetInfoMSFT>() - 8usize];
    ["Offset of field: XrSerializedSceneFragmentDataGetInfoMSFT::type_"]
        [::std::mem::offset_of!(XrSerializedSceneFragmentDataGetInfoMSFT, type_) - 0usize];
    ["Offset of field: XrSerializedSceneFragmentDataGetInfoMSFT::next"]
        [::std::mem::offset_of!(XrSerializedSceneFragmentDataGetInfoMSFT, next) - 8usize];
    ["Offset of field: XrSerializedSceneFragmentDataGetInfoMSFT::sceneFragmentId"][::std::mem::offset_of!(
        XrSerializedSceneFragmentDataGetInfoMSFT,
        sceneFragmentId
    ) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrDeserializeSceneFragmentMSFT {
    pub bufferSize: u32,
    pub buffer: *const u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrDeserializeSceneFragmentMSFT"]
        [::std::mem::size_of::<XrDeserializeSceneFragmentMSFT>() - 16usize];
    ["Alignment of XrDeserializeSceneFragmentMSFT"]
        [::std::mem::align_of::<XrDeserializeSceneFragmentMSFT>() - 8usize];
    ["Offset of field: XrDeserializeSceneFragmentMSFT::bufferSize"]
        [::std::mem::offset_of!(XrDeserializeSceneFragmentMSFT, bufferSize) - 0usize];
    ["Offset of field: XrDeserializeSceneFragmentMSFT::buffer"]
        [::std::mem::offset_of!(XrDeserializeSceneFragmentMSFT, buffer) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSceneDeserializeInfoMSFT {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub fragmentCount: u32,
    pub fragments: *const XrDeserializeSceneFragmentMSFT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSceneDeserializeInfoMSFT"]
        [::std::mem::size_of::<XrSceneDeserializeInfoMSFT>() - 32usize];
    ["Alignment of XrSceneDeserializeInfoMSFT"]
        [::std::mem::align_of::<XrSceneDeserializeInfoMSFT>() - 8usize];
    ["Offset of field: XrSceneDeserializeInfoMSFT::type_"]
        [::std::mem::offset_of!(XrSceneDeserializeInfoMSFT, type_) - 0usize];
    ["Offset of field: XrSceneDeserializeInfoMSFT::next"]
        [::std::mem::offset_of!(XrSceneDeserializeInfoMSFT, next) - 8usize];
    ["Offset of field: XrSceneDeserializeInfoMSFT::fragmentCount"]
        [::std::mem::offset_of!(XrSceneDeserializeInfoMSFT, fragmentCount) - 16usize];
    ["Offset of field: XrSceneDeserializeInfoMSFT::fragments"]
        [::std::mem::offset_of!(XrSceneDeserializeInfoMSFT, fragments) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrEventDataDisplayRefreshRateChangedFB {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub fromDisplayRefreshRate: f32,
    pub toDisplayRefreshRate: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrEventDataDisplayRefreshRateChangedFB"]
        [::std::mem::size_of::<XrEventDataDisplayRefreshRateChangedFB>() - 24usize];
    ["Alignment of XrEventDataDisplayRefreshRateChangedFB"]
        [::std::mem::align_of::<XrEventDataDisplayRefreshRateChangedFB>() - 8usize];
    ["Offset of field: XrEventDataDisplayRefreshRateChangedFB::type_"]
        [::std::mem::offset_of!(XrEventDataDisplayRefreshRateChangedFB, type_) - 0usize];
    ["Offset of field: XrEventDataDisplayRefreshRateChangedFB::next"]
        [::std::mem::offset_of!(XrEventDataDisplayRefreshRateChangedFB, next) - 8usize];
    ["Offset of field: XrEventDataDisplayRefreshRateChangedFB::fromDisplayRefreshRate"][::std::mem::offset_of!(
        XrEventDataDisplayRefreshRateChangedFB,
        fromDisplayRefreshRate
    )
        - 16usize];
    ["Offset of field: XrEventDataDisplayRefreshRateChangedFB::toDisplayRefreshRate"][::std::mem::offset_of!(
        XrEventDataDisplayRefreshRateChangedFB,
        toDisplayRefreshRate
    ) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrViveTrackerPathsHTCX {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub persistentPath: XrPath,
    pub rolePath: XrPath,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrViveTrackerPathsHTCX"][::std::mem::size_of::<XrViveTrackerPathsHTCX>() - 32usize];
    ["Alignment of XrViveTrackerPathsHTCX"]
        [::std::mem::align_of::<XrViveTrackerPathsHTCX>() - 8usize];
    ["Offset of field: XrViveTrackerPathsHTCX::type_"]
        [::std::mem::offset_of!(XrViveTrackerPathsHTCX, type_) - 0usize];
    ["Offset of field: XrViveTrackerPathsHTCX::next"]
        [::std::mem::offset_of!(XrViveTrackerPathsHTCX, next) - 8usize];
    ["Offset of field: XrViveTrackerPathsHTCX::persistentPath"]
        [::std::mem::offset_of!(XrViveTrackerPathsHTCX, persistentPath) - 16usize];
    ["Offset of field: XrViveTrackerPathsHTCX::rolePath"]
        [::std::mem::offset_of!(XrViveTrackerPathsHTCX, rolePath) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrEventDataViveTrackerConnectedHTCX {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub paths: *mut XrViveTrackerPathsHTCX,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrEventDataViveTrackerConnectedHTCX"]
        [::std::mem::size_of::<XrEventDataViveTrackerConnectedHTCX>() - 24usize];
    ["Alignment of XrEventDataViveTrackerConnectedHTCX"]
        [::std::mem::align_of::<XrEventDataViveTrackerConnectedHTCX>() - 8usize];
    ["Offset of field: XrEventDataViveTrackerConnectedHTCX::type_"]
        [::std::mem::offset_of!(XrEventDataViveTrackerConnectedHTCX, type_) - 0usize];
    ["Offset of field: XrEventDataViveTrackerConnectedHTCX::next"]
        [::std::mem::offset_of!(XrEventDataViveTrackerConnectedHTCX, next) - 8usize];
    ["Offset of field: XrEventDataViveTrackerConnectedHTCX::paths"]
        [::std::mem::offset_of!(XrEventDataViveTrackerConnectedHTCX, paths) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrFacialTrackerHTC_T {
    _unused: [u8; 0],
}
pub type XrFacialTrackerHTC = *mut XrFacialTrackerHTC_T;
pub const XrEyeExpressionHTC_XR_EYE_EXPRESSION_LEFT_BLINK_HTC: XrEyeExpressionHTC = 0;
pub const XrEyeExpressionHTC_XR_EYE_EXPRESSION_LEFT_WIDE_HTC: XrEyeExpressionHTC = 1;
pub const XrEyeExpressionHTC_XR_EYE_EXPRESSION_RIGHT_BLINK_HTC: XrEyeExpressionHTC = 2;
pub const XrEyeExpressionHTC_XR_EYE_EXPRESSION_RIGHT_WIDE_HTC: XrEyeExpressionHTC = 3;
pub const XrEyeExpressionHTC_XR_EYE_EXPRESSION_LEFT_SQUEEZE_HTC: XrEyeExpressionHTC = 4;
pub const XrEyeExpressionHTC_XR_EYE_EXPRESSION_RIGHT_SQUEEZE_HTC: XrEyeExpressionHTC = 5;
pub const XrEyeExpressionHTC_XR_EYE_EXPRESSION_LEFT_DOWN_HTC: XrEyeExpressionHTC = 6;
pub const XrEyeExpressionHTC_XR_EYE_EXPRESSION_RIGHT_DOWN_HTC: XrEyeExpressionHTC = 7;
pub const XrEyeExpressionHTC_XR_EYE_EXPRESSION_LEFT_OUT_HTC: XrEyeExpressionHTC = 8;
pub const XrEyeExpressionHTC_XR_EYE_EXPRESSION_RIGHT_IN_HTC: XrEyeExpressionHTC = 9;
pub const XrEyeExpressionHTC_XR_EYE_EXPRESSION_LEFT_IN_HTC: XrEyeExpressionHTC = 10;
pub const XrEyeExpressionHTC_XR_EYE_EXPRESSION_RIGHT_OUT_HTC: XrEyeExpressionHTC = 11;
pub const XrEyeExpressionHTC_XR_EYE_EXPRESSION_LEFT_UP_HTC: XrEyeExpressionHTC = 12;
pub const XrEyeExpressionHTC_XR_EYE_EXPRESSION_RIGHT_UP_HTC: XrEyeExpressionHTC = 13;
pub const XrEyeExpressionHTC_XR_EYE_EXPRESSION_MAX_ENUM_HTC: XrEyeExpressionHTC = 2147483647;
pub type XrEyeExpressionHTC = ::std::os::raw::c_uint;
pub const XrLipExpressionHTC_XR_LIP_EXPRESSION_JAW_RIGHT_HTC: XrLipExpressionHTC = 0;
pub const XrLipExpressionHTC_XR_LIP_EXPRESSION_JAW_LEFT_HTC: XrLipExpressionHTC = 1;
pub const XrLipExpressionHTC_XR_LIP_EXPRESSION_JAW_FORWARD_HTC: XrLipExpressionHTC = 2;
pub const XrLipExpressionHTC_XR_LIP_EXPRESSION_JAW_OPEN_HTC: XrLipExpressionHTC = 3;
pub const XrLipExpressionHTC_XR_LIP_EXPRESSION_MOUTH_APE_SHAPE_HTC: XrLipExpressionHTC = 4;
pub const XrLipExpressionHTC_XR_LIP_EXPRESSION_MOUTH_UPPER_RIGHT_HTC: XrLipExpressionHTC = 5;
pub const XrLipExpressionHTC_XR_LIP_EXPRESSION_MOUTH_UPPER_LEFT_HTC: XrLipExpressionHTC = 6;
pub const XrLipExpressionHTC_XR_LIP_EXPRESSION_MOUTH_LOWER_RIGHT_HTC: XrLipExpressionHTC = 7;
pub const XrLipExpressionHTC_XR_LIP_EXPRESSION_MOUTH_LOWER_LEFT_HTC: XrLipExpressionHTC = 8;
pub const XrLipExpressionHTC_XR_LIP_EXPRESSION_MOUTH_UPPER_OVERTURN_HTC: XrLipExpressionHTC = 9;
pub const XrLipExpressionHTC_XR_LIP_EXPRESSION_MOUTH_LOWER_OVERTURN_HTC: XrLipExpressionHTC = 10;
pub const XrLipExpressionHTC_XR_LIP_EXPRESSION_MOUTH_POUT_HTC: XrLipExpressionHTC = 11;
pub const XrLipExpressionHTC_XR_LIP_EXPRESSION_MOUTH_RAISER_RIGHT_HTC: XrLipExpressionHTC = 12;
pub const XrLipExpressionHTC_XR_LIP_EXPRESSION_MOUTH_RAISER_LEFT_HTC: XrLipExpressionHTC = 13;
pub const XrLipExpressionHTC_XR_LIP_EXPRESSION_MOUTH_STRETCHER_RIGHT_HTC: XrLipExpressionHTC = 14;
pub const XrLipExpressionHTC_XR_LIP_EXPRESSION_MOUTH_STRETCHER_LEFT_HTC: XrLipExpressionHTC = 15;
pub const XrLipExpressionHTC_XR_LIP_EXPRESSION_CHEEK_PUFF_RIGHT_HTC: XrLipExpressionHTC = 16;
pub const XrLipExpressionHTC_XR_LIP_EXPRESSION_CHEEK_PUFF_LEFT_HTC: XrLipExpressionHTC = 17;
pub const XrLipExpressionHTC_XR_LIP_EXPRESSION_CHEEK_SUCK_HTC: XrLipExpressionHTC = 18;
pub const XrLipExpressionHTC_XR_LIP_EXPRESSION_MOUTH_UPPER_UPRIGHT_HTC: XrLipExpressionHTC = 19;
pub const XrLipExpressionHTC_XR_LIP_EXPRESSION_MOUTH_UPPER_UPLEFT_HTC: XrLipExpressionHTC = 20;
pub const XrLipExpressionHTC_XR_LIP_EXPRESSION_MOUTH_LOWER_DOWNRIGHT_HTC: XrLipExpressionHTC = 21;
pub const XrLipExpressionHTC_XR_LIP_EXPRESSION_MOUTH_LOWER_DOWNLEFT_HTC: XrLipExpressionHTC = 22;
pub const XrLipExpressionHTC_XR_LIP_EXPRESSION_MOUTH_UPPER_INSIDE_HTC: XrLipExpressionHTC = 23;
pub const XrLipExpressionHTC_XR_LIP_EXPRESSION_MOUTH_LOWER_INSIDE_HTC: XrLipExpressionHTC = 24;
pub const XrLipExpressionHTC_XR_LIP_EXPRESSION_MOUTH_LOWER_OVERLAY_HTC: XrLipExpressionHTC = 25;
pub const XrLipExpressionHTC_XR_LIP_EXPRESSION_TONGUE_LONGSTEP1_HTC: XrLipExpressionHTC = 26;
pub const XrLipExpressionHTC_XR_LIP_EXPRESSION_TONGUE_LEFT_HTC: XrLipExpressionHTC = 27;
pub const XrLipExpressionHTC_XR_LIP_EXPRESSION_TONGUE_RIGHT_HTC: XrLipExpressionHTC = 28;
pub const XrLipExpressionHTC_XR_LIP_EXPRESSION_TONGUE_UP_HTC: XrLipExpressionHTC = 29;
pub const XrLipExpressionHTC_XR_LIP_EXPRESSION_TONGUE_DOWN_HTC: XrLipExpressionHTC = 30;
pub const XrLipExpressionHTC_XR_LIP_EXPRESSION_TONGUE_ROLL_HTC: XrLipExpressionHTC = 31;
pub const XrLipExpressionHTC_XR_LIP_EXPRESSION_TONGUE_LONGSTEP2_HTC: XrLipExpressionHTC = 32;
pub const XrLipExpressionHTC_XR_LIP_EXPRESSION_TONGUE_UPRIGHT_MORPH_HTC: XrLipExpressionHTC = 33;
pub const XrLipExpressionHTC_XR_LIP_EXPRESSION_TONGUE_UPLEFT_MORPH_HTC: XrLipExpressionHTC = 34;
pub const XrLipExpressionHTC_XR_LIP_EXPRESSION_TONGUE_DOWNRIGHT_MORPH_HTC: XrLipExpressionHTC = 35;
pub const XrLipExpressionHTC_XR_LIP_EXPRESSION_TONGUE_DOWNLEFT_MORPH_HTC: XrLipExpressionHTC = 36;
pub const XrLipExpressionHTC_XR_LIP_EXPRESSION_MOUTH_SMILE_RIGHT_HTC: XrLipExpressionHTC = 12;
pub const XrLipExpressionHTC_XR_LIP_EXPRESSION_MOUTH_SMILE_LEFT_HTC: XrLipExpressionHTC = 13;
pub const XrLipExpressionHTC_XR_LIP_EXPRESSION_MOUTH_SAD_RIGHT_HTC: XrLipExpressionHTC = 14;
pub const XrLipExpressionHTC_XR_LIP_EXPRESSION_MOUTH_SAD_LEFT_HTC: XrLipExpressionHTC = 15;
pub const XrLipExpressionHTC_XR_LIP_EXPRESSION_MAX_ENUM_HTC: XrLipExpressionHTC = 2147483647;
pub type XrLipExpressionHTC = ::std::os::raw::c_uint;
pub const XrFacialTrackingTypeHTC_XR_FACIAL_TRACKING_TYPE_EYE_DEFAULT_HTC: XrFacialTrackingTypeHTC =
    1;
pub const XrFacialTrackingTypeHTC_XR_FACIAL_TRACKING_TYPE_LIP_DEFAULT_HTC: XrFacialTrackingTypeHTC =
    2;
pub const XrFacialTrackingTypeHTC_XR_FACIAL_TRACKING_TYPE_MAX_ENUM_HTC: XrFacialTrackingTypeHTC =
    2147483647;
pub type XrFacialTrackingTypeHTC = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSystemFacialTrackingPropertiesHTC {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub supportEyeFacialTracking: XrBool32,
    pub supportLipFacialTracking: XrBool32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSystemFacialTrackingPropertiesHTC"]
        [::std::mem::size_of::<XrSystemFacialTrackingPropertiesHTC>() - 24usize];
    ["Alignment of XrSystemFacialTrackingPropertiesHTC"]
        [::std::mem::align_of::<XrSystemFacialTrackingPropertiesHTC>() - 8usize];
    ["Offset of field: XrSystemFacialTrackingPropertiesHTC::type_"]
        [::std::mem::offset_of!(XrSystemFacialTrackingPropertiesHTC, type_) - 0usize];
    ["Offset of field: XrSystemFacialTrackingPropertiesHTC::next"]
        [::std::mem::offset_of!(XrSystemFacialTrackingPropertiesHTC, next) - 8usize];
    ["Offset of field: XrSystemFacialTrackingPropertiesHTC::supportEyeFacialTracking"][::std::mem::offset_of!(
        XrSystemFacialTrackingPropertiesHTC,
        supportEyeFacialTracking
    ) - 16usize];
    ["Offset of field: XrSystemFacialTrackingPropertiesHTC::supportLipFacialTracking"][::std::mem::offset_of!(
        XrSystemFacialTrackingPropertiesHTC,
        supportLipFacialTracking
    ) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrFacialExpressionsHTC {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub isActive: XrBool32,
    pub sampleTime: XrTime,
    pub expressionCount: u32,
    pub expressionWeightings: *mut f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrFacialExpressionsHTC"][::std::mem::size_of::<XrFacialExpressionsHTC>() - 48usize];
    ["Alignment of XrFacialExpressionsHTC"]
        [::std::mem::align_of::<XrFacialExpressionsHTC>() - 8usize];
    ["Offset of field: XrFacialExpressionsHTC::type_"]
        [::std::mem::offset_of!(XrFacialExpressionsHTC, type_) - 0usize];
    ["Offset of field: XrFacialExpressionsHTC::next"]
        [::std::mem::offset_of!(XrFacialExpressionsHTC, next) - 8usize];
    ["Offset of field: XrFacialExpressionsHTC::isActive"]
        [::std::mem::offset_of!(XrFacialExpressionsHTC, isActive) - 16usize];
    ["Offset of field: XrFacialExpressionsHTC::sampleTime"]
        [::std::mem::offset_of!(XrFacialExpressionsHTC, sampleTime) - 24usize];
    ["Offset of field: XrFacialExpressionsHTC::expressionCount"]
        [::std::mem::offset_of!(XrFacialExpressionsHTC, expressionCount) - 32usize];
    ["Offset of field: XrFacialExpressionsHTC::expressionWeightings"]
        [::std::mem::offset_of!(XrFacialExpressionsHTC, expressionWeightings) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrFacialTrackerCreateInfoHTC {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub facialTrackingType: XrFacialTrackingTypeHTC,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrFacialTrackerCreateInfoHTC"]
        [::std::mem::size_of::<XrFacialTrackerCreateInfoHTC>() - 24usize];
    ["Alignment of XrFacialTrackerCreateInfoHTC"]
        [::std::mem::align_of::<XrFacialTrackerCreateInfoHTC>() - 8usize];
    ["Offset of field: XrFacialTrackerCreateInfoHTC::type_"]
        [::std::mem::offset_of!(XrFacialTrackerCreateInfoHTC, type_) - 0usize];
    ["Offset of field: XrFacialTrackerCreateInfoHTC::next"]
        [::std::mem::offset_of!(XrFacialTrackerCreateInfoHTC, next) - 8usize];
    ["Offset of field: XrFacialTrackerCreateInfoHTC::facialTrackingType"]
        [::std::mem::offset_of!(XrFacialTrackerCreateInfoHTC, facialTrackingType) - 16usize];
};
pub const XrColorSpaceFB_XR_COLOR_SPACE_UNMANAGED_FB: XrColorSpaceFB = 0;
pub const XrColorSpaceFB_XR_COLOR_SPACE_REC2020_FB: XrColorSpaceFB = 1;
pub const XrColorSpaceFB_XR_COLOR_SPACE_REC709_FB: XrColorSpaceFB = 2;
pub const XrColorSpaceFB_XR_COLOR_SPACE_RIFT_CV1_FB: XrColorSpaceFB = 3;
pub const XrColorSpaceFB_XR_COLOR_SPACE_RIFT_S_FB: XrColorSpaceFB = 4;
pub const XrColorSpaceFB_XR_COLOR_SPACE_QUEST_FB: XrColorSpaceFB = 5;
pub const XrColorSpaceFB_XR_COLOR_SPACE_P3_FB: XrColorSpaceFB = 6;
pub const XrColorSpaceFB_XR_COLOR_SPACE_ADOBE_RGB_FB: XrColorSpaceFB = 7;
pub const XrColorSpaceFB_XR_COLOR_SPACE_MAX_ENUM_FB: XrColorSpaceFB = 2147483647;
pub type XrColorSpaceFB = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSystemColorSpacePropertiesFB {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub colorSpace: XrColorSpaceFB,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSystemColorSpacePropertiesFB"]
        [::std::mem::size_of::<XrSystemColorSpacePropertiesFB>() - 24usize];
    ["Alignment of XrSystemColorSpacePropertiesFB"]
        [::std::mem::align_of::<XrSystemColorSpacePropertiesFB>() - 8usize];
    ["Offset of field: XrSystemColorSpacePropertiesFB::type_"]
        [::std::mem::offset_of!(XrSystemColorSpacePropertiesFB, type_) - 0usize];
    ["Offset of field: XrSystemColorSpacePropertiesFB::next"]
        [::std::mem::offset_of!(XrSystemColorSpacePropertiesFB, next) - 8usize];
    ["Offset of field: XrSystemColorSpacePropertiesFB::colorSpace"]
        [::std::mem::offset_of!(XrSystemColorSpacePropertiesFB, colorSpace) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrVector4sFB {
    pub x: i16,
    pub y: i16,
    pub z: i16,
    pub w: i16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrVector4sFB"][::std::mem::size_of::<XrVector4sFB>() - 8usize];
    ["Alignment of XrVector4sFB"][::std::mem::align_of::<XrVector4sFB>() - 2usize];
    ["Offset of field: XrVector4sFB::x"][::std::mem::offset_of!(XrVector4sFB, x) - 0usize];
    ["Offset of field: XrVector4sFB::y"][::std::mem::offset_of!(XrVector4sFB, y) - 2usize];
    ["Offset of field: XrVector4sFB::z"][::std::mem::offset_of!(XrVector4sFB, z) - 4usize];
    ["Offset of field: XrVector4sFB::w"][::std::mem::offset_of!(XrVector4sFB, w) - 6usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrHandTrackingMeshFB {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub jointCapacityInput: u32,
    pub jointCountOutput: u32,
    pub jointBindPoses: *mut XrPosef,
    pub jointRadii: *mut f32,
    pub jointParents: *mut XrHandJointEXT,
    pub vertexCapacityInput: u32,
    pub vertexCountOutput: u32,
    pub vertexPositions: *mut XrVector3f,
    pub vertexNormals: *mut XrVector3f,
    pub vertexUVs: *mut XrVector2f,
    pub vertexBlendIndices: *mut XrVector4sFB,
    pub vertexBlendWeights: *mut XrVector4f,
    pub indexCapacityInput: u32,
    pub indexCountOutput: u32,
    pub indices: *mut i16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrHandTrackingMeshFB"][::std::mem::size_of::<XrHandTrackingMeshFB>() - 112usize];
    ["Alignment of XrHandTrackingMeshFB"][::std::mem::align_of::<XrHandTrackingMeshFB>() - 8usize];
    ["Offset of field: XrHandTrackingMeshFB::type_"]
        [::std::mem::offset_of!(XrHandTrackingMeshFB, type_) - 0usize];
    ["Offset of field: XrHandTrackingMeshFB::next"]
        [::std::mem::offset_of!(XrHandTrackingMeshFB, next) - 8usize];
    ["Offset of field: XrHandTrackingMeshFB::jointCapacityInput"]
        [::std::mem::offset_of!(XrHandTrackingMeshFB, jointCapacityInput) - 16usize];
    ["Offset of field: XrHandTrackingMeshFB::jointCountOutput"]
        [::std::mem::offset_of!(XrHandTrackingMeshFB, jointCountOutput) - 20usize];
    ["Offset of field: XrHandTrackingMeshFB::jointBindPoses"]
        [::std::mem::offset_of!(XrHandTrackingMeshFB, jointBindPoses) - 24usize];
    ["Offset of field: XrHandTrackingMeshFB::jointRadii"]
        [::std::mem::offset_of!(XrHandTrackingMeshFB, jointRadii) - 32usize];
    ["Offset of field: XrHandTrackingMeshFB::jointParents"]
        [::std::mem::offset_of!(XrHandTrackingMeshFB, jointParents) - 40usize];
    ["Offset of field: XrHandTrackingMeshFB::vertexCapacityInput"]
        [::std::mem::offset_of!(XrHandTrackingMeshFB, vertexCapacityInput) - 48usize];
    ["Offset of field: XrHandTrackingMeshFB::vertexCountOutput"]
        [::std::mem::offset_of!(XrHandTrackingMeshFB, vertexCountOutput) - 52usize];
    ["Offset of field: XrHandTrackingMeshFB::vertexPositions"]
        [::std::mem::offset_of!(XrHandTrackingMeshFB, vertexPositions) - 56usize];
    ["Offset of field: XrHandTrackingMeshFB::vertexNormals"]
        [::std::mem::offset_of!(XrHandTrackingMeshFB, vertexNormals) - 64usize];
    ["Offset of field: XrHandTrackingMeshFB::vertexUVs"]
        [::std::mem::offset_of!(XrHandTrackingMeshFB, vertexUVs) - 72usize];
    ["Offset of field: XrHandTrackingMeshFB::vertexBlendIndices"]
        [::std::mem::offset_of!(XrHandTrackingMeshFB, vertexBlendIndices) - 80usize];
    ["Offset of field: XrHandTrackingMeshFB::vertexBlendWeights"]
        [::std::mem::offset_of!(XrHandTrackingMeshFB, vertexBlendWeights) - 88usize];
    ["Offset of field: XrHandTrackingMeshFB::indexCapacityInput"]
        [::std::mem::offset_of!(XrHandTrackingMeshFB, indexCapacityInput) - 96usize];
    ["Offset of field: XrHandTrackingMeshFB::indexCountOutput"]
        [::std::mem::offset_of!(XrHandTrackingMeshFB, indexCountOutput) - 100usize];
    ["Offset of field: XrHandTrackingMeshFB::indices"]
        [::std::mem::offset_of!(XrHandTrackingMeshFB, indices) - 104usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrHandTrackingScaleFB {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub sensorOutput: f32,
    pub currentOutput: f32,
    pub overrideHandScale: XrBool32,
    pub overrideValueInput: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrHandTrackingScaleFB"][::std::mem::size_of::<XrHandTrackingScaleFB>() - 32usize];
    ["Alignment of XrHandTrackingScaleFB"]
        [::std::mem::align_of::<XrHandTrackingScaleFB>() - 8usize];
    ["Offset of field: XrHandTrackingScaleFB::type_"]
        [::std::mem::offset_of!(XrHandTrackingScaleFB, type_) - 0usize];
    ["Offset of field: XrHandTrackingScaleFB::next"]
        [::std::mem::offset_of!(XrHandTrackingScaleFB, next) - 8usize];
    ["Offset of field: XrHandTrackingScaleFB::sensorOutput"]
        [::std::mem::offset_of!(XrHandTrackingScaleFB, sensorOutput) - 16usize];
    ["Offset of field: XrHandTrackingScaleFB::currentOutput"]
        [::std::mem::offset_of!(XrHandTrackingScaleFB, currentOutput) - 20usize];
    ["Offset of field: XrHandTrackingScaleFB::overrideHandScale"]
        [::std::mem::offset_of!(XrHandTrackingScaleFB, overrideHandScale) - 24usize];
    ["Offset of field: XrHandTrackingScaleFB::overrideValueInput"]
        [::std::mem::offset_of!(XrHandTrackingScaleFB, overrideValueInput) - 28usize];
};
pub type XrHandTrackingAimFlagsFB = XrFlags64;
pub const XR_HAND_TRACKING_AIM_COMPUTED_BIT_FB: XrHandTrackingAimFlagsFB = 1;
pub const XR_HAND_TRACKING_AIM_VALID_BIT_FB: XrHandTrackingAimFlagsFB = 2;
pub const XR_HAND_TRACKING_AIM_INDEX_PINCHING_BIT_FB: XrHandTrackingAimFlagsFB = 4;
pub const XR_HAND_TRACKING_AIM_MIDDLE_PINCHING_BIT_FB: XrHandTrackingAimFlagsFB = 8;
pub const XR_HAND_TRACKING_AIM_RING_PINCHING_BIT_FB: XrHandTrackingAimFlagsFB = 16;
pub const XR_HAND_TRACKING_AIM_LITTLE_PINCHING_BIT_FB: XrHandTrackingAimFlagsFB = 32;
pub const XR_HAND_TRACKING_AIM_SYSTEM_GESTURE_BIT_FB: XrHandTrackingAimFlagsFB = 64;
pub const XR_HAND_TRACKING_AIM_DOMINANT_HAND_BIT_FB: XrHandTrackingAimFlagsFB = 128;
pub const XR_HAND_TRACKING_AIM_MENU_PRESSED_BIT_FB: XrHandTrackingAimFlagsFB = 256;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrHandTrackingAimStateFB {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub status: XrHandTrackingAimFlagsFB,
    pub aimPose: XrPosef,
    pub pinchStrengthIndex: f32,
    pub pinchStrengthMiddle: f32,
    pub pinchStrengthRing: f32,
    pub pinchStrengthLittle: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrHandTrackingAimStateFB"]
        [::std::mem::size_of::<XrHandTrackingAimStateFB>() - 72usize];
    ["Alignment of XrHandTrackingAimStateFB"]
        [::std::mem::align_of::<XrHandTrackingAimStateFB>() - 8usize];
    ["Offset of field: XrHandTrackingAimStateFB::type_"]
        [::std::mem::offset_of!(XrHandTrackingAimStateFB, type_) - 0usize];
    ["Offset of field: XrHandTrackingAimStateFB::next"]
        [::std::mem::offset_of!(XrHandTrackingAimStateFB, next) - 8usize];
    ["Offset of field: XrHandTrackingAimStateFB::status"]
        [::std::mem::offset_of!(XrHandTrackingAimStateFB, status) - 16usize];
    ["Offset of field: XrHandTrackingAimStateFB::aimPose"]
        [::std::mem::offset_of!(XrHandTrackingAimStateFB, aimPose) - 24usize];
    ["Offset of field: XrHandTrackingAimStateFB::pinchStrengthIndex"]
        [::std::mem::offset_of!(XrHandTrackingAimStateFB, pinchStrengthIndex) - 52usize];
    ["Offset of field: XrHandTrackingAimStateFB::pinchStrengthMiddle"]
        [::std::mem::offset_of!(XrHandTrackingAimStateFB, pinchStrengthMiddle) - 56usize];
    ["Offset of field: XrHandTrackingAimStateFB::pinchStrengthRing"]
        [::std::mem::offset_of!(XrHandTrackingAimStateFB, pinchStrengthRing) - 60usize];
    ["Offset of field: XrHandTrackingAimStateFB::pinchStrengthLittle"]
        [::std::mem::offset_of!(XrHandTrackingAimStateFB, pinchStrengthLittle) - 64usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrHandCapsuleFB {
    pub points: [XrVector3f; 2usize],
    pub radius: f32,
    pub joint: XrHandJointEXT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrHandCapsuleFB"][::std::mem::size_of::<XrHandCapsuleFB>() - 32usize];
    ["Alignment of XrHandCapsuleFB"][::std::mem::align_of::<XrHandCapsuleFB>() - 4usize];
    ["Offset of field: XrHandCapsuleFB::points"]
        [::std::mem::offset_of!(XrHandCapsuleFB, points) - 0usize];
    ["Offset of field: XrHandCapsuleFB::radius"]
        [::std::mem::offset_of!(XrHandCapsuleFB, radius) - 24usize];
    ["Offset of field: XrHandCapsuleFB::joint"]
        [::std::mem::offset_of!(XrHandCapsuleFB, joint) - 28usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrHandTrackingCapsulesStateFB {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub capsules: [XrHandCapsuleFB; 19usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrHandTrackingCapsulesStateFB"]
        [::std::mem::size_of::<XrHandTrackingCapsulesStateFB>() - 624usize];
    ["Alignment of XrHandTrackingCapsulesStateFB"]
        [::std::mem::align_of::<XrHandTrackingCapsulesStateFB>() - 8usize];
    ["Offset of field: XrHandTrackingCapsulesStateFB::type_"]
        [::std::mem::offset_of!(XrHandTrackingCapsulesStateFB, type_) - 0usize];
    ["Offset of field: XrHandTrackingCapsulesStateFB::next"]
        [::std::mem::offset_of!(XrHandTrackingCapsulesStateFB, next) - 8usize];
    ["Offset of field: XrHandTrackingCapsulesStateFB::capsules"]
        [::std::mem::offset_of!(XrHandTrackingCapsulesStateFB, capsules) - 16usize];
};
pub type XrAsyncRequestIdFB = u64;
pub const XrSpaceComponentTypeFB_XR_SPACE_COMPONENT_TYPE_LOCATABLE_FB: XrSpaceComponentTypeFB = 0;
pub const XrSpaceComponentTypeFB_XR_SPACE_COMPONENT_TYPE_STORABLE_FB: XrSpaceComponentTypeFB = 1;
pub const XrSpaceComponentTypeFB_XR_SPACE_COMPONENT_TYPE_SHARABLE_FB: XrSpaceComponentTypeFB = 2;
pub const XrSpaceComponentTypeFB_XR_SPACE_COMPONENT_TYPE_BOUNDED_2D_FB: XrSpaceComponentTypeFB = 3;
pub const XrSpaceComponentTypeFB_XR_SPACE_COMPONENT_TYPE_BOUNDED_3D_FB: XrSpaceComponentTypeFB = 4;
pub const XrSpaceComponentTypeFB_XR_SPACE_COMPONENT_TYPE_SEMANTIC_LABELS_FB:
    XrSpaceComponentTypeFB = 5;
pub const XrSpaceComponentTypeFB_XR_SPACE_COMPONENT_TYPE_ROOM_LAYOUT_FB: XrSpaceComponentTypeFB = 6;
pub const XrSpaceComponentTypeFB_XR_SPACE_COMPONENT_TYPE_SPACE_CONTAINER_FB:
    XrSpaceComponentTypeFB = 7;
pub const XrSpaceComponentTypeFB_XR_SPACE_COMPONENT_TYPE_TRIANGLE_MESH_META:
    XrSpaceComponentTypeFB = 1000269000;
pub const XrSpaceComponentTypeFB_XR_SPACE_COMPONENT_TYPE_MAX_ENUM_FB: XrSpaceComponentTypeFB =
    2147483647;
pub type XrSpaceComponentTypeFB = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSystemSpatialEntityPropertiesFB {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub supportsSpatialEntity: XrBool32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSystemSpatialEntityPropertiesFB"]
        [::std::mem::size_of::<XrSystemSpatialEntityPropertiesFB>() - 24usize];
    ["Alignment of XrSystemSpatialEntityPropertiesFB"]
        [::std::mem::align_of::<XrSystemSpatialEntityPropertiesFB>() - 8usize];
    ["Offset of field: XrSystemSpatialEntityPropertiesFB::type_"]
        [::std::mem::offset_of!(XrSystemSpatialEntityPropertiesFB, type_) - 0usize];
    ["Offset of field: XrSystemSpatialEntityPropertiesFB::next"]
        [::std::mem::offset_of!(XrSystemSpatialEntityPropertiesFB, next) - 8usize];
    ["Offset of field: XrSystemSpatialEntityPropertiesFB::supportsSpatialEntity"][::std::mem::offset_of!(
        XrSystemSpatialEntityPropertiesFB,
        supportsSpatialEntity
    ) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSpatialAnchorCreateInfoFB {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub space: XrSpace,
    pub poseInSpace: XrPosef,
    pub time: XrTime,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSpatialAnchorCreateInfoFB"]
        [::std::mem::size_of::<XrSpatialAnchorCreateInfoFB>() - 64usize];
    ["Alignment of XrSpatialAnchorCreateInfoFB"]
        [::std::mem::align_of::<XrSpatialAnchorCreateInfoFB>() - 8usize];
    ["Offset of field: XrSpatialAnchorCreateInfoFB::type_"]
        [::std::mem::offset_of!(XrSpatialAnchorCreateInfoFB, type_) - 0usize];
    ["Offset of field: XrSpatialAnchorCreateInfoFB::next"]
        [::std::mem::offset_of!(XrSpatialAnchorCreateInfoFB, next) - 8usize];
    ["Offset of field: XrSpatialAnchorCreateInfoFB::space"]
        [::std::mem::offset_of!(XrSpatialAnchorCreateInfoFB, space) - 16usize];
    ["Offset of field: XrSpatialAnchorCreateInfoFB::poseInSpace"]
        [::std::mem::offset_of!(XrSpatialAnchorCreateInfoFB, poseInSpace) - 24usize];
    ["Offset of field: XrSpatialAnchorCreateInfoFB::time"]
        [::std::mem::offset_of!(XrSpatialAnchorCreateInfoFB, time) - 56usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSpaceComponentStatusSetInfoFB {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub componentType: XrSpaceComponentTypeFB,
    pub enabled: XrBool32,
    pub timeout: XrDuration,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSpaceComponentStatusSetInfoFB"]
        [::std::mem::size_of::<XrSpaceComponentStatusSetInfoFB>() - 32usize];
    ["Alignment of XrSpaceComponentStatusSetInfoFB"]
        [::std::mem::align_of::<XrSpaceComponentStatusSetInfoFB>() - 8usize];
    ["Offset of field: XrSpaceComponentStatusSetInfoFB::type_"]
        [::std::mem::offset_of!(XrSpaceComponentStatusSetInfoFB, type_) - 0usize];
    ["Offset of field: XrSpaceComponentStatusSetInfoFB::next"]
        [::std::mem::offset_of!(XrSpaceComponentStatusSetInfoFB, next) - 8usize];
    ["Offset of field: XrSpaceComponentStatusSetInfoFB::componentType"]
        [::std::mem::offset_of!(XrSpaceComponentStatusSetInfoFB, componentType) - 16usize];
    ["Offset of field: XrSpaceComponentStatusSetInfoFB::enabled"]
        [::std::mem::offset_of!(XrSpaceComponentStatusSetInfoFB, enabled) - 20usize];
    ["Offset of field: XrSpaceComponentStatusSetInfoFB::timeout"]
        [::std::mem::offset_of!(XrSpaceComponentStatusSetInfoFB, timeout) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSpaceComponentStatusFB {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub enabled: XrBool32,
    pub changePending: XrBool32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSpaceComponentStatusFB"]
        [::std::mem::size_of::<XrSpaceComponentStatusFB>() - 24usize];
    ["Alignment of XrSpaceComponentStatusFB"]
        [::std::mem::align_of::<XrSpaceComponentStatusFB>() - 8usize];
    ["Offset of field: XrSpaceComponentStatusFB::type_"]
        [::std::mem::offset_of!(XrSpaceComponentStatusFB, type_) - 0usize];
    ["Offset of field: XrSpaceComponentStatusFB::next"]
        [::std::mem::offset_of!(XrSpaceComponentStatusFB, next) - 8usize];
    ["Offset of field: XrSpaceComponentStatusFB::enabled"]
        [::std::mem::offset_of!(XrSpaceComponentStatusFB, enabled) - 16usize];
    ["Offset of field: XrSpaceComponentStatusFB::changePending"]
        [::std::mem::offset_of!(XrSpaceComponentStatusFB, changePending) - 20usize];
};
pub type XrUuidEXT = XrUuid;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrEventDataSpatialAnchorCreateCompleteFB {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub requestId: XrAsyncRequestIdFB,
    pub result: XrResult,
    pub space: XrSpace,
    pub uuid: XrUuidEXT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrEventDataSpatialAnchorCreateCompleteFB"]
        [::std::mem::size_of::<XrEventDataSpatialAnchorCreateCompleteFB>() - 56usize];
    ["Alignment of XrEventDataSpatialAnchorCreateCompleteFB"]
        [::std::mem::align_of::<XrEventDataSpatialAnchorCreateCompleteFB>() - 8usize];
    ["Offset of field: XrEventDataSpatialAnchorCreateCompleteFB::type_"]
        [::std::mem::offset_of!(XrEventDataSpatialAnchorCreateCompleteFB, type_) - 0usize];
    ["Offset of field: XrEventDataSpatialAnchorCreateCompleteFB::next"]
        [::std::mem::offset_of!(XrEventDataSpatialAnchorCreateCompleteFB, next) - 8usize];
    ["Offset of field: XrEventDataSpatialAnchorCreateCompleteFB::requestId"]
        [::std::mem::offset_of!(XrEventDataSpatialAnchorCreateCompleteFB, requestId) - 16usize];
    ["Offset of field: XrEventDataSpatialAnchorCreateCompleteFB::result"]
        [::std::mem::offset_of!(XrEventDataSpatialAnchorCreateCompleteFB, result) - 24usize];
    ["Offset of field: XrEventDataSpatialAnchorCreateCompleteFB::space"]
        [::std::mem::offset_of!(XrEventDataSpatialAnchorCreateCompleteFB, space) - 32usize];
    ["Offset of field: XrEventDataSpatialAnchorCreateCompleteFB::uuid"]
        [::std::mem::offset_of!(XrEventDataSpatialAnchorCreateCompleteFB, uuid) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrEventDataSpaceSetStatusCompleteFB {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub requestId: XrAsyncRequestIdFB,
    pub result: XrResult,
    pub space: XrSpace,
    pub uuid: XrUuidEXT,
    pub componentType: XrSpaceComponentTypeFB,
    pub enabled: XrBool32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrEventDataSpaceSetStatusCompleteFB"]
        [::std::mem::size_of::<XrEventDataSpaceSetStatusCompleteFB>() - 64usize];
    ["Alignment of XrEventDataSpaceSetStatusCompleteFB"]
        [::std::mem::align_of::<XrEventDataSpaceSetStatusCompleteFB>() - 8usize];
    ["Offset of field: XrEventDataSpaceSetStatusCompleteFB::type_"]
        [::std::mem::offset_of!(XrEventDataSpaceSetStatusCompleteFB, type_) - 0usize];
    ["Offset of field: XrEventDataSpaceSetStatusCompleteFB::next"]
        [::std::mem::offset_of!(XrEventDataSpaceSetStatusCompleteFB, next) - 8usize];
    ["Offset of field: XrEventDataSpaceSetStatusCompleteFB::requestId"]
        [::std::mem::offset_of!(XrEventDataSpaceSetStatusCompleteFB, requestId) - 16usize];
    ["Offset of field: XrEventDataSpaceSetStatusCompleteFB::result"]
        [::std::mem::offset_of!(XrEventDataSpaceSetStatusCompleteFB, result) - 24usize];
    ["Offset of field: XrEventDataSpaceSetStatusCompleteFB::space"]
        [::std::mem::offset_of!(XrEventDataSpaceSetStatusCompleteFB, space) - 32usize];
    ["Offset of field: XrEventDataSpaceSetStatusCompleteFB::uuid"]
        [::std::mem::offset_of!(XrEventDataSpaceSetStatusCompleteFB, uuid) - 40usize];
    ["Offset of field: XrEventDataSpaceSetStatusCompleteFB::componentType"]
        [::std::mem::offset_of!(XrEventDataSpaceSetStatusCompleteFB, componentType) - 56usize];
    ["Offset of field: XrEventDataSpaceSetStatusCompleteFB::enabled"]
        [::std::mem::offset_of!(XrEventDataSpaceSetStatusCompleteFB, enabled) - 60usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrFoveationProfileFB_T {
    _unused: [u8; 0],
}
pub type XrFoveationProfileFB = *mut XrFoveationProfileFB_T;
pub type XrSwapchainCreateFoveationFlagsFB = XrFlags64;
pub const XR_SWAPCHAIN_CREATE_FOVEATION_SCALED_BIN_BIT_FB: XrSwapchainCreateFoveationFlagsFB = 1;
pub const XR_SWAPCHAIN_CREATE_FOVEATION_FRAGMENT_DENSITY_MAP_BIT_FB:
    XrSwapchainCreateFoveationFlagsFB = 2;
pub type XrSwapchainStateFoveationFlagsFB = XrFlags64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrFoveationProfileCreateInfoFB {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrFoveationProfileCreateInfoFB"]
        [::std::mem::size_of::<XrFoveationProfileCreateInfoFB>() - 16usize];
    ["Alignment of XrFoveationProfileCreateInfoFB"]
        [::std::mem::align_of::<XrFoveationProfileCreateInfoFB>() - 8usize];
    ["Offset of field: XrFoveationProfileCreateInfoFB::type_"]
        [::std::mem::offset_of!(XrFoveationProfileCreateInfoFB, type_) - 0usize];
    ["Offset of field: XrFoveationProfileCreateInfoFB::next"]
        [::std::mem::offset_of!(XrFoveationProfileCreateInfoFB, next) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSwapchainCreateInfoFoveationFB {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub flags: XrSwapchainCreateFoveationFlagsFB,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSwapchainCreateInfoFoveationFB"]
        [::std::mem::size_of::<XrSwapchainCreateInfoFoveationFB>() - 24usize];
    ["Alignment of XrSwapchainCreateInfoFoveationFB"]
        [::std::mem::align_of::<XrSwapchainCreateInfoFoveationFB>() - 8usize];
    ["Offset of field: XrSwapchainCreateInfoFoveationFB::type_"]
        [::std::mem::offset_of!(XrSwapchainCreateInfoFoveationFB, type_) - 0usize];
    ["Offset of field: XrSwapchainCreateInfoFoveationFB::next"]
        [::std::mem::offset_of!(XrSwapchainCreateInfoFoveationFB, next) - 8usize];
    ["Offset of field: XrSwapchainCreateInfoFoveationFB::flags"]
        [::std::mem::offset_of!(XrSwapchainCreateInfoFoveationFB, flags) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSwapchainStateFoveationFB {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub flags: XrSwapchainStateFoveationFlagsFB,
    pub profile: XrFoveationProfileFB,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSwapchainStateFoveationFB"]
        [::std::mem::size_of::<XrSwapchainStateFoveationFB>() - 32usize];
    ["Alignment of XrSwapchainStateFoveationFB"]
        [::std::mem::align_of::<XrSwapchainStateFoveationFB>() - 8usize];
    ["Offset of field: XrSwapchainStateFoveationFB::type_"]
        [::std::mem::offset_of!(XrSwapchainStateFoveationFB, type_) - 0usize];
    ["Offset of field: XrSwapchainStateFoveationFB::next"]
        [::std::mem::offset_of!(XrSwapchainStateFoveationFB, next) - 8usize];
    ["Offset of field: XrSwapchainStateFoveationFB::flags"]
        [::std::mem::offset_of!(XrSwapchainStateFoveationFB, flags) - 16usize];
    ["Offset of field: XrSwapchainStateFoveationFB::profile"]
        [::std::mem::offset_of!(XrSwapchainStateFoveationFB, profile) - 24usize];
};
pub const XrFoveationLevelFB_XR_FOVEATION_LEVEL_NONE_FB: XrFoveationLevelFB = 0;
pub const XrFoveationLevelFB_XR_FOVEATION_LEVEL_LOW_FB: XrFoveationLevelFB = 1;
pub const XrFoveationLevelFB_XR_FOVEATION_LEVEL_MEDIUM_FB: XrFoveationLevelFB = 2;
pub const XrFoveationLevelFB_XR_FOVEATION_LEVEL_HIGH_FB: XrFoveationLevelFB = 3;
pub const XrFoveationLevelFB_XR_FOVEATION_LEVEL_MAX_ENUM_FB: XrFoveationLevelFB = 2147483647;
pub type XrFoveationLevelFB = ::std::os::raw::c_uint;
pub const XrFoveationDynamicFB_XR_FOVEATION_DYNAMIC_DISABLED_FB: XrFoveationDynamicFB = 0;
pub const XrFoveationDynamicFB_XR_FOVEATION_DYNAMIC_LEVEL_ENABLED_FB: XrFoveationDynamicFB = 1;
pub const XrFoveationDynamicFB_XR_FOVEATION_DYNAMIC_MAX_ENUM_FB: XrFoveationDynamicFB = 2147483647;
pub type XrFoveationDynamicFB = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrFoveationLevelProfileCreateInfoFB {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub level: XrFoveationLevelFB,
    pub verticalOffset: f32,
    pub dynamic: XrFoveationDynamicFB,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrFoveationLevelProfileCreateInfoFB"]
        [::std::mem::size_of::<XrFoveationLevelProfileCreateInfoFB>() - 32usize];
    ["Alignment of XrFoveationLevelProfileCreateInfoFB"]
        [::std::mem::align_of::<XrFoveationLevelProfileCreateInfoFB>() - 8usize];
    ["Offset of field: XrFoveationLevelProfileCreateInfoFB::type_"]
        [::std::mem::offset_of!(XrFoveationLevelProfileCreateInfoFB, type_) - 0usize];
    ["Offset of field: XrFoveationLevelProfileCreateInfoFB::next"]
        [::std::mem::offset_of!(XrFoveationLevelProfileCreateInfoFB, next) - 8usize];
    ["Offset of field: XrFoveationLevelProfileCreateInfoFB::level"]
        [::std::mem::offset_of!(XrFoveationLevelProfileCreateInfoFB, level) - 16usize];
    ["Offset of field: XrFoveationLevelProfileCreateInfoFB::verticalOffset"]
        [::std::mem::offset_of!(XrFoveationLevelProfileCreateInfoFB, verticalOffset) - 20usize];
    ["Offset of field: XrFoveationLevelProfileCreateInfoFB::dynamic"]
        [::std::mem::offset_of!(XrFoveationLevelProfileCreateInfoFB, dynamic) - 24usize];
};
pub type XrKeyboardTrackingFlagsFB = XrFlags64;
pub const XR_KEYBOARD_TRACKING_EXISTS_BIT_FB: XrKeyboardTrackingFlagsFB = 1;
pub const XR_KEYBOARD_TRACKING_LOCAL_BIT_FB: XrKeyboardTrackingFlagsFB = 2;
pub const XR_KEYBOARD_TRACKING_REMOTE_BIT_FB: XrKeyboardTrackingFlagsFB = 4;
pub const XR_KEYBOARD_TRACKING_CONNECTED_BIT_FB: XrKeyboardTrackingFlagsFB = 8;
pub type XrKeyboardTrackingQueryFlagsFB = XrFlags64;
pub const XR_KEYBOARD_TRACKING_QUERY_LOCAL_BIT_FB: XrKeyboardTrackingQueryFlagsFB = 2;
pub const XR_KEYBOARD_TRACKING_QUERY_REMOTE_BIT_FB: XrKeyboardTrackingQueryFlagsFB = 4;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSystemKeyboardTrackingPropertiesFB {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub supportsKeyboardTracking: XrBool32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSystemKeyboardTrackingPropertiesFB"]
        [::std::mem::size_of::<XrSystemKeyboardTrackingPropertiesFB>() - 24usize];
    ["Alignment of XrSystemKeyboardTrackingPropertiesFB"]
        [::std::mem::align_of::<XrSystemKeyboardTrackingPropertiesFB>() - 8usize];
    ["Offset of field: XrSystemKeyboardTrackingPropertiesFB::type_"]
        [::std::mem::offset_of!(XrSystemKeyboardTrackingPropertiesFB, type_) - 0usize];
    ["Offset of field: XrSystemKeyboardTrackingPropertiesFB::next"]
        [::std::mem::offset_of!(XrSystemKeyboardTrackingPropertiesFB, next) - 8usize];
    ["Offset of field: XrSystemKeyboardTrackingPropertiesFB::supportsKeyboardTracking"][::std::mem::offset_of!(
        XrSystemKeyboardTrackingPropertiesFB,
        supportsKeyboardTracking
    )
        - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrKeyboardTrackingDescriptionFB {
    pub trackedKeyboardId: u64,
    pub size: XrVector3f,
    pub flags: XrKeyboardTrackingFlagsFB,
    pub name: [::std::os::raw::c_char; 128usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrKeyboardTrackingDescriptionFB"]
        [::std::mem::size_of::<XrKeyboardTrackingDescriptionFB>() - 160usize];
    ["Alignment of XrKeyboardTrackingDescriptionFB"]
        [::std::mem::align_of::<XrKeyboardTrackingDescriptionFB>() - 8usize];
    ["Offset of field: XrKeyboardTrackingDescriptionFB::trackedKeyboardId"]
        [::std::mem::offset_of!(XrKeyboardTrackingDescriptionFB, trackedKeyboardId) - 0usize];
    ["Offset of field: XrKeyboardTrackingDescriptionFB::size"]
        [::std::mem::offset_of!(XrKeyboardTrackingDescriptionFB, size) - 8usize];
    ["Offset of field: XrKeyboardTrackingDescriptionFB::flags"]
        [::std::mem::offset_of!(XrKeyboardTrackingDescriptionFB, flags) - 24usize];
    ["Offset of field: XrKeyboardTrackingDescriptionFB::name"]
        [::std::mem::offset_of!(XrKeyboardTrackingDescriptionFB, name) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrKeyboardSpaceCreateInfoFB {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub trackedKeyboardId: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrKeyboardSpaceCreateInfoFB"]
        [::std::mem::size_of::<XrKeyboardSpaceCreateInfoFB>() - 24usize];
    ["Alignment of XrKeyboardSpaceCreateInfoFB"]
        [::std::mem::align_of::<XrKeyboardSpaceCreateInfoFB>() - 8usize];
    ["Offset of field: XrKeyboardSpaceCreateInfoFB::type_"]
        [::std::mem::offset_of!(XrKeyboardSpaceCreateInfoFB, type_) - 0usize];
    ["Offset of field: XrKeyboardSpaceCreateInfoFB::next"]
        [::std::mem::offset_of!(XrKeyboardSpaceCreateInfoFB, next) - 8usize];
    ["Offset of field: XrKeyboardSpaceCreateInfoFB::trackedKeyboardId"]
        [::std::mem::offset_of!(XrKeyboardSpaceCreateInfoFB, trackedKeyboardId) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrKeyboardTrackingQueryFB {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub flags: XrKeyboardTrackingQueryFlagsFB,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrKeyboardTrackingQueryFB"]
        [::std::mem::size_of::<XrKeyboardTrackingQueryFB>() - 24usize];
    ["Alignment of XrKeyboardTrackingQueryFB"]
        [::std::mem::align_of::<XrKeyboardTrackingQueryFB>() - 8usize];
    ["Offset of field: XrKeyboardTrackingQueryFB::type_"]
        [::std::mem::offset_of!(XrKeyboardTrackingQueryFB, type_) - 0usize];
    ["Offset of field: XrKeyboardTrackingQueryFB::next"]
        [::std::mem::offset_of!(XrKeyboardTrackingQueryFB, next) - 8usize];
    ["Offset of field: XrKeyboardTrackingQueryFB::flags"]
        [::std::mem::offset_of!(XrKeyboardTrackingQueryFB, flags) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrTriangleMeshFB_T {
    _unused: [u8; 0],
}
pub type XrTriangleMeshFB = *mut XrTriangleMeshFB_T;
pub const XrWindingOrderFB_XR_WINDING_ORDER_UNKNOWN_FB: XrWindingOrderFB = 0;
pub const XrWindingOrderFB_XR_WINDING_ORDER_CW_FB: XrWindingOrderFB = 1;
pub const XrWindingOrderFB_XR_WINDING_ORDER_CCW_FB: XrWindingOrderFB = 2;
pub const XrWindingOrderFB_XR_WINDING_ORDER_MAX_ENUM_FB: XrWindingOrderFB = 2147483647;
pub type XrWindingOrderFB = ::std::os::raw::c_uint;
pub type XrTriangleMeshFlagsFB = XrFlags64;
pub const XR_TRIANGLE_MESH_MUTABLE_BIT_FB: XrTriangleMeshFlagsFB = 1;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrTriangleMeshCreateInfoFB {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub flags: XrTriangleMeshFlagsFB,
    pub windingOrder: XrWindingOrderFB,
    pub vertexCount: u32,
    pub vertexBuffer: *const XrVector3f,
    pub triangleCount: u32,
    pub indexBuffer: *const u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrTriangleMeshCreateInfoFB"]
        [::std::mem::size_of::<XrTriangleMeshCreateInfoFB>() - 56usize];
    ["Alignment of XrTriangleMeshCreateInfoFB"]
        [::std::mem::align_of::<XrTriangleMeshCreateInfoFB>() - 8usize];
    ["Offset of field: XrTriangleMeshCreateInfoFB::type_"]
        [::std::mem::offset_of!(XrTriangleMeshCreateInfoFB, type_) - 0usize];
    ["Offset of field: XrTriangleMeshCreateInfoFB::next"]
        [::std::mem::offset_of!(XrTriangleMeshCreateInfoFB, next) - 8usize];
    ["Offset of field: XrTriangleMeshCreateInfoFB::flags"]
        [::std::mem::offset_of!(XrTriangleMeshCreateInfoFB, flags) - 16usize];
    ["Offset of field: XrTriangleMeshCreateInfoFB::windingOrder"]
        [::std::mem::offset_of!(XrTriangleMeshCreateInfoFB, windingOrder) - 24usize];
    ["Offset of field: XrTriangleMeshCreateInfoFB::vertexCount"]
        [::std::mem::offset_of!(XrTriangleMeshCreateInfoFB, vertexCount) - 28usize];
    ["Offset of field: XrTriangleMeshCreateInfoFB::vertexBuffer"]
        [::std::mem::offset_of!(XrTriangleMeshCreateInfoFB, vertexBuffer) - 32usize];
    ["Offset of field: XrTriangleMeshCreateInfoFB::triangleCount"]
        [::std::mem::offset_of!(XrTriangleMeshCreateInfoFB, triangleCount) - 40usize];
    ["Offset of field: XrTriangleMeshCreateInfoFB::indexBuffer"]
        [::std::mem::offset_of!(XrTriangleMeshCreateInfoFB, indexBuffer) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrPassthroughFB_T {
    _unused: [u8; 0],
}
pub type XrPassthroughFB = *mut XrPassthroughFB_T;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrPassthroughLayerFB_T {
    _unused: [u8; 0],
}
pub type XrPassthroughLayerFB = *mut XrPassthroughLayerFB_T;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrGeometryInstanceFB_T {
    _unused: [u8; 0],
}
pub type XrGeometryInstanceFB = *mut XrGeometryInstanceFB_T;
pub const XrPassthroughLayerPurposeFB_XR_PASSTHROUGH_LAYER_PURPOSE_RECONSTRUCTION_FB:
    XrPassthroughLayerPurposeFB = 0;
pub const XrPassthroughLayerPurposeFB_XR_PASSTHROUGH_LAYER_PURPOSE_PROJECTED_FB:
    XrPassthroughLayerPurposeFB = 1;
pub const XrPassthroughLayerPurposeFB_XR_PASSTHROUGH_LAYER_PURPOSE_TRACKED_KEYBOARD_HANDS_FB:
    XrPassthroughLayerPurposeFB = 1000203001;
pub const XrPassthroughLayerPurposeFB_XR_PASSTHROUGH_LAYER_PURPOSE_TRACKED_KEYBOARD_MASKED_HANDS_FB : XrPassthroughLayerPurposeFB = 1000203002 ;
pub const XrPassthroughLayerPurposeFB_XR_PASSTHROUGH_LAYER_PURPOSE_MAX_ENUM_FB:
    XrPassthroughLayerPurposeFB = 2147483647;
pub type XrPassthroughLayerPurposeFB = ::std::os::raw::c_uint;
pub type XrPassthroughCapabilityFlagsFB = XrFlags64;
pub const XR_PASSTHROUGH_CAPABILITY_BIT_FB: XrPassthroughCapabilityFlagsFB = 1;
pub const XR_PASSTHROUGH_CAPABILITY_COLOR_BIT_FB: XrPassthroughCapabilityFlagsFB = 2;
pub const XR_PASSTHROUGH_CAPABILITY_LAYER_DEPTH_BIT_FB: XrPassthroughCapabilityFlagsFB = 4;
pub type XrPassthroughFlagsFB = XrFlags64;
pub const XR_PASSTHROUGH_IS_RUNNING_AT_CREATION_BIT_FB: XrPassthroughFlagsFB = 1;
pub const XR_PASSTHROUGH_LAYER_DEPTH_BIT_FB: XrPassthroughFlagsFB = 2;
pub type XrPassthroughStateChangedFlagsFB = XrFlags64;
pub const XR_PASSTHROUGH_STATE_CHANGED_REINIT_REQUIRED_BIT_FB: XrPassthroughStateChangedFlagsFB = 1;
pub const XR_PASSTHROUGH_STATE_CHANGED_NON_RECOVERABLE_ERROR_BIT_FB:
    XrPassthroughStateChangedFlagsFB = 2;
pub const XR_PASSTHROUGH_STATE_CHANGED_RECOVERABLE_ERROR_BIT_FB: XrPassthroughStateChangedFlagsFB =
    4;
pub const XR_PASSTHROUGH_STATE_CHANGED_RESTORED_ERROR_BIT_FB: XrPassthroughStateChangedFlagsFB = 8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSystemPassthroughPropertiesFB {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub supportsPassthrough: XrBool32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSystemPassthroughPropertiesFB"]
        [::std::mem::size_of::<XrSystemPassthroughPropertiesFB>() - 24usize];
    ["Alignment of XrSystemPassthroughPropertiesFB"]
        [::std::mem::align_of::<XrSystemPassthroughPropertiesFB>() - 8usize];
    ["Offset of field: XrSystemPassthroughPropertiesFB::type_"]
        [::std::mem::offset_of!(XrSystemPassthroughPropertiesFB, type_) - 0usize];
    ["Offset of field: XrSystemPassthroughPropertiesFB::next"]
        [::std::mem::offset_of!(XrSystemPassthroughPropertiesFB, next) - 8usize];
    ["Offset of field: XrSystemPassthroughPropertiesFB::supportsPassthrough"]
        [::std::mem::offset_of!(XrSystemPassthroughPropertiesFB, supportsPassthrough) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSystemPassthroughProperties2FB {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub capabilities: XrPassthroughCapabilityFlagsFB,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrSystemPassthroughProperties2FB"]
        [::std::mem::size_of::<XrSystemPassthroughProperties2FB>() - 24usize];
    ["Alignment of XrSystemPassthroughProperties2FB"]
        [::std::mem::align_of::<XrSystemPassthroughProperties2FB>() - 8usize];
    ["Offset of field: XrSystemPassthroughProperties2FB::type_"]
        [::std::mem::offset_of!(XrSystemPassthroughProperties2FB, type_) - 0usize];
    ["Offset of field: XrSystemPassthroughProperties2FB::next"]
        [::std::mem::offset_of!(XrSystemPassthroughProperties2FB, next) - 8usize];
    ["Offset of field: XrSystemPassthroughProperties2FB::capabilities"]
        [::std::mem::offset_of!(XrSystemPassthroughProperties2FB, capabilities) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrPassthroughCreateInfoFB {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub flags: XrPassthroughFlagsFB,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrPassthroughCreateInfoFB"]
        [::std::mem::size_of::<XrPassthroughCreateInfoFB>() - 24usize];
    ["Alignment of XrPassthroughCreateInfoFB"]
        [::std::mem::align_of::<XrPassthroughCreateInfoFB>() - 8usize];
    ["Offset of field: XrPassthroughCreateInfoFB::type_"]
        [::std::mem::offset_of!(XrPassthroughCreateInfoFB, type_) - 0usize];
    ["Offset of field: XrPassthroughCreateInfoFB::next"]
        [::std::mem::offset_of!(XrPassthroughCreateInfoFB, next) - 8usize];
    ["Offset of field: XrPassthroughCreateInfoFB::flags"]
        [::std::mem::offset_of!(XrPassthroughCreateInfoFB, flags) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrPassthroughLayerCreateInfoFB {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub passthrough: XrPassthroughFB,
    pub flags: XrPassthroughFlagsFB,
    pub purpose: XrPassthroughLayerPurposeFB,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrPassthroughLayerCreateInfoFB"]
        [::std::mem::size_of::<XrPassthroughLayerCreateInfoFB>() - 40usize];
    ["Alignment of XrPassthroughLayerCreateInfoFB"]
        [::std::mem::align_of::<XrPassthroughLayerCreateInfoFB>() - 8usize];
    ["Offset of field: XrPassthroughLayerCreateInfoFB::type_"]
        [::std::mem::offset_of!(XrPassthroughLayerCreateInfoFB, type_) - 0usize];
    ["Offset of field: XrPassthroughLayerCreateInfoFB::next"]
        [::std::mem::offset_of!(XrPassthroughLayerCreateInfoFB, next) - 8usize];
    ["Offset of field: XrPassthroughLayerCreateInfoFB::passthrough"]
        [::std::mem::offset_of!(XrPassthroughLayerCreateInfoFB, passthrough) - 16usize];
    ["Offset of field: XrPassthroughLayerCreateInfoFB::flags"]
        [::std::mem::offset_of!(XrPassthroughLayerCreateInfoFB, flags) - 24usize];
    ["Offset of field: XrPassthroughLayerCreateInfoFB::purpose"]
        [::std::mem::offset_of!(XrPassthroughLayerCreateInfoFB, purpose) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrCompositionLayerPassthroughFB {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub flags: XrCompositionLayerFlags,
    pub space: XrSpace,
    pub layerHandle: XrPassthroughLayerFB,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrCompositionLayerPassthroughFB"]
        [::std::mem::size_of::<XrCompositionLayerPassthroughFB>() - 40usize];
    ["Alignment of XrCompositionLayerPassthroughFB"]
        [::std::mem::align_of::<XrCompositionLayerPassthroughFB>() - 8usize];
    ["Offset of field: XrCompositionLayerPassthroughFB::type_"]
        [::std::mem::offset_of!(XrCompositionLayerPassthroughFB, type_) - 0usize];
    ["Offset of field: XrCompositionLayerPassthroughFB::next"]
        [::std::mem::offset_of!(XrCompositionLayerPassthroughFB, next) - 8usize];
    ["Offset of field: XrCompositionLayerPassthroughFB::flags"]
        [::std::mem::offset_of!(XrCompositionLayerPassthroughFB, flags) - 16usize];
    ["Offset of field: XrCompositionLayerPassthroughFB::space"]
        [::std::mem::offset_of!(XrCompositionLayerPassthroughFB, space) - 24usize];
    ["Offset of field: XrCompositionLayerPassthroughFB::layerHandle"]
        [::std::mem::offset_of!(XrCompositionLayerPassthroughFB, layerHandle) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrGeometryInstanceCreateInfoFB {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub layer: XrPassthroughLayerFB,
    pub mesh: XrTriangleMeshFB,
    pub baseSpace: XrSpace,
    pub pose: XrPosef,
    pub scale: XrVector3f,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XrGeometryInstanceCreateInfoFB"]
        [::std::mem::size_of::<XrGeometryInstanceCreateInfoFB>() - 80usize];
    ["Alignment of XrGeometryInstanceCreateInfoFB"]
        [::std::mem::align_of::<XrGeometryInstanceCreateInfoFB>() - 8usize];
    ["Offset of field: XrGeometryInstanceCreateInfoFB::type_"]
        [::std::mem::offset_of!(XrGeometryInstanceCreateInfoFB, type_) - 0usize];
    ["Offset of field: XrGeometryInstanceCreateInfoFB::next"]
        [::std::mem::offset_of!(XrGeometryInstanceCreateInfoFB, next) - 8usize];
